{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.46699905395508,
      "x2": 295.0302734375,
      "y1": 249.87905883789062,
      "y2": 423.8529968261719
    },
    "text": "ABSTRACT Competitive VR gaming has emerged as a new trend in recent years, due to the availability of consumer grade VR technologies and the rise of esports as a billion dollar industry. Despite the considerable attention to competitive VR gaming, there is a lack of research on attitudes and experiences that players have with these games. In this qualitative study with a pre-post interview design, we recruited eight competitive Counter-Strike: Global Ofensive players from a university esports club. We aimed to understand their attitudes towards VR esports and their experiences playing a representative location based VR esports game. Findings showed that players had visceral and positive afective experiences in the game, such as how players map physical movements to the game. These fndings can help design future competitive VR esports, while also further contributing to HCI as the frst exploration on player experiences with VR esports, laying groundwork for future studies."
  },
  "figures": [{
    "caption": "Figure 1: Participants engaging in the game at the VR entertainment arcade",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 295.64874267578125,
      "y1": 223.78907775878906,
      "y2": 240.376953125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "1",
    "page": 4,
    "regionBoundary": {
      "x1": 89.0,
      "x2": 258.0,
      "y1": 83.0,
      "y2": 210.0
    }
  }, {
    "caption": "Table 1: Participant information on their experience with professional esports and VR",
    "captionBoundary": {
      "x1": 317.6590881347656,
      "x2": 558.2007446289062,
      "y1": 430.8934326171875,
      "y2": 447.48126220703125
    },
    "figType": "Table",
    "imageText": ["P1", "Male", "3", "Yes", "No", "P2", "Male", "4", "Yes", "No", "P3", "Male", "3", "Yes", "No", "P4", "Male", "3", "No", "No", "P5", "Male", "5", "Yes", "No", "P6", "Female", "2", "No", "No", "P7", "Male", "3", "No", "No", "P8", "Male", "5", "Yes", "No", "ID", "Gender", "Apprx.", "Yrs", "Prof.", "XP", "XP", "w/VR", "Xp", "w/VR", "Esports"],
    "name": "1",
    "page": 4,
    "regionBoundary": {
      "x1": 323.0,
      "x2": 551.0,
      "y1": 463.0,
      "y2": 572.0
    }
  }, {
    "caption": "Figure 2: Participants Immersed in Sol Raiders Gameplay",
    "captionBoundary": {
      "x1": 58.00400161743164,
      "x2": 289.8392333984375,
      "y1": 239.06007385253906,
      "y2": 244.69097900390625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "2",
    "page": 10,
    "regionBoundary": {
      "x1": 65.0,
      "x2": 283.0,
      "y1": 139.0,
      "y2": 226.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.7979736328125,
        "x2": 295.648681640625,
        "y1": 442.7380676269531,
        "y2": 474.2439270019531
      },
      "text": "CCS CONCEPTS • Human-centered computing → Human computer interaction (HCI); Virtual reality."
    }, {
      "page": 0,
      "region": {
        "x1": 53.50199890136719,
        "x2": 278.6124572753906,
        "y1": 493.13006591796875,
        "y2": 513.6799926757812
      },
      "text": "KEYWORDS Virtual Reality Esports, Player Experiences, Qualitative Study"
    }, {
      "page": 0,
      "region": {
        "x1": 53.50299835205078,
        "x2": 294.9120178222656,
        "y1": 531.259765625,
        "y2": 586.0789794921875
      },
      "text": "ACM Reference Format: Selen Türkay, Jessica Formosa, Robert Cuthbert, Sonam Adinolf, and Ross Brown. 2021. Virtual Reality Esports - Understanding Competitive Players’ Perceptions of Location Based VR Esports. In CHI Conference on Human Factors in Computing Systems (CHI ’21), May 8–13, 2021, Yokohama, Japan. ACM, New York, NY, USA, 15 pages. https://doi.org/10.1145/3411764.3445073"
    }, {
      "page": 0,
      "region": {
        "x1": 53.31680679321289,
        "x2": 294.1777648925781,
        "y1": 621.2330932617188,
        "y2": 707.3472290039062
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for proft or commercial advantage and that copies bear this notice and the full citation on the frst page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specifc permission and/or a fee. Request permissions from permissions@acm.org. CHI ’21, May 8–13, 2021, Yokohama, Japan © 2021 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 978-1-4503-8096-6/21/05. . . $15.00 https://doi.org/10.1145/3411764.3445073"
    }]
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7140502929688,
        "y1": 264.2332458496094,
        "y2": 445.77099609375
      },
      "text": "Virtual Reality (VR) esports combine multiplayer competitive gaming with physical movements aforded by VR technology. It had emerged as a new trend in recent years thanks to the availability of consumer grade VR technologies and the rise of esports as a billion dollar industry [34, 35]. There are a number of key diferences which distinguish VR esports from traditional esports, including physical embodiment, technology and how audience spectate and interact with the games. VR esports, much like esports, can cover a range of activities, including both professional and casual play. For regular enthusiasts, consumer grade VR has made competitive VR gaming more accessible from home, while some technology companies (e.g., True VR [4], Zero Latency [7]) provide free-roaming competitive VR entertainment experiences for groups of players. Despite the increased interest in VR esports, there are few multiplayer competitive VR game titles available to players. There is room to innovate on VR esports games by taking advantage of the afordances of VR technologies."
    }, {
      "page": 0,
      "region": {
        "x1": 317.65899658203125,
        "x2": 559.7225952148438,
        "y1": 450.53424072265625,
        "y2": 697.8259887695312
      },
      "text": "While the success of videogames depend on player engagement and enjoyment [59], there is a lack of understanding of player experiences (PX) with and player attitudes towards VR esports games. Previous PX studies with VR games primarily rely on media comparison (i.e., comparing VR games to their desktop versions; e.g., [38, 71, 72, 81, 88]) and build on PX dimensions from traditional videogames (e.g., positive experiences, such as challenge and pleasure, and negative experiences, such as boredom and frustration [96]). However, these studies do not take into account unique strengths of VR technologies (e.g., sense of presence [82]). While PX with VR exergames (i.e., games that are played for the purposes of physical ftness) [39] may inform understanding PX with VR esports games, motivation to play those games may difer. In addition to enjoyment, exergame players are motivated by compatibility of the games with their current exercise habits and practicality, and are less driven by the goals of socializing with other people and competition [43]. Such diferences may afect the PXs. This current study was motivated by the rise of VR esports and the gap of knowledge about the PXs with these games. Understanding player attitudes towards VR esports and identifying what design aspects of these games produce enjoyable experiences are useful in creating VR esports games that motivate and engage players. Thus, this study aims to understand player attitudes towards VR esports and"
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0464172363281,
        "y1": 87.45320129394531,
        "y2": 115.5670166015625
      },
      "text": "their experiences with a representative location based VR esports game. In particular, we aim to start answering the following the research questions:"
    }, {
      "page": 1,
      "region": {
        "x1": 69.76065063476562,
        "x2": 294.3415222167969,
        "y1": 121.99593353271484,
        "y2": 161.45098876953125
      },
      "text": "• What are competitive esports players’ attitudes towards VR esports? • How do competitive esports players experience VR esports? • What are the perceived barriers to entry to VR esports?"
    }, {
      "page": 1,
      "region": {
        "x1": 53.53279113769531,
        "x2": 295.55859375,
        "y1": 168.26319885253906,
        "y2": 273.0889892578125
      },
      "text": "To answer these questions, a qualitative exploratory study with a pre-interview, gameplay, and post-interview structure was conducted with eight competitive Counter Strike: Global Ofensive (CS:GO) [20] players. Participants played a representative freeroaming state-of-art VR esports game called Sol Raiders where two teams of four competed against each other at a VR entertainment arcade. A purposeful sampling of esports players allowed us to understand how competitive esports players perceive VR esports and their experiences of the frst person shooter (FPS) VR esports game, building on their expertise with esports games."
    }, {
      "page": 1,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5574951171875,
        "y1": 277.85223388671875,
        "y2": 459.3909912109375
      },
      "text": "We found that player attitudes were shaped by the aspects of physical movement and embodiment in VR, and their potential positive impact on health. They enjoyed interactivity, immersion, and the potential unique skills and strategies aforded by the physicality of VR esports games. Participants noted that VR esports may have a higher skill ceiling than esports, and require coordination of physical and traditional videogaming skills. Spectating experiences were identifed as complex features of VR esports: the audience may both fnd the player actions engaging or comical but also might experience split attention with the action happening in the game. Sense of presence and social presence led to positive PXs. Immersion and embodiment aforded by VR technology infuenced players’ teamwork and strategies (e.g., crouching, jumping). Some of the major barriers for VR esports entry were technology, accessibility, lack of interaction fdelity (e.g., manipulating physical objects mapped in the VR game), cost, lack of availability of diferent games, space and technical constraints."
    }, {
      "page": 1,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5615539550781,
        "y1": 464.1532287597656,
        "y2": 612.8150024414062
      },
      "text": "This work contributes to HCI and games research communities by providing an initial understanding of esports players’ attitudes towards VR esports games and their experiences with a representative VR esports game. It provides theoretical and practical contributions. As the frst empirical study on VR esports, it expands on the previous work regarding VR PX in the context of VR esports where players experienced more challenge and less control while still being immersed in the game; as well as VR based exergames where players might be motivated to play VR esports games for positive health outcomes. It also provides preliminary design recommendations for engaging VR esports games. Overall, this study lays the path for more systematic analyses of player perceptions and experiences of VR esports that can result in further evidence based guidelines to design successful VR esports games."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 420.68597412109375,
        "y1": 249.87905883789062,
        "y2": 256.72998046875
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 148.44534301757812,
        "y1": 627.2711181640625,
        "y2": 634.1220092773438
      },
      "text": "2 BACKGROUND"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.50199890136719,
        "x2": 294.04864501953125,
        "y1": 657.316162109375,
        "y2": 707.3469848632812
      },
      "text": "VR provides 3D experiences to users that allows them to engage in the virtual world using advanced technologies (e.g., head mounted displays, motion tracking). VR has multiple afordances that create excitement and drive innovation in a variety of felds, including entertainment, education [50], and health [28]."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7179565429688,
        "y1": 87.45320129394531,
        "y2": 192.27899169921875
      },
      "text": "One of the most salient features of VR is its ability to create immersion. Immersion is closely related to the technical capabilities of the virtual environment and refers to the objective level of sensory fdelity a VR system provides [15]. In a fully immersive VR experience, human senses can be engaged visually (i.e., by creating a stereoscopic 3D efect) through headsets, aurally via headphones (i.e., by creating directional audio to help players identify the sources and directions of events through sound), and tactilely through haptic feedback (e.g., by using force controllers and special gloves, players can interact with game objects)."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1889038085938,
        "y1": 197.0421905517578,
        "y2": 279.95001220703125
      },
      "text": "When compared to 2D or 3D desktop virtual environments, these features may enhance users’ sense of presence [72, 75]. Presence is defned as the feeling of ’being there’ [82], and has been shown to create greater afective experiences for users [86, 99]. Highly immersed users may perceive their virtual experience as more real, and a higher level of immersion can lead to greater understanding, heightened emotional response, and a better performance which can improve user experiences with the systems [45]."
    }, {
      "page": 1,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.5828857421875,
        "y1": 284.7132263183594,
        "y2": 411.4549255371094
      },
      "text": "Another unique afordance of VR is embodiment. In the context of VR experiences, embodiment refers to \"the physical process that employs the VR hardware and software to substitute a person’s body with a virtual one\" [84]. Embodiment may increase users’ illusion of body ownership and agency in the virtual environment [84]. Virtual body ownership, defned as \"a virtual body coincident in space with the real body, and seen from the frst person perspective,\" can create the illusion that the virtual body is the person’s real body ([83], p.30). This allows users to see themselves as part of the virtual environment [10]. It can also lead to implicit changes in attitude, perceptions and cognition, changes in behavior [83], and may heighten users’ emotional experiences."
    }, {
      "page": 1,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7188720703125,
        "y1": 416.22021484375,
        "y2": 510.0870056152344
      },
      "text": "The network capabilities of VR enable multiple users to interact with each other (e.g., communicate, compete, collaborate). Supported by sense of presence and embodiment via avatars, players in a multiplayer VR environment can feel co-present (e.g., feeling of being with others at the same location even when they’re not; [52, 66]). The feeling of co-presence can enhance players’ reactions to environmental efects, such as threats from the enemies or opportunities in the game [67]. It may also lead to greater positive immersive experiences [99]."
    }, {
      "page": 1,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.4353637695312,
        "y1": 514.8502197265625,
        "y2": 608.7169799804688
      },
      "text": "A technical limitation of earlier VR headsets was that they needed to be connected via a cable to their respective systems which would limit player movements. In recent years, VR systems have started to become both low cost and non-tethered to allow for everyday consumers to access the technology and also to provide users with more freedom in their movement. The advancements in VR technology which allow such freedom in user movement has also led to the development of free-roaming location based VR arcades, which host numerous competitive VR esports games."
    }, {
      "page": 1,
      "region": {
        "x1": 317.65899658203125,
        "x2": 559.719482421875,
        "y1": 624.439208984375,
        "y2": 707.3469848632812
      },
      "text": "2.1.1 Location Based VR Arcades. In this paper, we use the term location-based VR to refer to entertainment centers with dedicated VR spaces or VR arcade games. Location-based entertainment centers ofer room-scaled experiences (e.g., Zero Latency [7]) and use a combination of movement and VR headset tracking within a dedicated area to stimulate moving in the virtual world. The most advanced of these VR arcades also support groups of users allowing multiplayer experiences."
    }, {
      "page": 2,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5554504394531,
        "y1": 87.45320129394531,
        "y2": 214.197021484375
      },
      "text": "There are diferent multiplayer categories of location-based VR games, including VR escape rooms (e.g., Assassin’s Creed Universe by Ubisoft [94], Eclipse by Backlight [11]) and arena style games. Room-scaled location-based VR also uses various types of locomotion which can include joysticks, teleportation, and redirected walking (RDW) [51]. RDW refers to the practice of curving the users’ paths by an imperceptible amount as they walk. This allows the creation of ’infnite’ spaces, where the user can walk around virtually freely, while they remain in a limited physical space. RDW continues to be innovated on, not only to improve its quality, but also to determine the limits of how far developers can bend a user’s path and their experiences in a VR game [51]."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79624938964844,
        "x2": 295.5587158203125,
        "y1": 218.96022033691406,
        "y2": 378.5799865722656
      },
      "text": "Arena style games use sophisticated tracking technology and can scale from 1000 to 4000 square feet, with between six and 20 players inside the room, playing together. They can employ fullbody tracking, allowing players to actually touch each other in the real and virtual worlds, making these VR activities highly social [29]. The social component of these multiplayer VR experiences are a strong motivator for many users. Kari [42] found that the most common reason people visit VR arcades was to have fun with a group of people. Another study exploring social aspect found that interdependence among team members in a room-scale VR setting can enhance social presence and cooperation [97]. Our study extends these fndings with location-based VR arcade games to competitive esports games to help us have a greater understanding of player attitudes and experiences with diferent types of locationbased VR games."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 169.56536865234375,
        "y1": 642.9583740234375,
        "y2": 649.8092651367188
      },
      "text": "2.1 Afordances of VR"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.0281677246094,
        "y1": 405.26123046875,
        "y2": 499.12799072265625
      },
      "text": "Players can interact with a VR game environment in numerous and unique ways, such as through the controllers, haptic gloves, head rotation and eye movements. These diferent modes of interaction can lead to difering types of PXs compared to those played on desktop computers or game consoles. Due to the lack of research on PXs with VR esports, it is important to frst explore PXs with VR games. This section will provide an overview of these studies, which build on game user experience studies with digital games and treat VR games a special form of digital games (e.g., [57])."
    }, {
      "page": 2,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.5577392578125,
        "y1": 503.8912353515625,
        "y2": 685.4299926757812
      },
      "text": "The majority of existing studies on VR PX compared PXs in traditional or console games to those in VR (e.g., [38, 71, 72, 81, 88]). These studies were conducted using diferent types of games. Peng et al. [73], tested players’ afective states, immersion, and presence after they played a horror game and a narrative storytelling game. For both games, participants reported higher levels of positive emotional experience, immersion, and presence in VR compared to the desktop game. In a within-subjects study with 24 participants, Pallavicini and colleagues [71] found that participants reported similar levels of difculty playing a simple shooter game across both an immersive VR system and a desktop display. However, VR game players showed more intense emotional responses, which were measured using questionnaires and psycho-physiological instruments (e.g., heart rate measures). Another study compared participants’ experiences when playing a racing game in VR and using a game console [70]. They found that the VR game elicited more positive emotions, and higher levels of immersion and fow."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.0286865234375,
        "y1": 690.1931762695312,
        "y2": 707.3469848632812
      },
      "text": "Presence in VR games has been explored by a number of studies, testing it across various genres. These studies found that players"
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7144775390625,
        "y1": 87.45320129394531,
        "y2": 236.114990234375
      },
      "text": "reported a higher sense of presence when playing FPS and horror games in VR when compared to less immersive setups [71, 98, 101]. In the context of a serious narrative based VR game, active interaction led to increased presence and cognitive interest in tasks compared to passive guided experiences [24]. Immersive factors related to VR were further explored in an interview study by Winkler and colleagues [99]. In this study, immersion was specifcally defned as a lack of awareness of an individual’s environment and they found three specifc categories of immersive factors in VR: physical and psychological aspects, cognitive and afective aspects, and social interaction and shared experiences. From these categories, it was suggested that translating actions from the physical real world to the virtual world and shared experience were novel immersion factors for VR users."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7145385742188,
        "y1": 240.87721252441406,
        "y2": 367.6210021972656
      },
      "text": "Related to virtual body ownership [83], Hartmann and Fox [32] suggest that VR experiences might be entertaining because they provide distraction from actual selves through expansion of embodied virtual selves. VR experiences allow for enjoyable expansions of the self, even in non-narrative forms. They include users’ physical self and introduce capabilities of a new virtual body (e.g., learning to control a third arm [100]). Supported by embodiment and sense of presence, VR experiences can evoke relatively intense primary psychological responses given their realistic sensory motor cues [32, 61, 72]. Some studies have even shown evidence that VR games can induce heightened emotional responses when compared to desktop games [38, 72, 73, 77, 88]."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7181396484375,
        "y1": 372.38421630859375,
        "y2": 466.25201416015625
      },
      "text": "A major limitation of the present literature is the lack of studies investigating multiplayer experiences in VR games. One of only two studies exploring the social aspects of VR games found that social entities (e.g., agents, avatars) may decrease player enjoyment and immersion [57]. However, this study used a simple cooperative game, rather than a team based competitive game. It was also contradicted by the fndings of Wikler et al.’s [99] study which did not fnd a decreased level of immersion in the multiplayer VR game they looked at."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 240.1581573486328,
        "y1": 390.9070739746094,
        "y2": 397.75799560546875
      },
      "text": "2.2 Player Experiences in VR Games"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7174072265625,
        "y1": 525.8092041015625,
        "y2": 707.3469848632812
      },
      "text": "VR esports has been applauded as the next level of competitive gaming, combining \"the best of technology, athleticism and competition,\" [35]. Afordable high grade VR technology, such as Oculus Rift [2], HTC Vive [6] and PlayStation VR [3] entered the consumer market around 2016. It was also around this time that esports (otherwise known as competitive videogaming) also become mainstream [31]. The popularity of VR esports has been growing since then, leading to the foundation of an ofcial esports tournament in 2018 that featured the game Onward [40] [33] and a college league in the latter half of 2019 [34, 35]. There have been further growth in the VR esports league, with plans for a high school league in the near future [34]. FPS games (i.e.,Contractors [85],Onward [40] and Space Junkies [93]) are the most common in VR esports tournaments [63]. These games have a heavy focus on team based competition that pits two teams against each other in a virtual environment. Due to the popularity of team based FPS games in VR, we chose a team-based FPS game to investigate in our study."
    }, {
      "page": 3,
      "region": {
        "x1": 53.50199890136719,
        "x2": 295.5593566894531,
        "y1": 87.45320129394531,
        "y2": 301.8680114746094
      },
      "text": "The unique physical experience that VR can provide to users has been utilized in exergames, which is the use of physical exercise with videogaming. Exergames can promote physical activity and enhance users’ health and ftness in engaging ways by combining challenging, yet entertaining and cognitive tasks together [22, 26, 58, 102, 103]. VR exergames have been shown to be motivating and can lead to positive and immersive user experiences [13, 26, 103]. A previous study found the positive relationship between interface embodiment, presence and enjoyment in exergames [47]. Given the potential high embodiment aforded by VR technologies, players may experiences heightened enjoyment in the game. Recently, exergames have been proposed to be used as complimentary training tools for esports athletes [58]. While VR based exergames and VR esports have similarities, in that both involve physical movement, player motivations to play those games might difer. While both games can be played for entertainment, exergames may involve players who are interested in performing mild exercises [69] whereas VR esports players might be strongly driven by competitive aspect of the games. These difering motivations may lead to diferent PXs between exergames and VR esports."
    }, {
      "page": 3,
      "region": {
        "x1": 53.57400131225586,
        "x2": 295.5565490722656,
        "y1": 317.5902404785156,
        "y2": 400.49798583984375
      },
      "text": "2.3.1 Esports. VR esports has been highly infuenced by the success and popularity of traditional esports which is commonly referred to as competitive online gaming. Esports is the umbrella term which has been used to describe the relationships and involvement of stakeholders, sponsors, fans and the overall esports society [31, 46, 92]. Esports players consist of both amateur and professional players, many of which become involved in teams and participate in tournaments to showcase their skills [31]."
    }, {
      "page": 3,
      "region": {
        "x1": 53.795684814453125,
        "x2": 295.560546875,
        "y1": 405.26123046875,
        "y2": 488.16900634765625
      },
      "text": "Esport games are highly competitive in nature, drawing in players who are motivated by the competitive aspects of videogames [41, 54, 95]. Many involve complex teamwork mechanics, which brings players together to work cohesively in order to complete game objectives [41]. These aspects help players to challenge themselves, have a sense of satisfaction gained from their teamwork, and experience a sense of mastery in their gameplay skills. Some are even able to turn their esports hobbies into careers [30]."
    }, {
      "page": 3,
      "region": {
        "x1": 53.367431640625,
        "x2": 295.55877685546875,
        "y1": 492.9322204589844,
        "y2": 597.7579956054688
      },
      "text": "The growing popularity of esports has seen its viewership increase into the millions. For example, this year’s League of Legends World Championship reached a peak viewership of 3.8 million people [23]. People are motivated to spectate for numerous reasons; for instance, watching others play allows people to learn more about the game, and can also help them to improve their own skills by learning new game strategies [19, 31]. Researchers highlighted that esports may be more engaging to watch than traditional sports (e.g., [74]). Given the technological immersion aspect of VR esports, this engagement might even be higher for VR esports spectators."
    }, {
      "page": 3,
      "region": {
        "x1": 53.7965087890625,
        "x2": 295.4259033203125,
        "y1": 613.480224609375,
        "y2": 707.3469848632812
      },
      "text": "2.3.2 How is VR esports diferent from traditional esports? One of the most notable diferences between traditional and VR esports is physical embodiment. While traditional videogames have often been associated with unhealthy and inactive lifestyles, VR esports games require a lot more physical interaction [36]. In-game motions are directly refected by players’ physical actions in real life [99]. In a game such as Echo Arena [9], players need to crouch, jump, and dodge their opponents as they play. VR esports may combine esports expertise (i.e., hand-eye coordination and reaction time)"
    }, {
      "page": 3,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.2034301757812,
        "y1": 87.45320129394531,
        "y2": 104.60797119140625
      },
      "text": "with the physical skills involved in traditional sports (i.e., stamina and form [60])."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7200317382812,
        "y1": 109.37123107910156,
        "y2": 247.072998046875
      },
      "text": "There are also some major diferences between VR and traditional esports in terms of technology. Instead of the typical PC, keyboard and mouse used to play traditional esports, VR esports technology involves headsets, joysticks and sometimes even props to match the in-game weapons and equipment [49]. The technology used for VR is continuously advancing, allowing players the opportunity to use free-roaming and motion tracking platforms to enhance players’ physical engagement during gameplay. One example of this is the Omni motion platform [5], which has been used in VR to \"add the physical engagement of walking and running to the gaming experience and that physical element combined with multiplayer gameplay and competition results in high repeat play,\" [14]."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1910400390625,
        "y1": 251.83619689941406,
        "y2": 356.6629943847656
      },
      "text": "The spectator component of VR esports difers from traditional esports spectatorship. Much like traditional esports, which brings teams of players together to compete in tournaments, VR esports brings players together and creates a unique social environment, mediated by VR technology. One major diference between the two is that spectators of VR have a lot more to take in. They watch the game take place in the virtual world as well as watch the players’ physical movements and form. Due to a lack of research in this area, it is unclear how such multi-dimensional engagement impacts audience experiences."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 442.27508544921875,
        "y1": 511.4551086425781,
        "y2": 518.3060302734375
      },
      "text": "2.3 What is VR esports?"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 317.6211242675781,
        "x2": 559.7144775390625,
        "y1": 394.3022155761719,
        "y2": 542.9639892578125
      },
      "text": "This study employed a qualitative approach to answer the research questions in three phases. In the frst phase, we conducted oneon-one semi-structured interviews with the participants on their experiences with esports and sought to understand their prior experiences with, and attitudes towards, VR and VR esports. Participants were asked questions such as, \"Have you heard of VR esports?\" and \"What would be some of the advantages/disadvantages of VR for esports?\" The interviews lasted between 20-40 minutes and took place either at a game laboratory in person or via Discord [1]. Towards the middle of the interview, participants were shown a 5-minute video from the 2018 ’Onward’ [40] invitational tournament to give them an initial understanding of what VR esports gameplay may look like. They were asked follow-up questions on their perceptions of VR esports upon watching the video."
    }, {
      "page": 3,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7157592773438,
        "y1": 547.7271728515625,
        "y2": 630.635009765625
      },
      "text": "In the next phase, participants played a representative VR esports game at a local VR entertainment arcade. The session began with a 10-minute mandatory tutorial. Participants then played two sets of the game, each lasting 15 minutes. The frst game was a practice round, while the second was competitive. The researchers made observations during the games and videotaped the players. However, due to the insufcient light in the environment, videos were not used in the analysis."
    }, {
      "page": 3,
      "region": {
        "x1": 317.6194763183594,
        "x2": 558.5354614257812,
        "y1": 635.398193359375,
        "y2": 707.3469848632812
      },
      "text": "The fnal phase involved a semi-structured focus group interview with the participants at the university. The interview took about 40 minutes and aimed at understanding participants’ experiences with the representative VR esports game they just played. They were also asked to compare their VR experience to playing traditional esports games. Questions included, \"How was your experience today playing a VR esports game?\" and \"Having now experienced"
    }, {
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.048095703125,
        "y1": 274.84423828125,
        "y2": 357.75201416015625
      },
      "text": "a VR esports game, what are your thoughts and feelings about VR esports in general?\" We posed follow up questions to elicit further information from participants. Some of these questions were informed based on prior literature (e.g., Self-Determination Theory [78]). For instance, we asked them how diferent mechanics of the game infuenced their sense of autonomy in the game as a follow up question after having them speak about their experiences with the game."
    }, {
      "page": 4,
      "region": {
        "x1": 53.79341125488281,
        "x2": 295.0342102050781,
        "y1": 362.5152282714844,
        "y2": 456.3819885253906
      },
      "text": "The interviews were then transcribed verbatim and coded using Nvivo12 software with an inductive thematic analysis using the six step process (i.e., familiarization with the data, initial coding of the data by two researchers, iterative sweeps through the data and codes to fnd themes, reviewing and discussion of themes as a group, refning and naming themes, and lastly writing up [16]). The frst and second authors generated the initial codes. The fnal set of codes were created through discussions, resolving disagreements, and iterative sweeps of data."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 419.9333190917969,
        "y1": 379.9490661621094,
        "y2": 386.79998779296875
      },
      "text": "3 METHODOLOGY"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.0341796875,
        "y1": 486.2542419433594,
        "y2": 612.9979858398438
      },
      "text": "3.1.1 VR Arcade - Zero Latency: Zero Latency is a technology company that operates VR gaming venues in multiple locations internationally [7]. They use RDW, cable-free VR equipment and motion capture to allow users to move freely in an open space, and render the avatars of players. These techniques allow players to travel up to 1km during a standard game session. Proximity sensors warn players of hazards and prevent them from leaving the physical play area and from running into each other. Players are ftted with a wireless VR headset and a backpack, weighing 4kg, with the weapon being a further 1.7kg. Play is made possible using light tracking on players’ head and weapon within the darkened play area, which is roughly 4.5m x 18.2m (see Figure 1)."
    }, {
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5623779296875,
        "y1": 624.439208984375,
        "y2": 707.3469848632812
      },
      "text": "3.1.2 Game: Participants played the FPS game ’Sol Raiders’ which was advertised as a VR esports game on Zero Latency’s website (see https://www.zerolatencyvr.com/vr-esports/). It has common characteristics seen in other esports games such as CS:GO. In addition, the company had organised local VR esports tournaments for Sol Raiders. In this game, participants are divided in two teams of four to combat each other and achieve objectives. One game consisted of ’best out of three’ rounds, each played on diferent maps."
    }, {
      "page": 4,
      "region": {
        "x1": 317.62103271484375,
        "x2": 558.2034301757812,
        "y1": 87.45320129394531,
        "y2": 170.36102294921875
      },
      "text": "Objectives included controlling a point on the map or having the highest number of kills within a set time. When killed, players must walk back to their team’s respawn point and stand on a platform to re-enter the match. Players communicate with their team through headsets. There is also a game director who manages the game and can take action if there are any issues that arise, such as pausing the game to reset or switch a player backpack if there is a technical issue."
    }, {
      "page": 4,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7178344726562,
        "y1": 180.54823303222656,
        "y2": 405.9219970703125
      },
      "text": "3.1.3 Participants: Eight participants, aged between 17 and 21, were recruited through a university esports club in Australia. While this sample is mostly men (n=7), it is a representation of the gender distribution of the university’s esports club. Out of the 556 members of the esports club, only 36 members (6%) are women. All participants in this study were competitive CS:GO players (see Table 1 for more details). They had previously participated in esports tournaments, such as the Cyber Game Open tournaments (P1, P5), other local and interstate tournaments (P2, P3, P4, P5, P7, P8), and P6 had participated in international events. Participants were not part of the same team but had played together substantially in the university’s esports club. Participants were compensated with $20 gift cards for their time. The research team also paid their fees for the VR arcade game session. Three participants (P4, P6 and P7) had no experience with VR at all, while the other participants had limited experiences through demonstrations of VR at gaming conventions and schools (P2, P3 and P8), or through friends who had VR equipment (P1 and P5). Lack of familiarity with VR was common in a majority of prior VR PX studies (e.g., [27, 56]). The participants had neither been to Zero Latency before the study nor had experience playing VR esports before."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 125.05624389648438,
        "y1": 471.90008544921875,
        "y2": 478.7510070800781
      },
      "text": "3.1 Materials"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 381.3150939941406,
        "y1": 594.3941040039062,
        "y2": 601.2449951171875
      },
      "text": "4 RESULTS"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.4320068359375,
        "y1": 624.439208984375,
        "y2": 707.3469848632812
      },
      "text": "At the beginning of the interviews, we asked participants about their attitudes towards both VR and VR esports. Most (n=7; all but P6) exhibited positive attitudes towards VR and in general they believed VR experiences were fun (n=2; P1, P5) and immersive (n=3; P5, P7, P8). Given that none of the participants were familiar with VR esports, they were shown a representative video of a team competing in a game of Onward [40]. They were then asked about their thoughts on VR esports based on this. The following results"
    }, {
      "page": 5,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.2127685546875,
        "y1": 87.45320129394531,
        "y2": 104.60797119140625
      },
      "text": "will note if the participants’ reported comments were made after watching the video."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5609130859375,
        "y1": 109.37123107910156,
        "y2": 159.4019775390625
      },
      "text": "We identifed fve themes as major factors determining participants’ attitudes towards VR esports: physical embodiment, immersion and interactivity, technology and accessibility, audience and spectating, and skills and strategies. These themes will be presented in detail below."
    }, {
      "page": 5,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.5645751953125,
        "y1": 175.1242218017578,
        "y2": 268.99102783203125
      },
      "text": "4.1.1 Physical Embodiment and Health. The majority of participants held positive attitudes about the physical embodiment of VR. They compared it to traditional esports, which requires players to sit for long hours (n=6; P1-4, P6-7). P2 made an extensive cross comparison among traditional sports, esports and VR \"...they say that esports isn’t a real sport... saying, ’Hey, you’re not moving around enough, you’re not an athlete,’... But I think that VR is like that in the middle...you’re moving around, doing all this stuf and still gaming but also being athletic...\""
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.0341491699219,
        "y1": 273.7542419433594,
        "y2": 367.6210021972656
      },
      "text": "Some participants pointed out potential health implications as a disadvantage for VR esports (n=4; P1, P3, P4, P8). In particular, they were concerned about motion sickness (n=4), eye strain (n=2; P1, P3), and the possibility of injuring others, especially if the VR game was set up in a free-roaming environment (n=2; P3, P4). When comparing the health implications of VR and traditional esports, P1 spoke about how traditional esports does share similar health concerns (e.g., eye strain), these things could be more severe in VR due to the close proximity of the headsets to the players’ faces."
    }, {
      "page": 5,
      "region": {
        "x1": 53.50199890136719,
        "x2": 295.4273986816406,
        "y1": 372.38421630859375,
        "y2": 499.12799072265625
      },
      "text": "After participants viewed the example video of what VR esports might look like, they continued to talk positively about the physical embodiment involved in VR. P1 elaborated on the health benefts VR esports may have compared to traditional esports as, \"...[there are] a lot of back problems in esports players because they have to be quite close to monitors. Whereas this, there is no monitor. The monitor is strapped to their head so they get to have a little bit of leniency to move a little bit.\" Others saw physical movement, such as free-roaming, as a major beneft to the gaming experience as, \"it adds a fourth dimension to the game almost...\" (P4). P3 even suggested that VR players would be more immersed when compared traditional esports due to embodiment and free movements."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.3789978027344,
        "y1": 503.8912353515625,
        "y2": 619.676025390625
      },
      "text": "Participants also discussed how VR technology provided new mechanics for embodiment that traditional esports games could not provide. As p3 put it, \"it’s a lot more interactive in terms of body movements,\" and suggested that, compared to CS:GO, playing VR esports games would require \"actual stamina.\" Participants brought up implications of embodiment on social aspects of the game and suggested how expressing body language as a game mechanic may lead to \"better team chemistry.\" And as P2 mentioned, \"Like in Counter Strike you could move with your teammates, aligned or in perfect spacing. But if you’re in VR, you could be behind someone and actually notice what they’re doing.\""
    }, {
      "page": 5,
      "region": {
        "x1": 53.50199890136719,
        "x2": 294.2745361328125,
        "y1": 624.439208984375,
        "y2": 674.4710083007812
      },
      "text": "Participants made it clear that the physical embodiment of VR esports, along with the potential health implications, were defnitely a major aspect which could have an impact on players and their experiences. This was one of the most distinguishing features of VR esports that can’t be achieved in traditional esports."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.0341491699219,
        "y1": 690.1931762695312,
        "y2": 707.3469848632812
      },
      "text": "4.1.2 Immersion and Interactivity. Immersion was another aspect of VR that participants held positive attitudes about (n=5; P1, P2,"
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.582275390625,
        "y1": 87.45491027832031,
        "y2": 104.60797119140625
      },
      "text": "P5, P7, P8 ). They coupled interactivity and immersion together when talking about their prior experiences and impressions of VR."
    }, {
      "page": 5,
      "region": {
        "x1": 317.65625,
        "x2": 559.7203979492188,
        "y1": 109.37123107910156,
        "y2": 268.99102783203125
      },
      "text": "After viewing the example of VR esports, the immersive aspect of VR esports was still seen as a positive quality among the participants. Some pointed out how concentrated the players looked in the representative video, \"they’re quite serious... they’re actually quite involved and immersed into it,\" (P2). For P4, however, the immersiveness was something they believed wouldn’t ft their gameplay strategies as they like taunting enemy teams. They continued, \"I don’t think you can do that as much with VR... it just looks like they’re a lot more immersed in their own game and you wouldn’t be able to, sort of, get in opponents’ heads.\" They did admit, though, that this may beneft others with diferent play styles. P7 made the comparison between CS:GO view models and player movements in VR, and highlighted a potential issue that may break player immersion due to hitboxes, \"the player models crouch down or something like that...[the] model moves around a lot. It is gawky.\""
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.5301513671875,
        "y1": 273.7542419433594,
        "y2": 312.8269958496094
      },
      "text": "Once again, the immersiveness and interactivity of VR esports was something the majority of participants viewed positively. A few participants’, however, believed less immersion would be preferable for greater social interaction with their opponents."
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7216186523438,
        "y1": 328.5492248535156,
        "y2": 422.4159851074219
      },
      "text": "4.1.3 Audience and Spectating. Participants spoke about the potential unique experiences spectating VR esports may provide. The majority mentioned how VR esports would be a unique experience for spectators due to the embodied play (n=6; P2-6, P8). P6 commented that compared to traditional esports spectatorship, \"[VR esports spectatorship] might be more exciting to see people actually moving, because I know a lot of the people who are critical of esports compared to normal sports is that, you know, you’re watching someone sit there, do nothing.\""
    }, {
      "page": 5,
      "region": {
        "x1": 317.95489501953125,
        "x2": 559.7157592773438,
        "y1": 427.1792297363281,
        "y2": 564.8820190429688
      },
      "text": "Another sentiment which stemmed from the physical embodiment of VR esports was that watching the players in a VR environment might look comical (n=4; P2, P3, P4, P7). P4 spoke about their view of it as, \"people might watch it because it’ll look funnier. Like when someone’s playing a game... you can’t actually see what they’re seeing on the monitor. You’re only seeing what the observer sees. But there is more movement involved. Some people might run around with their mouths open, that might be a bit funny. Or they might trip over themselves, that might be funny. There will be a, sort of, comedy aspect.\" Because of this, P4 believed that VR esports would attract a good audience. P8 also suggested that VR esports would be particularly attractive to a younger audience as they believed it to be something they’d like to get involved with."
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7166137695312,
        "y1": 569.6452026367188,
        "y2": 707.3469848632812
      },
      "text": "After viewing the video, the participants had a better idea about spectating a VR esports game. Many identifed some of the challenges that might accompany VR esports spectating. These included the difculty of the observer following the game, and splitting attention between gameplay in the virtual environment and player movements. P2 noted the difculty the observer had in following the game, while P4 remarked that, \"one thing about [CS:GO] is that when you spectate it, it’s sort of like you’re telling a story each round. He continued by saying that it was not possible for him to get a similar feeling when watching the VR esports match, \"it’s just someone kind of controlling the camera and fying around, its not easy to understand the point of focus.\" When spectating a traditional esports match, they reported that viewers pay attention"
    }, {
      "page": 6,
      "region": {
        "x1": 53.50199890136719,
        "x2": 294.0431213378906,
        "y1": 87.45320129394531,
        "y2": 115.5670166015625
      },
      "text": "to the game and not the actual players. However, when watching a VR game, they would focus on both players’ physical movements and the gameplay, which may create split attention."
    }, {
      "page": 6,
      "region": {
        "x1": 53.464080810546875,
        "x2": 295.5628662109375,
        "y1": 120.33021545410156,
        "y2": 225.156005859375
      },
      "text": "Participants remarked that these challenges would make broadcasting VR esports even more challenging than traditional esports as the VR players are also part of the spectacle. When talking about whether they are drawn to either the players of the gameplay while watching the video, P5 remarked, \"I notice my eyes go over towards [the players].\" In line with the comical aspect of spectating, P7 even commented that he found watching the players move, in comparison to their in-game models, as entertaining, \"people will probably laugh at that... where as, I’m like ’Sick, that looks awesome!\""
    }, {
      "page": 6,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.4216003417969,
        "y1": 229.91920471191406,
        "y2": 279.95001220703125
      },
      "text": "Overall, participants had a lot to say in regards to spectating. While they had positive attitudes of the immersive and engaging aspects of VR, after viewing the representative VR game they noted some potential challenges (e.g., split attention) that would be caused by watching VR esports as an audience member."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0472717285156,
        "y1": 295.6722412109375,
        "y2": 334.7449951171875
      },
      "text": "4.1.4 Skills and Strategies. Participants spoke about the strategies that would be employed for VR esports games. Some contemplated how communication and teamwork for VR esports players might difer from traditional esports players."
    }, {
      "page": 6,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.55914306640625,
        "y1": 339.50823974609375,
        "y2": 444.3340148925781
      },
      "text": "While some (n=4; P2, P3, P5, P6) believed that the communication and teamwork strategies would be similar to those used in traditional esports, others (n=4; P1, P4, P7, P8) believed that they would be quite diferent. The latter group mainly focused on space and communication diferences. P7 spoke about how the diferent environment VR esports is set in might be a major disadvantage as it would impact how team members communicate with each other. P4 further pointed out that practicing as a team might be difcult due to space restrictions, which may prevent developing team strategies."
    }, {
      "page": 6,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5628356933594,
        "y1": 449.09722900390625,
        "y2": 608.7169799804688
      },
      "text": "Upon watching the video, the immersive aspect of VR was further praised as something that would allow variety in strategies and maneuvers used in-game; from crouching lower, to jumping higher, and using spatial features of the VR environment. The participants like the reliance on the players physical actions, for instance, \"how they managed to get lower on the ground and make their hitbox very small,\" (P1). They also thought the VR FPS game they watched was very similar to CS:GO except it’s, \"... a lot more body movement... and a higher skill ceiling,\" (P3). Similarly, P7 talked about diferent strategies VR esports games may support, \"in [CS:GO], old maps become very stagnant. There’s no extra strategies, you know? Like beyond a point... your player can only stand, it can only crouch... Whereas this here, I feel you can sort of step out of those boundaries... you can have it front, crouch... and you can get those halfway positions... like infnite choices.\""
    }, {
      "page": 6,
      "region": {
        "x1": 53.48400115966797,
        "x2": 295.5606689453125,
        "y1": 613.480224609375,
        "y2": 707.3469848632812
      },
      "text": "Three participants (P3, P4, P8) also spoke about the skill of VR esports players. Players thought that VR esports may have a higher skill ceiling and require the combination of general videogaming and physical skills. As P4 discussed, \"I think it just provides a different sort of platform for people to show their skills on because you might very well have players that will have been on VR since the beginning and have built up their skills to a high skill level... And me, coming from just a CS:GO background, they’ll completely outclass me.\""
    }, {
      "page": 6,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.187255859375,
        "y1": 87.45320129394531,
        "y2": 148.4429931640625
      },
      "text": "Participants noted the clear advantage VR esports may have for people to showcase a diferent range of skills. In terms of the VR esports strategies, the attitudes from participants were somewhat mixed, with some believing it would be similar to traditional esports, while others believed the nature of VR would mean that strategies devised would have to be quite diferent."
    }, {
      "page": 6,
      "region": {
        "x1": 317.65899658203125,
        "x2": 559.7144165039062,
        "y1": 164.66322326660156,
        "y2": 291.4070129394531
      },
      "text": "4.1.5 Technology and Accessibility. Most participants saw the advanced technology for VR as a major advantage. Some spoke about how the developments in VR technology can facilitate a variety of strategies and more immersive gameplay (n=2; P1, P7). However, the general stance of the majority was that in order for competitive VR to work, the technology has to be perfect; from graphics to body tracking to props. A few posed multiple questions regarding the afordances of VR technology to provide a satisfying esports experience. Some thought wearing all the necessary equipment could limit player control and accessibility to broader audiences, \"whereas in a competitive VR sense, you’d probably be a bit more restrictive in that because you always have gear on,\" (P5)."
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.1911010742188,
        "y1": 296.17022705078125,
        "y2": 379.0780029296875
      },
      "text": "After the video, participants were surprised to see how advanced the VR technology was, including the graphics, motion tracking, the props and controls and its state as an esport. P8 summed up the general sentiment participants had in this area, \"so they do actually have utility which is interesting... I am enjoying the graphics. I didn’t expect the graphics to be this far along... that tracking of the body and when I’m crouching... I’m surprised... this looks sick to be honest!\""
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.4354858398438,
        "y1": 383.8412170410156,
        "y2": 433.87298583984375
      },
      "text": "Overall, most participants were excited about the technology involved in VR esports and were surprised how advanced it already is. Major concerns they posed were regarding the afordability and accessibility of it. In their view, this was something that may limit players wanting to try VR esports."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 530.2459716796875,
        "y1": 610.0813598632812,
        "y2": 616.9322509765625
      },
      "text": "4.1 Attitudes Towards VR and VR Esports"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 342.358642578125,
        "x2": 428.9332580566406,
        "y1": 467.1191711425781,
        "y2": 473.9700927734375
      },
      "text": "VR Esports Game"
    }, {
      "page": 6,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.1911010742188,
        "y1": 481.4752197265625,
        "y2": 531.5069580078125
      },
      "text": "In the post-game focus group, we asked participants to talk about their experiences playing the representative VR esports game, Sol Raiders. Below we will present the major themes. Unfortunately, due to the focus group method, we could not identify participants voices in the audio recordings."
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7136840820312,
        "y1": 547.7271728515625,
        "y2": 707.3438720703125
      },
      "text": "4.2.1 Immersion. Participants were surprised at how immersive their game experience was which became more obvious in the second game. In the second game, it appeared as though the participants were more comfortable with the game settings and were using the 3D aspect of the environment more. They were crouching, jumping and leaning over virtual walls. One remarked on it saying, \"I don’t know about these guys but I was wigged out by it!\" They continued describing the immersive experience, \"... going up ramps and stuf... I really wanted to put my feet up high.\" Many commented that they enjoyed embodied aspects of the game and being able to use the spatial nature of the map for their strategies. One participant said that they, \"... enjoyed the game mechanics... In the last map... I got like... behind the wall and just stuck my gun, shot out from the middle...\" Another participant added that this aspect, \"... kind of seems a bit game breaking. I mean it’s not like"
    }, {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2793273925781,
        "y1": 87.45320129394531,
        "y2": 104.60797119140625
      },
      "text": "Counter Strike or any other game that I know. I guess we can only do it in VR.\""
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.55877685546875,
        "y1": 109.37123107910156,
        "y2": 225.156005859375
      },
      "text": "The team communication also had a major impact on immersion. They continuously compared the two games they played, as the second one was unfortunately afected by latency. When their microphones worked in the frst game, participants had no issues regarding team communication and this helped them coordinate efectively. In the second game, the lag meant that they could only hear small parts of the team’s communication. Due to this, they had to resort to shouting commands at their teammates to attempt to coordinate. By this point, participants stated that the orange team were, \"... just try-harding,\" (i.e., trying too hard to win), impacting the overall game experience for everyone."
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5621643066406,
        "y1": 229.91920471191406,
        "y2": 312.8269958496094
      },
      "text": "Participants also showed some interesting behaviours while they engaged in the VR. They would shout at each other and trash talk others through and over the headset communication, but then were seen to apologise when they ran into each other while drifting of in opposite directions. One participant commented on how that behaviour was similar to their online game behaviour, where they would trash talk other players but would then be polite when faceto-face. Others made remarks supporting such common behaviour."
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.04608154296875,
        "y1": 317.5902404785156,
        "y2": 367.6210021972656
      },
      "text": "Overall, despite the latency issues which impacted PX, all of the participants still spoke about experiencing high levels of immersion during their gameplay. Participants also highlighted how immersion was heavily impacted by team communication and also played a role in infuencing the kinds of strategies each team used."
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.0303039550781,
        "y1": 377.8642272949219,
        "y2": 515.5670166015625
      },
      "text": "4.2.2 Comparison to Traditional Esports. Participants spoke quite a bit about the comparisons between Sol Raiders and traditional esports during the focus group discussion. The overall sentiment was that the VR esports game had a feeling diferent from traditional esports games they were familiar with. One player gave an example by noting Sol Raiders was, \"... closer to modern laser tag than it was to esports.\" This comparison to laser tag was felt by a number of the participants, with them further comparing it to local traditional club sports. Another participant said that they did not take it as seriously as they would a CS:GO match. He explained his reasoning, \"[There] wasn’t anything at stake. No pride, really... That’s probably a big factor, just in our [CS:GO] scene.\" This was an interesting comment which has implications to lab studies."
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5593566894531,
        "y1": 520.3302001953125,
        "y2": 581.3200073242188
      },
      "text": "Based on the remarks by participants, it’s apparent that VR esports provided a diferent experience from what they were used to with traditional esports. Participants also noted certain elements (i.e., communicating with the opposing team) that were missing from their experience that would have perhaps made their experience more similar to that of traditional esports."
    }, {
      "page": 7,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.4286193847656,
        "y1": 591.5621948242188,
        "y2": 707.3469848632812
      },
      "text": "4.2.3 Arena Setup and Systems. Participants discussed potential ways to make VR esports experiences more immersive and engaging. They desired more tangible properties in the free-roaming area, such as walls to help them with the constraints in the game itself. When there is a lack of physical walls, one participant commented that they would, \"... try and wrap myself up on reaching my toes because they’d be sticking out and I’d go into the wall and I’d die.\" They discussed that, while it might be a difcult setup, it would be benefcial to create the actual structure of the map layout, or any sort of proxy, as it would help with their in-game experience. One participant ofered the idea of using big gym mats on the walls and"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.4320678710938,
        "y1": 87.45320129394531,
        "y2": 126.5260009765625
      },
      "text": "soft bags on the foor that could be dragged around and mapped onto the virtual environment of the game to guide players. They even thought that implementing some track runners would make the sprinting experience more realistic in the game."
    }, {
      "page": 7,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.3742065429688,
        "y1": 131.28822326660156,
        "y2": 279.95001220703125
      },
      "text": "Prior to the game, players were required to provide their heights which was matched with their avatars. They discussed diferent player heights represented in the game, and how it impacted their game experience. One participant laughed when talking about their experience, \"[It was] funny as well. I feel like I have a physical impairment because I’m so tall. I set my height in the game to 190 like you said. When I was at the top of the tower, when I crouched down, they could still see me because I was so tall.\" They continued on, comparing their experience to P6, whose player model was signifcantly shorter than the other players, \"... when she would crouch, she was like, really shorter!\" They made analogies to other sports, \"If you look at Formula One drivers and jockeys, they tend to be smaller people because the lighter you are, the better,\" and that, \"... the shorter you are, the harder you are to hit.\""
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2067260742188,
        "y1": 284.7132263183594,
        "y2": 345.7040100097656
      },
      "text": "The participants comments, overall, indicated that the arena setup and systems used had a major impact on the PX. Most of the participants agreed that a change in arena setups (e.g., the addition of gym mats) would enhance PX, while also noting that their personal attributes, such as their height, had a unique infuence on each of their games."
    }, {
      "page": 7,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7138061523438,
        "y1": 361.42523193359375,
        "y2": 455.2929992675781
      },
      "text": "4.2.4 Equipment and Technology. Participants were overall positive about the equipment they used in the game. They found the headsets fairly comfortable and the backpacks light and unintrusive, which enhanced their game experience. They wished for better functioning gun props and commented those would have improved their immersion in the game. They further discussed the importance of accurate tracking on the physical props, such as guns, for their positive game experiences, \"... having an actual gun is kind of fun!\" (P1) and emphasised that their accuracy needs to be improved."
    }, {
      "page": 7,
      "region": {
        "x1": 317.52239990234375,
        "x2": 559.7145385742188,
        "y1": 460.0562438964844,
        "y2": 641.593994140625
      },
      "text": "Participants also talked about the challenges they experienced with the game technology, including headgear and bandwidth. While the frst game session (i.e., practice game) had no technical problems, the second game session (i.e., the competitive match) had latency issues, which made the game unresponsive at some stages and made communication difcult among the team members. Commenting on the lag they experienced, one participant said, \"Yeah, I don’t know, the lag kind of ruined it for me. Like if... this is what VR esports is like, I’d be like, yeah, no.\" Another participant said instead of talking into the microphone, he was screaming at his teammates in order to communicate. Participants commented that lag decreased their sense of control in the virtual environment. One participant commented if the second game had similar responsiveness to the frst game they would have had a lot more fun. They discussed at length the potential reasons for the latency (e.g., WiFi reception, Bluetooth coverage). The VR arcade staf had reset the server and the guns for the players, but this did not solve the issues."
    }, {
      "page": 7,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.5814819335938,
        "y1": 646.3551025390625,
        "y2": 707.3469848632812
      },
      "text": "One participant followed up with his frst reaction, \"... I was kind of not nervous, but the whole environment, the ramps and things. That was really strange. But after a while, you get really used to it pretty quickly... even my head still now, it’s kind of spinning a little bit. I would take the headset of and then put it back on just to readjust and just get rid of any motion that I might have.\" While"
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2798767089844,
        "y1": 87.45320129394531,
        "y2": 104.60797119140625
      },
      "text": "participants did not bring up cybersickness, these comments may indicate that some may have experienced it."
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5612487792969,
        "y1": 109.37123107910156,
        "y2": 170.36102294921875
      },
      "text": "The participants emphasized that the latency issues had major efects on their experience with the technological aspects of the VR game. This is in addition to the efects that it had on immersion. However, their experiences with the equipment was generally positive and their remarks indicated that they found the technology and equipment relatively easy to use."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 547.4061889648438,
        "y1": 454.1700744628906,
        "y2": 461.02099609375
      },
      "text": "4.2 Player Experiences with a Representative"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.36800003051758,
        "x2": 294.2780456542969,
        "y1": 208.00123596191406,
        "y2": 258.031982421875
      },
      "text": "We found fve major themes of perceived barriers to the viability of VR esports: cost, lack of availability of diferent games, physical limitations, space constraints, and technical constraints. Some of these stemmed from the lack of public knowledge of VR. Others were more grounded in the reality of VR as it stands."
    }, {
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5602111816406,
        "y1": 262.7952575683594,
        "y2": 400.49798583984375
      },
      "text": "The most commonly reported barriers were access to the technology due to cost and the number of VR esports games available. The role of technology was brought up again by other participants who believed that VR Esports, while it one day could succeed, just wasn’t there yet (n=4). \"...I feel like at the moment esports is good because anybody can kind of just come in and pick it up... computer technologies are so readily available. I could go down to an internet cafe and start playing, whereas VR technologies is a bit more expensive,\" (P5). However, participants thought that VR equipment is much more expensive (i.e., several thousands of dollars) than it actually costs (i.e., several hundreds of dollars). P4 added that there are multiple esports games available for PC that are creating competition which does not seem to be the case for VR esports."
    }, {
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.58599853515625,
        "y1": 405.26123046875,
        "y2": 510.0870056152344
      },
      "text": "They also reasoned that diferent technical requirements for VR might impact gameplay both for casual and competitive VR esports players. P4 commented that there might be diferences in PXs \"...with PCs there’s a little bit of diferences that you can get with gear and refresh rates and stuf like that, but then VR, there’s a lot more external factors, I guess...\" Several participants (n=5) thought that VR esports \"is not there yet\"(P5). P4 pointed out in the VR esports video, \"...the technology just needs to be feshed out because I just saw a guy whose head was in one spot but his body was spinning around.\""
    }, {
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.558349609375,
        "y1": 514.8502197265625,
        "y2": 674.4710083007812
      },
      "text": "While the majority of participants saw the physical embodiment of VR esports as an advantage, some had a diferent perspective. They believed these aspects of VR esports presented a potential accessibility problem for players (n=4). P6 considered it as a potential limitation, \"... looking at the actual platforms they’re playing on, they’d have to be pretty conscious about the space they’re taking up and whether or not they move too far away.\" Some others were concerned about players running into each other in free-roaming spaces (n=3). They brought up that VR esports games may not be readily accessible to people with disabilities or injuries to participate. In a similar vein, P4 spoke about their concerns related to the physical aspects required for VR esports, \"Yeah, I think that physical aspect will sort of not allow a lot of people to get into it, because I’ve just seen these guys are squatting for a long time... I wouldn’t be able to do that with my knees.\""
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5647277832031,
        "y1": 679.2341918945312,
        "y2": 707.3469848632812
      },
      "text": "Related to the physical movements, the space constraints of people’s homes was raised as a potential barrier. P2 commented \"...I could see it being something that could have a big viewership... I"
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7124633789062,
        "y1": 87.45320129394531,
        "y2": 225.156005859375
      },
      "text": "guess the fact that at the moment it isn’t a big thing in a casual sense... the space needed for it, for someone at home.\" This raised concern for the fostering of the VR esports. P2 and P4 were worried that practicing would be a problem with VR esports games, both because of the cost and the space that players need, and that practicing against diferent teams is such an important aspect for esports players, \"People might have to go to a gaming cafe like Zero Latency to practice. And that would just restrict the access that everyone has. Like CS:GO is a game where you could run on a laptop from 2012 and it would still play relatively alright. Whereas I just don’t think you can do that with VR yet,\" (P4). P5 had a similar sentiment towards practice, and spoke about the issues surrounding the lack of arena spaces to practice in."
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7186279296875,
        "y1": 229.91920471191406,
        "y2": 290.90899658203125
      },
      "text": "Overall, the atmosphere of participants’ comments were skeptical, but not particularly negative. Still, it is worth noting that even their concerns which may not refect reality may refect public perceptions of VR. These make them no less important to address, as advances in a consumer product only matter if the consumer is aware of them."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 239.63453674316406,
        "y1": 193.64706420898438,
        "y2": 200.49798583984375
      },
      "text": "4.3 Perceived Barriers to VR Esports"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.7218627929688,
        "y1": 323.0692443847656,
        "y2": 471.7309875488281
      },
      "text": "We identifed several patterns regarding how esports players perceived VR esports and barriers to entry to the feld, as well as how they experienced a representative VR esports game. Firstly, while somewhat hesitant about the concept VR esports, participants held mostly positive attitudes and perceptions about various aspects of it, such as the physical embodiment and strategies they may facilitate. Secondly, immersion, enabled by the VR technology and arena space, was stated to be the most central feature of the PXs with the representative VR esports game. Lastly, despite the numerous positive aspects of VR esports, participants highlighted a number of perceived barriers, including accessibility to practice and people’s lack of knowledge about it. This section expands on these fndings and is structured around the research questions with associated design recommendations."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 404.202392578125,
        "y1": 308.716064453125,
        "y2": 315.5669860839844
      },
      "text": "5 DISCUSSIONS"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 342.358642578125,
        "x2": 396.18414306640625,
        "y1": 502.4871826171875,
        "y2": 509.3381042480469
      },
      "text": "VR esports"
    }, {
      "page": 8,
      "region": {
        "x1": 317.5249938964844,
        "x2": 558.20361328125,
        "y1": 516.8432006835938,
        "y2": 577.8330078125
      },
      "text": "We aimed to explore the attitudes and perceptions collegiate esports players held towards VR esports. We found that participants held various types of preconceived notions about VR esports, given the limited experience they had with VR. Additionally, their attitudes towards VR esports throughout the study changed as they gained more information about it."
    }, {
      "page": 8,
      "region": {
        "x1": 317.65899658203125,
        "x2": 559.7124633789062,
        "y1": 591.5621948242188,
        "y2": 707.3469848632812
      },
      "text": "5.1.1 Physical Embodiment of VR Esports. The physical aspects of VR esports were at the centre of interviews shaping participants’ attitudes towards VR esports. VR technologies, such as free-roaming arenas, treadmills, and the use of a range of gestures, allow for such physical movement. Participants also spoke about how the physical embodiment of VR esports infuenced the players’ skills and strategies. The physical embodiment features of VR esports are a combination of both traditional sports and esports, as the skills required for it synthesise both esports expertise (e.g. handeye coordination and reaction time) with the physical skills of traditional sports (e.g., stamina and form; [60])."
    }, {
      "page": 9,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.564697265625,
        "y1": 87.45320129394531,
        "y2": 258.031982421875
      },
      "text": "The participants held mostly positive attitudes towards the physical embodiment involved in VR esports. Particularly because it encourages people to keep active while playing games. This aspect addresses the highly criticised dimension of what diferentiates esports athletes from traditional sports athletes, which has implications to players’ health. These fndings also support a recent study [42], which suggest that VR gaming can be viewed as a new frontier for exergaming. As exergames include any kind of multimedia which requires users to engage in physical ways [68], VR esports could be considered as an activity which which meets these conditions. Prior studies identifed various motivational, cognitive and physical benefts of exergames to players (e.g. improving balance and executive functioning, increasing mindfulness) [8, 62]. Considering VR esports can be classifed as a new form of exergaming, competitive VR esport players could potentially experience these benefts."
    }, {
      "page": 9,
      "region": {
        "x1": 53.46293640136719,
        "x2": 295.5623779296875,
        "y1": 262.7952575683594,
        "y2": 356.6629943847656
      },
      "text": "Our participants demonstrated an overall positive attitude towards the VR technologies and free-roaming in arena spaces for VR esports. This was due to the unique features that cannot be achieved in traditional esports. Additionally, they spoke about how a free-roaming VR environment could beneft players’ overall experience as it allows higher levels of interactivity and helps them to become more immersed through free body movement. This supports previous research, which has shown that the physical aspects of VR and exergames help to enhance player immersion [12, 99]."
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5582275390625,
        "y1": 361.42523193359375,
        "y2": 510.0870056152344
      },
      "text": "Another salient fnding was that the physicality of VR esports directly afects how players think about game strategies. As participants outlined, VR allows players to read body language and physical signs within the game environment. This helps players to think about, and create, unique strategies that wouldn’t be considered in traditional esports. Research into traditional sports and esports have previously highlighted the important role that body language and movement play in gameplay. In a study by Hilvoorde et al. [37], body language and movement were found to be intrinsically related to the social outcomes of games. As VR esports involves a high degree of physicality, this would suggest that the players’ body movements may potentially have an important role in how teams devise their strategies, and even infuence the outcomes of their games."
    }, {
      "page": 9,
      "region": {
        "x1": 53.57400131225586,
        "x2": 295.5554504394531,
        "y1": 514.8502197265625,
        "y2": 608.7169799804688
      },
      "text": "Finally, the new strategies enabled by VR’s physicality allow players to reach a higher skill cap. This is because, as participants described, VR esports not only focuses on the mental strategies of the competition, but also the physical strategies. With the advancements that VR technology has made in recent years, we see the defnition of VR esports align closer with society’s traditional view of sports [25]. Future research would beneft from further investigations into the benefts of the physicality of VR and how it infuences esports gameplay and strategies."
    }, {
      "page": 9,
      "region": {
        "x1": 53.7979736328125,
        "x2": 294.2749938964844,
        "y1": 624.439208984375,
        "y2": 707.3469848632812
      },
      "text": "5.1.2 Spectatorship of VR Esports. Our fndings suggest that VR esports provide unique attractions to audience members spectating the games. Spectatorship is a crucial part of the esports industry [31] and popular esports games attract millions of viewers worldwide [23]. We found that traditional esports spectatorship may difer substantially in terms of meaning and how it is viewed, compared to VR esports spectatorship. Participants consistently spoke about the potentially theatrical aspect of spectating VR games, largely"
    }, {
      "page": 9,
      "region": {
        "x1": 317.65899658203125,
        "x2": 559.7144165039062,
        "y1": 87.45320129394531,
        "y2": 268.99102783203125
      },
      "text": "due to the duality of the performance taking place in physical and virtual dimensions. VR esports audiences would spectate the game state on a monitor and watch how player movements are mapped on their in-game avatars. They also noted that such duality can make it difcult for the observer to follow the game and split their attention between gameplay in the virtual environment and player movements. The mode of audience engagement with traditional esports is, in comparison, quite passive and does not commonly extend past chat-based interactions [18]. Studies have been exploring how to make audience experiences more active and engaging [48]. VR esports can extend these eforts and provide that next level of active engagement. One example is the innovation of providing audience members various tools to allow them to experience the game from multiple perspectives, transporting them into the actual virtual environment (e.g., 1st person, 3rd person) [60]. Such active participation of audiences at events could increase engagement and interest in VR esports."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 548.933349609375,
        "y1": 489.5380859375,
        "y2": 496.3890075683594
      },
      "text": "5.1 Players attitudes and perceptions towards"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.7124633789062,
        "y1": 306.6312255859375,
        "y2": 466.25201416015625
      },
      "text": "We found that immersion was crucial to the participants’ experiences when playing Sol Raiders, and was even evident in the second game which was unfortunately afected by latency issues. During these matches, participants’ immersion was observed in their movements and communication, whereby they were seen to shout commands at each other while moving around the arena, crouching, leaning, or walking swiftly. Perhaps the lag, while not desirable, created an additional level of challenge for participants. These observations are consistent with prior research, which found that playing a VR game resulted in more challenge and less control, yet higher immersion, compared with games played on PC [88]. Their experiences were observed to be quite visceral in nature, heightening the emotional intensity of their gaming experience. This supports prior research on VR PXs showing players’ increased emotional state in VR [38, 72, 73, 77, 88]."
    }, {
      "page": 9,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.191162109375,
        "y1": 471.01422119140625,
        "y2": 553.9229736328125
      },
      "text": "The physical aspects of the VR esports game were a major factor in the PX of immersion. This further supports previous research, which suggested that both the spatial and physical aspects of VR help increase player immersion [12, 99]. Increased immersion and embodiment aforded by VR technology may infuence players’ teamwork and strategies. For instance, players actively use their real bodies to manipulate their hitboxes and location, making them a more difcult target to hit (see Figure 2)."
    }, {
      "page": 9,
      "region": {
        "x1": 317.6287841796875,
        "x2": 559.5811157226562,
        "y1": 558.6862182617188,
        "y2": 707.3469848632812
      },
      "text": "Another major aspect that infuenced PXs was interaction fdelity. The fndings showed that high interaction fdelity was desired by the participants. This could be important to further improve VR esports players’ enjoyment and experience of immersion. Previous studies in VR and exergames showed evidence that haptics and high interaction fdelity to manipulate virtual objects can improve PXs and increase players’ spatial presence [55, 56, 76, 79]. They also made suggestions regarding the use of props (e.g. props for weapons) as a way to further increase interaction fdelity ([82] p. 3561). In the context of exergames, a previous study had found that player movement precision in the game increased players’ immersion [65]. These relate to Slater’s place illusion (PI), “the strong illusion of being in a place in spite of the sure knowledge that you are not there” ([82] p. 3553) and plausibility illusion (PSI)"
    }, {
      "page": 10,
      "region": {
        "x1": 52.78499984741211,
        "x2": 294.3728942871094,
        "y1": 87.45320129394531,
        "y2": 126.5260009765625
      },
      "text": "“the illusion that what is happening is real even though you know that it is not real” ([82] p. 3561). Future studies may investigate empirically how increased movement precision and realistic props relate to PI and PSI, and how these impact PXs."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 554.5515747070312,
        "y1": 292.2770690917969,
        "y2": 299.12799072265625
      },
      "text": "5.2 PXs with a representative VR esports game"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.55975341796875,
        "y1": 284.79522705078125,
        "y2": 312.90899658203125
      },
      "text": "The fndings presented several types of barriers participants identifed that may limit entry to VR esports. We discuss some of these below as they also provide opportunities to improve upon them."
    }, {
      "page": 10,
      "region": {
        "x1": 53.367431640625,
        "x2": 295.555908203125,
        "y1": 323.1102294921875,
        "y2": 460.81298828125
      },
      "text": "5.3.1 Technology Based Barriers. Our participant believed access to VR technology was a major barrier to many from entering and engaging in VR esports. This is consistent with previous research which has identifed the cost of VR as being a barrier for people adopting it [53]. Even if VR was something people could aford, many still don’t have adequate space at home to set up a VR environment. Practice is an essential component of any form of esports. Without home access, would-be esports athletes would be limited to practicing at location-based facilities like Zero Latency. Entry costs to these facilities can be quite expensive, which means that this may not a feasible model for practice. Participants sympathised with this barrier, relating it to traditional sports where people would pay a seasonal membership fee to have access to sporting facilities."
    }, {
      "page": 10,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.56341552734375,
        "y1": 465.57623291015625,
        "y2": 581.3609619140625
      },
      "text": "A general sentiment from participants was that VR technology just was not \"there yet\". Even at a professional facility like Zero Latency, lag and latency were still issues that had negative efects on the participants’ second game. Issues with lag, or any other performance issues, can easily impact players experience and enjoyment. This would be a major barrier for those involved in VR esports. This has been observed as a major barrier in other research as well, as people do not believe the technology is ready yet [53]. When dealing with competitive esports, it is crucial that the technology performs well enough for mishaps to occur as infrequently as possible."
    }, {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5647277832031,
        "y1": 586.1242065429688,
        "y2": 647.114990234375
      },
      "text": "We do acknowledge that VR technology is continuously improving and could eventually reach a point where these barriers are overcome. Future work should look into how VR technology could be improved in a way to allow people easier access to it, as well as help people feel more confdent in its performance to encourage more engagement with it."
    }, {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5569152832031,
        "y1": 657.316162109375,
        "y2": 707.3469848632812
      },
      "text": "5.3.2 Knowledge Barriers. A barrier of knowledge was salient among participants. As the the fndings showed, none of the participants had prior experience with, or had even heard about, VR esports. Participants were shocked to discover that major esports companies were involved in pursuing VR esports. In order for VR"
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2032470703125,
        "y1": 87.45320129394531,
        "y2": 126.5260009765625
      },
      "text": "esports to thrive, the knowledge barrier should be broken. This can be done not only by providing critical knowledge on the esport and the players, but working with companies to explore the best ways to spread awareness of VR esports to the wider public."
    }, {
      "page": 10,
      "region": {
        "x1": 317.952392578125,
        "x2": 558.4364624023438,
        "y1": 141.6251983642578,
        "y2": 235.49200439453125
      },
      "text": "5.3.3 Accessibility Barriers. Lastly, while physicality was largely raised as a positive aspect, it did come with some pitfalls. Because physical movement is a requirement for some esports games, this may be a barrier to persons who are movement impaired. Just as some impairments require special interfaces for PCs, movement impairment may require novel technology for VR esports. This was also discussed by Dombrowski et al. [21], where authors suggest applying seven principles of universal design when creating VR experiences."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 279.35455322265625,
        "y1": 270.4421081542969,
        "y2": 277.29302978515625
      },
      "text": "5.3 Perceived barriers to entry to VR esports"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 416.67144775390625,
        "y1": 254.66806030273438,
        "y2": 261.51898193359375
      },
      "text": "6 FUTURE WORK"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.5841674804688,
        "y1": 284.7132263183594,
        "y2": 345.7040100097656
      },
      "text": "We found that player hitboxes had a signifcant impact on PXs. Players’ hitboxes in the VR experience were not standardised, and they were mapped to their real world heights. With this in mind, games may beneft from standardising the hitboxes, so that no unfair advantage can be given to specifc players due to their real world height, which may also improve player enjoyment."
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1873168945312,
        "y1": 350.46722412109375,
        "y2": 444.3340148925781
      },
      "text": "Participants desired higher levels of interaction fdelity. Using haptics and props could feel more realistic within the game worlds, potentially increasing levels of embodiment and immersion. By providing a physical representation/prop of the in-game peripheral, players would stand to gain heightened levels of immersion and potential raised skill caps. We also found that participants desired a greater replication of the virtual world in the arena, suggesting that it might be benefcial to have the walls in the arena approximating the obstacles in the virtual world to improve PXs."
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.3715209960938,
        "y1": 449.09722900390625,
        "y2": 532.0050048828125
      },
      "text": "Participants stated their desire to be able to communicate with the opposing team during the game. While previous studies with esports found that this may cause negative behaviors [91, 92], being in the same physical place may help alleviate toxicity. Careful design considerations are needed to implement cross-team communication during VR esports games. Still, VR esports are inherently social, and a main reason for users to visit VR arcades is to play multiplayer games [42]."
    }, {
      "page": 10,
      "region": {
        "x1": 317.66070556640625,
        "x2": 559.5842895507812,
        "y1": 536.7681884765625,
        "y2": 663.511962890625
      },
      "text": "Participants also gave feedback about the barriers that VR has for accessibility for people with disabilities. Developers and designers could further expand their community by breaking the barriers of accessibility through diferent mediums of interaction. As VR esport games currently are more physically interactive in design, this can create a barrier for players with movement disabilities. By using other sensors (e.g.,to track eye movement, such as the tobii VR headset [89] or brainwaves using the neurable VR headset [64]) VR esport leagues may be more accessible to players with varying physical abilities. Another potential design route is remote VR esports where players can compete from their home rather than being at the same location."
    }, {
      "page": 10,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.2045288085938,
        "y1": 668.2752075195312,
        "y2": 707.3469848632812
      },
      "text": "Finally, we suggest to VR esports developers to further break the barriers of knowledge. Though VR esport leagues are well defned within their own communities, broader audiences have yet to even hear about them. As the participants of this study all said, even as"
    }, {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0460510253906,
        "y1": 87.45320129394531,
        "y2": 115.5670166015625
      },
      "text": "professional esport athletes, they were unaware that VR esports had their own leagues or were even a development. Future researchers could beneft from challenging this barrier in knowledge too."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 441.9587097167969,
        "y1": 270.3553161621094,
        "y2": 277.20623779296875
      },
      "text": "6.1 Design Implications"
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 53.499237060546875,
        "x2": 295.5602722167969,
        "y1": 145.0822296142578,
        "y2": 249.90802001953125
      },
      "text": "This study lays the groundwork for new research directions. As participants noted, the physicality and immersion were aspects of VR esports that stood out. Future research would beneft from investigating whether the physical aspects of traditional sports could be further integrated into VR to create novel gameplay experiences in VR esports. Later studies could explore this novelty to understand how the integration physical skills and FPS strategies synthesise in VR esports games to shape player experiences. Further, it would be benefcial to explore how this might infuence VR esports player performance, enjoyment and overall wellbeing in future work."
    }, {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2197265625,
        "y1": 254.6712188720703,
        "y2": 315.6619873046875
      },
      "text": "Unique social interactions within VR esports warrants further research. There is limited research exploring the concept of physical activity and social presence within a VR esports context. With this in mind and in light of the global COVID-19 pandemic, it leads to the question of whether the utility of remote VR esports can provide social connectedness for players."
    }, {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.4114990234375,
        "y1": 320.4242248535156,
        "y2": 348.5379943847656
      },
      "text": "There are also opportunities to investigate how the potential cognitive efects of esports and VR esports gaming translate to other immersive applications, such as in medical teamwork training [87]."
    }, {
      "page": 11,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5646667480469,
        "y1": 353.3012390136719,
        "y2": 567.7160034179688
      },
      "text": "Finally, VR esports provide unique audience experiences. To better understand the audience-commentator-player interactions in VR esports, more research is needed. It is worthwhile to investigate whether the various audience interaction options would promote or reduce engagement and enjoyment by creating split attention. Some participants noted that the high level of interaction VR esports brings might be of particular interest to a younger audience, however the demographic diferences in VR esports interest would have to be explored further in future studies. Given that the motivations of VR esports spectators may difer from those of traditional esports and sports (e.g., [19], further research is needed to investigate the motivational diferences and their impact of audience engagement. Lastly, because the enjoyment of watching esports competitions hinges on the audiences’ familiarity with the games and teams being viewed [90], it is crucial that VR esports is more widely known about. Future studies may further examine how to create engaging audience experiences that exploit the new technology to support VR esports spectating. For example, one potential direction is using free form virtual cameras situating viewers directly in the action, action replay approaches, and audience participation and personalisation."
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 177.5726318359375,
        "y1": 130.72805786132812,
        "y2": 137.5789794921875
      },
      "text": "6.2 Research Directions"
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.56561279296875,
        "y1": 591.5621948242188,
        "y2": 707.3469848632812
      },
      "text": "This study has several limitations. Though the participants were a good representation of traditional esports players, as seen in previous research [44], they may not be representative of VR esports players as they were purposefully recruited from a university esports club and played CS:GO competitively. Thus our results could be particular to a select group of esports players. Also, while it is not uncommon for exploratory studies in VR [61, 80, 88], our participant pool was both small (N=8) and mostly male players. A larger, more diverse participant pool is necessary to further validate and generalize our fndings. While common with VR PX studies, participants lacked familiarity with VR esports which might have"
    }, {
      "page": 11,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.718505859375,
        "y1": 87.45320129394531,
        "y2": 137.4840087890625
      },
      "text": "impacted their attitudes towards VR esports and experiences with the game. Future research should recruit a wider range of participants, including both esports players and casual gamers. Coming from a competitive esports scene might have made participants more biased towards VR esports."
    }, {
      "page": 11,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.5833740234375,
        "y1": 142.24720764160156,
        "y2": 268.99102783203125
      },
      "text": "There are limitations regarding the VR game used in this study. While it was advertised as a VR esports game, the play experience might have been closer to a location-based competitive VR game, rather than a VR esports game because the participants did not play in a professional VR esports setting. However, we not that the teams drew upon their competitive games experience using calls during gameplay. In addition, this study included only a single FPS game. Much as a single esports game cannot be generalised to the entirety of esports, this single VR esports game should not be generalised to the entirety of this subgenre. Other VR esports game genres need to be investigated to expand, generalise and confrm the results."
    }, {
      "page": 11,
      "region": {
        "x1": 317.7489929199219,
        "x2": 559.7183227539062,
        "y1": 273.7542419433594,
        "y2": 389.53900146484375
      },
      "text": "Gaming sessions (15 minutes x 2) were relatively short to overcome the efects of novelty. While it is above average compared to prior studies on VR PX where participants played a VR game for 7-8 minutes [57], 10 minutes [17, 38, 61] or 4-5 minutes [27, 56], it is still desirable for players to experience longer game sessions to get familiar with the game mechanics, controls and the environment, as long as they do not experience cybersickness. The second Zero Latency session had some latency issues, which interrupted gameplay and infuenced participants’ reported experiences. Future studies may aim to schedule multiple sessions with participants and with the VR arcade in case of technical problems."
    }, {
      "page": 11,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7124633789062,
        "y1": 394.3022155761719,
        "y2": 444.3340148925781
      },
      "text": "Lastly, a major limitation of our study is the lack of prior studies on VR esports. While we build on the extant work on the afordances of VR, PXs with digital games, this work may lack theoretical aspects particular to VR esports. Future work is needed to build on this study to understand afordances of and PXs with VR esports."
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 141.4416961669922,
        "y1": 577.2091064453125,
        "y2": 584.0599975585938
      },
      "text": "7 LIMITATIONS"
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7219848632812,
        "y1": 481.9732360839844,
        "y2": 707.3469848632812
      },
      "text": "This study is the frst empirical study to our knowledge on VR esports that explored the perceptions and attitudes of players towards VR esports and their experiences of a representative VR esports game they played at a VR arcade. We found that our participants see the future of VR esports promising; physical and embodied aspects of VR esports is seen as potential to fll the gap between traditional esports and sports; spectating can provide unique experiences; and player teams may develop manifold of strategies taking advantage of the afordances of VR esports (e.g., free-roaming). Results from this study will give guidance to VR esports game designers and developers to design engaging experiences for VR esports athletes, and will lay the path to future research on VR esports. However, we emphasize that due to our sample, our fndings may primarily refect male CS:GO players’ attitudes and experiences with a single competitive VR game. Thus, we would like to caution readers from making generalizations from our fndings to all participants or all competitive VR games. This study has theoretical contributions as it extends prior work that identifed the types of player experiences with diferent types of VR games. Furthermore, we found evidence that diferent types of interactions in VR esports games - e.g., teambased social, environment such as maps, objects - can infuence PX"
    }, {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.21600341796875,
        "y1": 87.45320129394531,
        "y2": 104.60797119140625
      },
      "text": "diferently. Further systematic studies are needed to uncover their relative efects on VR esports experiences."
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 317.9549865722656,
        "x2": 405.7296142578125,
        "y1": 467.6200866699219,
        "y2": 474.47100830078125
      },
      "text": "8 CONCLUSION"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 53.36800003051758,
        "x2": 294.0466613769531,
        "y1": 139.2592315673828,
        "y2": 167.37200927734375
      },
      "text": "We would like to thank QUT Esports Arena for helping us with the participant recruitment and the HCI writing group led by Dr Bernd Plodrer for their feedback on our paper draft."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 171.35446166992188,
        "y1": 124.90506744384766,
        "y2": 131.7559814453125
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 60.284000396728516,
        "x2": 294.86724853515625,
        "y1": 200.4110870361328,
        "y2": 205.22998046875
      },
      "text": "[1] [n.d.]. Discord — A New Way to Chat with Friends & Communities. https:"
    }, {
      "page": 12,
      "region": {
        "x1": 60.286956787109375,
        "x2": 294.2232360839844,
        "y1": 208.38209533691406,
        "y2": 221.17205810546875
      },
      "text": "//discordapp.com/ Library Catalog: discordapp.com. [2] [n.d.]. Oculus | VR Headsets & Equipment. https://www.oculus.com/ Library"
    }, {
      "page": 12,
      "region": {
        "x1": 60.28679656982422,
        "x2": 294.5008544921875,
        "y1": 224.3220977783203,
        "y2": 237.112060546875
      },
      "text": "Catalog: www.oculus.com. [3] [n.d.]. PlayStation®VR. https://www.playstation.com/en-au/explore/"
    }, {
      "page": 12,
      "region": {
        "x1": 60.28678894042969,
        "x2": 295.1161804199219,
        "y1": 240.26210021972656,
        "y2": 253.05206298828125
      },
      "text": "playstation-vr/ Library Catalog: www.playstation.com. [4] [n.d.]. Virtual Reality | trueVR Center | Santa Monica. https://www."
    }, {
      "page": 12,
      "region": {
        "x1": 60.28679656982422,
        "x2": 294.4996337890625,
        "y1": 256.20208740234375,
        "y2": 268.9920654296875
      },
      "text": "truevrcenters.com Library Catalog: www.truevrcenters.com. [5] [n.d.]. Virtuix Omni™ | Omni by Virtuix. https://www.virtuix.com/product/"
    }, {
      "page": 12,
      "region": {
        "x1": 60.28714370727539,
        "x2": 295.1161804199219,
        "y1": 272.14208984375,
        "y2": 284.9320373535156
      },
      "text": "virtuix-omni/ Library Catalog: www.virtuix.com. [6] [n.d.]. VIVE Pro Full Kit | The professional-grade VR headset. https://www."
    }, {
      "page": 12,
      "region": {
        "x1": 60.287147521972656,
        "x2": 294.8672180175781,
        "y1": 288.0830993652344,
        "y2": 300.873046875
      },
      "text": "vive.com/au/product/vive-pro-full-kit/ Library Catalog: www.vive.com. [7] [n.d.]. Zero Latency VR | Free-Roam Virtual Reality Entertainment. https:"
    }, {
      "page": 12,
      "region": {
        "x1": 60.286956787109375,
        "x2": 294.81182861328125,
        "y1": 304.0231018066406,
        "y2": 316.81304931640625
      },
      "text": "//zerolatencyvr.com/ Library Catalog: zerolatencyvr.com. [8] Cay Anderson-Hanley, Paul J. Arciero, Adam M. Brickman, Joseph P. Nimon,"
    }, {
      "page": 12,
      "region": {
        "x1": 57.0369987487793,
        "x2": 295.1179504394531,
        "y1": 319.9631042480469,
        "y2": 412.455078125
      },
      "text": "Naoko Okuma, Sarah C. Westen, Molly E. Merz, Brandt D. Pence, Jefrey A. Woods, Arthur F. Kramer, and Earl A. Zimmerman. 2012. Exergaming and Older Adult Cognition: A Cluster Randomized Clinical Trial. American Journal of Preventive Medicine 42, 2 (Feb. 2012), 109–119. https://doi.org/10.1016/j.amepre. 2011.10.016 [9] Ready at Dawn. 2020. Echo Arena. https://www.oculus.com/echo-vr/?locale= en_US [10] Jakki O Bailey, Jeremy N Bailenson, and Daniel Casasanto. 2016. When does virtual embodiment change our minds? Presence: Teleoperators and Virtual Environments 25, 3 (2016), 222–233. [11] Blacklight. 2020. Eclipse. Game [VR]. Blacklight, Paris, France. [12] Corey J Bohil, Bradly Alicea, and Frank A Biocca. 2011. Virtual reality in"
    }, {
      "page": 12,
      "region": {
        "x1": 57.043975830078125,
        "x2": 295.2257995605469,
        "y1": 415.6040954589844,
        "y2": 707.3469848632812
      },
      "text": "neuroscience research and therapy. Nature reviews neuroscience 12, 12 (2011), 752–762. [13] John Bolton, Mike Lambert, Denis Lirette, and Ben Unsworth. 2014. PaperDude: a virtual reality cycling exergame. In CHI’14 Extended Abstracts on Human Factors in Computing Systems. 475–478. [14] Alice Bonasio. 2019. Esports Continues Its Push Towards VR. https://vrscout. com/news/esports-continues-push-towards-vr/ Library Catalog: vrscout.com Section: News. [15] Doug A Bowman and Ryan P McMahan. 2007. Virtual reality: how much immersion is enough? Computer 40, 7 (2007), 36–43. [16] Virginia Braun, Victoria Clarke, Nikki Hayfeld, and Gareth Terry. 2019. Thematic Analysis. In Handbook of Research Methods in Health Social Sciences, Pranee Liamputtong (Ed.). Springer Singapore, Singapore, 843–860. https: //doi.org/10.1007/978-981-10-5251-4_103 [17] Michael Carroll, Ethan Osborne, and Caglar Yildirim. 2019. Efects of VR Gaming and Game Genre on Player Experience. In 2019 IEEE Games, Entertainment, Media Conference (GEM). 1–6. https://doi.org/10.1109/GEM.2019.8811554 [18] Sven Charleer, Kathrin Gerling, Francisco Gutiérrez, Hans Cauwenbergh, Bram Luycx, and Katrien Verbert. 2018. Real-time dashboards to support esports spectating. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. 59–71. [19] Giford Cheung and Jef Huang. 2011. Starcraft from the stands: understanding the game spectator. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 763–772. [20] Valve Corporation. 2012. Counter-Strike: Global Ofensive. http://blog.counterstrike.net [21] Matt Dombrowski, Peter A. Smith, Albert Manero, and John Sparkman. 2019. Designing Inclusive Virtual Reality Experiences. In Virtual, Augmented and Mixed Reality. Multimodal Interaction (Lecture Notes in Computer Science), Jessie Y.C. Chen and Gino Fragomeni (Eds.). Springer International Publishing, Cham, 33–43. https://doi.org/10.1007/978-3-030-21607-8_3 [22] Mahzar Eisapour, Shi Cao, Laura Domenicucci, and Jennifer Boger. 2018. Participatory design of a virtual reality exercise for people with mild cognitive impairment. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–9. [23] escharts.com. [n.d.]. Esports teams and events stats: Dota 2, LoL, CS:GO. https: //escharts.com/ Library Catalog: escharts.com."
    }, {
      "page": 12,
      "region": {
        "x1": 321.1940002441406,
        "x2": 559.3843383789062,
        "y1": 88.82667541503906,
        "y2": 524.0350341796875
      },
      "text": "[24] Chris Ferguson, Egon L van den Broek, and Herre van Oostendorp. 2020. On the role of interaction mode and story structure in virtual reality serious games. Computers & Education 143 (2020), 103671. [25] Mark Filchenko. [n.d.]. A Comparison Between Esports and Traditional Sports. ([n. d.]), 10. [26] Samantha Finkelstein, Andrea Nickel, Zachary Lipps, Tifany Barnes, Zachary Wartell, and Evan A Suma. 2011. Astrojumper: Motivating exercise with an immersive virtual reality exergame. Presence: Teleoperators and Virtual Environments 20, 1 (2011), 78–92. [27] Julian Frommel, Sven Sonntag, and Michael Weber. 2017. Efects of controllerbased locomotion on player experience in a virtual reality exploration game. In Proceedings of the 12th International Conference on the Foundations of Digital Games (FDG ’17). Association for Computing Machinery, Hyannis, Massachusetts, 1–6. https://doi.org/10.1145/3102071.3102082 [28] Stephanie Miranda Nadine Glegg and Danielle Elaine Levac. 2018. Barriers, facilitators and interventions to support virtual reality implementation in rehabilitation: a scoping review. PM&R 10, 11 (2018), 1237–1251. [29] Scott W Greenwald, Zhangyuan Wang, Markus Funk, and Pattie Maes. 2017. Investigating social presence and communication with embodied avatars in room-scale virtual reality. In International Conference on Immersive Learning. Springer, 75–90. [30] Mark D Grifths. 2017. The psychosocial impact of professional gambling, professional video gaming & eSports. Casino & Gaming International 28 (2017), 59–63. [31] Juho Hamari and Max Sjöblom. 2017. What is eSports and why do people watch it? Internet research (2017). [32] Tilo Hartmann and Jesse Fox. 2020. Entertainment in Virtual Reality and Beyond: The Infuence of Embodiment, Co-Location, and Cognitive Distancing on Users’ Entertainment Experience. In The Oxford Handbook of Entertainment Theory. Oxford, UK: Oxford University Press. [33] Sonya Haskins. 2018. VR eSports Leagues To Know About In 2019! https:// vrespawn.com/2018/12/30/vr-esports-leagues/ Library Catalog: vrespawn.com. [34] Sonya Haskins. 2019. VR Esports Leagues to Know About in 2020 - vrleague.gg. https://vrleague.gg/2019/12/10/vr-esports-leagues-to-know-about-in-2020/ [35] Sonya Haskins. 2019. What’s Ahead for VR Esports in 2020. https://www. vrftnessinsider.com/whats-ahead-for-vr-esports-in-2020/ Library Catalog: www.vrftnessinsider.com Section: VR Esports. [36] Sonya Haskins. 2020. 14-Year-Old Reaps Benefts of VR Esports. https:// www.vrftnessinsider.com/14-year-old-reaps-benefts-of-vr-esports/ Library Catalog: www.vrftnessinsider.com Section: Featured. [37] Ivo van Hilvoorde and Niek Pot. 2016. Embodiment and fundamental motor skills in eSports. Sport, Ethics and Philosophy 10, 1 (Jan. 2016), 14–27. https://doi.org/10.1080/17511321.2016.1159246 Publisher: Routledge _eprint: https://doi.org/10.1080/17511321.2016.1159246. [38] Wen Huang. 2019. Exploring players’ user experience in a high-embodied virtual reality game. In 2019 IEEE Games, Entertainment, Media Conference (GEM). IEEE, 1–8. [39] Kiran Ijaz, Naseem Ahmadpour, Yifan Wang, and Rafael A. Calvo. 2020. Player Experience of Needs Satisfaction (PENS) in an Immersive Virtual Reality Exercise Platform Describes Motivation and Enjoyment. International Journal of Human–Computer Interaction 0, 0 (Feb. 2020), 1–10. https: //doi.org/10.1080/10447318.2020.1726107 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/10447318.2020.1726107. [40] Downpour Interactive. 2020. Onward. http://www.downpourinteractive.com/ [41] Daniel Johnson, Lennart E Nacke, and Peta Wyeth. 2015. All about that base:"
    }, {
      "page": 12,
      "region": {
        "x1": 321.20098876953125,
        "x2": 559.275146484375,
        "y1": 527.1860961914062,
        "y2": 611.7081298828125
      },
      "text": "difering player experiences in video game genres and the unique case of moba games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2265–2274. [42] Tuomas Kari. 2019. Virtual Reality Arcades: A Study on Usage Habits with Emphasis on Digital Gaming. In International Conference on Videogame Sciences and Arts. Springer, 179–194. [43] Tuomas Kari and Markus Makkonen. 2014. Explaining the usage intentions of exergames. In Thirty Fifth International Conference on Information Systems, Auckland 2014. Association for Information Systems (AIS). [44] Sky Kauweloa. 2016. Collegiate E-sports as Work or Play. (2016), 16. [45] Kwanguk Kim, M Zachary Rosenthal, David J Zielinski, and Rachael Brady. 2014."
    }, {
      "page": 12,
      "region": {
        "x1": 321.20098876953125,
        "x2": 559.3800048828125,
        "y1": 614.8571166992188,
        "y2": 707.3469848632812
      },
      "text": "Efects of virtual environment platforms on emotional responses. Computer methods and programs in biomedicine 113, 3 (2014), 882–893. [46] Sahoon H Kim and Michael K Thomas. 2015. A stage theory model of professional video game players in South Korea: The socio-cultural dimensions of the development of expertise. Asian Journal of Information Technology 14, 5 (2015), 176–186. [47] Sung Yeun Su Kim, Nathan Prestopnik, and Frank A Biocca. 2014. Body in the interactive game: How interface embodiment afects physical activity and health behavior change. Computers in Human Behavior 36 (2014), 376–384. [48] Simone Kriglstein, Günter Wallner, Sven Charleer, Kathrin Gerling, Pejman Mirza-Babaei, Steven Schirra, and Manfred Tscheligi. 2020. Be Part Of It: Spectator Experience in Gaming and Esports. In Extended Abstracts of the 2020 CHI"
    }, {
      "page": 13,
      "region": {
        "x1": 57.04082489013672,
        "x2": 294.0421142578125,
        "y1": 88.83326721191406,
        "y2": 101.62322998046875
      },
      "text": "Conference on Human Factors in Computing Systems. 1–7. [49] Przemysław Krompiec and Kyoungju Park. 2019. Enhanced Player Interaction"
    }, {
      "page": 13,
      "region": {
        "x1": 57.037010192871094,
        "x2": 295.22314453125,
        "y1": 104.77009582519531,
        "y2": 707.3469848632812
      },
      "text": "Using Motion Controllers for First-Person Shooting Games in Virtual Reality. IEEE Access 7 (2019), 124548–124557. https://doi.org/10.1109/ACCESS.2019. 2937937 Conference Name: IEEE Access. [50] Bhone Myint Kyaw, Nakul Saxena, Pawel Posadzki, Jitka Vseteckova, Charoula Konstantia Nikolaou, Pradeep Paul George, Ushashree Divakar, Italo Masiello, Andrzej A Kononowicz, Nabil Zary, et al. 2019. Virtual reality for health professions education: Systematic review and meta-analysis by the Digital Health Education collaboration. Journal of medical Internet research 21, 1 (2019), e12959. [51] Eike Langbehn, Paul Lubos, and Frank Steinicke. 2018. Evaluation of locomotion techniques for room-scale vr: Joystick, teleportation, and redirected walking. In Proceedings of the Virtual Reality International Conference-Laval Virtual. 1–9. [52] Michael Lankes, Jüergen Hagler, Georgi Kostov, and Jeremiah Diephuis. 2017. Invisible walls: Co-presence in a co-located augmented virtuality installation. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. 553–560. [53] Christofer Laurell, Christian Sandström, Adam Berthold, and Daniel Larsson. 2019. Exploring barriers to adoption of Virtual Reality through Social Media Analytics and Machine Learning–An assessment of technology, network, price and trialability. Journal of Business Research 100 (2019), 469–474. [54] Donghun Lee and Linda J Schoenstedt. 2011. Comparison of eSports and traditional sports consumption motives. ICHPER-SD Journal Of Research 6, 2 (2011), 39–44. [55] Seungmin Lee, Wonkyung Kim, Taiwoo Park, and Wei Peng. 2017. The psychological efects of playing exergames: A systematic review. Cyberpsychology, Behavior, and Social Networking 20, 9 (2017), 513–532. [56] Jih-Hsuan Tammy Lin. 2017. Fear in virtual reality (VR): Fear elements, coping reactions, immediate and next-day fright responses toward a survival horror zombie virtual reality game. Computers in Human Behavior 72 (2017), 350–361. [57] Stefan Liszio, Katharina Emmerich, and Maic Masuch. 2017. The infuence of social entities in virtual reality games on player experience and immersion. In Proceedings of the 12th International Conference on the Foundations of Digital Games (FDG ’17). Association for Computing Machinery, Hyannis, Massachusetts, 1–10. https://doi.org/10.1145/3102071.3102086 [58] Anna Lisa Martin-Niedecken and Alexandra Schättin. 2020. Let the Body’n’Brain Games Begin: Toward Innovative Training Approaches in eSports Athletes. Frontiers in Psychology 11 (2020). [59] Elisa D Mekler, Julia Ayumi Bopp, Alexandre N Tuch, and Klaus Opwis. 2014. A systematic review of quantitative studies on the enjoyment of digital entertainment games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 927–936. [60] Kornel Meszaros. 2019. How VR Could be the Next Big Platform for Esports. https://aixr.org/insights/how-vr-could-be-the-next-big-platform-foresports/ Library Catalog: aixr.org Section: Insights EDU. [61] Ben Meuleman and David Rudrauf. 2018. Induction and profling of strong multi-componential emotions in virtual reality. IEEE Transactions on Afective Computing (2018). [62] Karina Iglesia Molina, Natalia Aquaroni Ricci, Suzana Albuquerque de Moraes, and Monica Rodrigues Perracini. 2014. Virtual reality using games for improving physical functioning in older adults: a systematic review. Journal of NeuroEngineering and Rehabilitation 11, 1 (Nov. 2014), 156. https://doi.org/10.1186/17430003-11-156 [63] Gabriel Moss. 2019. Here Are the 4 Biggest VR Esports Titles to Watch in 2019. https://www.vrftnessinsider.com/here-are-the-4-biggest-vr-esportstitles-to-watch-in-2019/ Library Catalog: www.vrftnessinsider.com Section: VR Esports. [64] Neurable. 2019. Neurable. https://www.neurable.com/technology Library Catalog: www.neurable.com. [65] Jasmir Nijhar, Nadia Bianchi-Berthouze, and Gemma Boguslawski. 2011. Does movement recognition precision afect the player experience in exertion games?. In International Conference on Intelligent Technologies for interactive entertainment. Springer, 73–82. [66] Kristine L Nowak and Frank Biocca. 2003. The efect of the agency and anthropomorphism on users’ sense of telepresence, copresence, and social presence in virtual environments. Presence: Teleoperators & Virtual Environments 12, 5 (2003), 481–494. [67] Catherine S Oh, Jeremy N Bailenson, and Gregory F Welch. 2018. A systematic review of social presence: Defnition, antecedents, and implications. Frontiers in Robotics and AI 5 (2018), 114. [68] Yoonsin Oh and Stephen Yang. 2010. Defning Exergames & Exergaming. In Proceedings of Meaningful Play. [69] Gume Osorio, David C Mofat, and Jonathan Sykes. 2012. Exergaming, exercise, and gaming: Sharing motivations. Games for health: research, development, and clinical applications 1, 3 (2012), 205–210. [70] Federica Pallavicini and Alessandro Pepe. 2019. Comparing Player Experience in Video Games Played in Virtual Reality or on Desktop Displays: Immersion,"
    }, {
      "page": 13,
      "region": {
        "x1": 321.1940002441406,
        "x2": 559.3771362304688,
        "y1": 88.83009338378906,
        "y2": 524.037109375
      },
      "text": "Flow, and Positive Emotions. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts. 195–210. [71] Federica Pallavicini, Alessandro Pepe, and Maria Eleonora Minissi. 2019. Gaming in Virtual Reality: What Changes in Terms of Usability, Emotional Response and Sense of Presence Compared to Non-Immersive Video Games? Simulation & Gaming 50, 2 (2019), 136–159. [72] X. Peng, J. Huang, A. Denisova, H. Chen, F. Tian, and H. Wang. 2019. A Palette of Deepened Emotions: Exploring Emotional Challenge in Virtual Reality Games. ACM, Honolulu, HI, USA. https://doi.org/10.1145/3313831.3376221 Meeting Name: CHI’20 Conference on Human Factors in Computing Systems. [73] Xiaolan Peng, Jin Huang, Linghan Li, Chen Gao, Hui Chen, Feng Tian, and Hongan Wang. 2019. Beyond Horror and Fear: Exploring Player Experience Invoked by Emotional Challenge in VR Games. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19). Association for Computing Machinery, Glasgow, Scotland Uk, 1–6. https: //doi.org/10.1145/3290607.3312832 [74] Anthony D Pizzo, Sangwon Na, Bradley J Baker, Mi Ae Lee, Doohan Kim, and Daniel C Funk. 2018. eSport vs. Sport: A Comparison of Spectator Motives. Sport Marketing Quarterly 27, 2 (2018). [75] Johanna Roettl and Ralf Terlutter. 2018. The same video game in 2D, 3D or virtual reality–How does technology impact game evaluation and brand placements? PloS one 13, 7 (2018). [76] Katja Rogers, Jana Funke, Julian Frommel, Sven Stamm, and Michael Weber. 2019. Exploring Interaction Fidelity in Virtual Reality: Object Manipulation and Whole-Body Movements. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14. [77] Katja Rogers, Giovanni Ribeiro, Rina R Wehbe, Michael Weber, and Lennart E Nacke. 2018. Vanishing importance: studying immersive efects of game audio perception on player experiences in virtual reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13. [78] Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344–360. [79] Jonmichael Seibert and Daniel M Shafer. 2018. Control mapping in virtual reality: efects on spatial presence and controller naturalness. Virtual Reality 22, 1 (2018), 79–88. [80] Volker Settgast, Johanna Pirker, Stefan Lontschar, Stefan Maggale, and Christian Gütl. 2016. Evaluating experiences in diferent virtual reality setups. In International conference on entertainment computing. Springer, 115–125. [81] William J Shelstad, Dustin C Smith, and Barbara S Chaparro. 2017. Gaming on the rift: How virtual reality afects game user satisfaction. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 61. SAGE Publications Sage CA: Los Angeles, CA, 2072–2076. [82] Mel Slater. 2009. Place illusion and plausibility can lead to realistic behaviour in immersive virtual environments. Philosophical Transactions of the Royal Society B: Biological Sciences 364, 1535 (2009), 3549–3557. [83] Mel Slater. 2017. Implicit learning through embodiment in immersive virtual reality. In Virtual, augmented, and mixed realities in education. Springer, 19–33. [84] Bernhard Spanlang, Jean-Marie Normand, David Borland, Konstantina Kilteni, Elias Giannopoulos, Ausiàs Pomés, Mar González-Franco, Daniel Perez-Marcos, Jorge Arroyo-Palacios, Xavi Navarro Muncunill, et al. 2014. How to build an embodiment lab: achieving body representation illusions in virtual reality. Frontiers in Robotics and AI 1 (2014), 9. [85] Caveman Studio. 2018. Contractors. https://www.contractorsvr.com/ [86] Ayoung Suh and Jane Prophet. 2018. The state of immersive technology research:"
    }, {
      "page": 13,
      "region": {
        "x1": 321.1941223144531,
        "x2": 558.2042236328125,
        "y1": 527.1860961914062,
        "y2": 539.97607421875
      },
      "text": "A literature analysis. Computers in Human Behavior 86 (2018), 77–90. [87] Penny Sweetser and Daniel Johnson. [n.d.]. Evaluating the GameFlow Model"
    }, {
      "page": 13,
      "region": {
        "x1": 321.197998046875,
        "x2": 559.2785034179688,
        "y1": 543.1260986328125,
        "y2": 707.3469848632812
      },
      "text": "with Diferent Stakeholders. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (New York, NY, USA, 2019-10-17) (CHI PLAY ’19 Extended Abstracts). Association for Computing Machinery, 697–703. https://doi.org/10.1145/3341215.3356286 [88] Chek Tien Tan, Tuck Wah Leong, Songjia Shen, Christopher Dubravs, and Chen Si. 2015. Exploring Gameplay Experiences on the Oculus Rift. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY ’15). Association for Computing Machinery, London, United Kingdom, 253–263. https://doi.org/10.1145/2793107.2793117 [89] Tobii. 2019. Better Devices and Better Experiences in VR. https://vr.tobii.com/ Library Catalog: vr.tobii.com. [90] Logan D Trent and Daniel M Shafer. 2020. Extending Disposition Theory of Sports Spectatorship to ESports. International Journal of Communication 14 (2020), 21. [91] Selen Türkay and Sonam Adinolf. 2019. Friending to Flame: How Social Features Afect Player Behaviours in an Online Collectible Card Game. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12. [92] Selen Türkay, Jessica Formosa, Sonam Adinolf, Robert Cuthbert, and Roger Altizer. 2020. See No Evil, Hear No Evil, Speak No Evil: How Collegiate Esports Players Defne, Experience and Cope with Toxicity. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 13. https://doi.org/10."
    }, {
      "page": 14,
      "region": {
        "x1": 57.040977478027344,
        "x2": 294.72491455078125,
        "y1": 88.83326721191406,
        "y2": 101.62322998046875
      },
      "text": "1145/3313831.3376191 [93] Ubisoft. 2017. Space Junkies. https://www.ubisoft.com/en-us/game/space-"
    }, {
      "page": 14,
      "region": {
        "x1": 57.043975830078125,
        "x2": 294.8651123046875,
        "y1": 104.77009582519531,
        "y2": 125.5311279296875
      },
      "text": "junkies/ [94] Ubisoft. 2020. Assassins Creed. Game [VR]. Ubisoft, Montreuil, France. [95] Thomas Weiss and Sabrina Schiele. 2013. Virtual worlds in competitive contexts:"
    }, {
      "page": 14,
      "region": {
        "x1": 57.04405212402344,
        "x2": 295.11700439453125,
        "y1": 128.6801300048828,
        "y2": 141.4700927734375
      },
      "text": "Analyzing eSports consumer needs. Electronic Markets 23, 4 (2013), 307–316. [96] Josef Wiemeyer, Lennart Nacke, Christiane Moser, et al. 2016. Player experience."
    }, {
      "page": 14,
      "region": {
        "x1": 57.043975830078125,
        "x2": 294.0420837402344,
        "y1": 144.62110900878906,
        "y2": 157.41107177734375
      },
      "text": "In Serious Games. Springer, 243–271. [97] Carolin Wienrich, Kristina Schindler, Nina Döllinqer, Simon Kock, and Ole"
    }, {
      "page": 14,
      "region": {
        "x1": 57.04100036621094,
        "x2": 295.1190490722656,
        "y1": 160.5611114501953,
        "y2": 229.1409912109375
      },
      "text": "Traupe. 2018. Social presence and cooperation in large-scale multi-user virtual reality-the relevance of social interdependence for location-based environments. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 207–214. [98] Graham Wilson and Mark McGill. 2018. Violent video games in virtual reality: Re-evaluating the impact and rating of interactive experiences. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. 535–548. [99] Nane Winkler, Konstantin Röthke, Nils Siegfried, and Alexander Benlian. 2020. Lose Yourself in VR: Exploring the Efects of Virtual Reality on Individuals’"
    }, {
      "page": 14,
      "region": {
        "x1": 317.9512023925781,
        "x2": 559.3804321289062,
        "y1": 88.83009338378906,
        "y2": 213.20098876953125
      },
      "text": "Immersion. In Proceedings of the 53rd Hawaii International Conference on System Sciences. [100] Andrea Stevenson Won, Jeremy N Bailenson, and Jaron Lanier. 2015. Appearance and task success in novel avatars. Presence: Teleoperators and Virtual Environments 24, 4 (2015), 335–346. [101] Caglar Yildirim, Michael Carroll, Daniel Hufnal, Theodore Johnson, and Sylvia Pericles. 2018. Video Game User Experience: To VR, or Not to VR?. In 2018 IEEE Games, Entertainment, Media Conference (GEM). 1–9. https://doi.org/10.1109/ GEM.2018.8516542 [102] Soojeong Yoo, Tristan Heywood, Lie Ming Tang, Bob Kummerfeld, and Judy Kay. 2017. Towards a Long Term Model of Virtual Reality Exergame Exertion. In Proceedings of the 25th Conference on User Modeling, Adaptation and Personalization. 247–255. [103] Soojeong Yoo and Judy Kay. 2016. VRun: running-in-place virtual reality exergame. In Proceedings of the 28th Australian Conference on Computer-Human Interaction. 562–566."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 123.21257781982422,
        "y1": 187.67007446289062,
        "y2": 194.52099609375
      },
      "text": "REFERENCES"
    }
  }]
}