{"authors": "Nur Al-Huda Hamdan; Adrian Wagner; Simon Voelker; Jürgen Steimle; Jan Borchers", "pub_date": "", "title": "Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces", "abstract": "Figure 1: Springlets on-skin stickers enable expressive mechanotactile output on the user's skin. They use shape memory alloy springs to achieve a thin, flexible, and silent form factor that can be worn on challenging body locations and near the head.", "sections": [{"heading": "INTRODUCTION", "text": "Tactile perception on our skin is inherently multimodal. We sense mechanical cues such as vibration, stretch, pressure, and motion [5]. In recent years, non-vibrating mechanotactile output like dragging, twisting, squeezing, and brushing [10,16,38,45] has become increasingly relevant as a more natural and more expressive alternative to vibration on the skin [43]. So far, however, moving beyond vibrotactile output has required bulky, rigid, and noisy electromechanical actuators, such as motors, servos, and pumps [34]. The resulting tactile displays tend to be cumbersome to wear on curved and soft body locations, challenging to scale and distribute across the body without limiting natural movement, and cannot be placed near the head or neck due to their noise [1]. In addition, each type of mechanotactile output typically requires its own custom mechanical actuators and construction, making these systems hard to make and combine to create more expressive tactile experiences.\nIn this paper, we introduce Springlets, novel mechanotactile interfaces for generating expressive, non-vibrating, silent output on the skin (Fig. 1). Our approach embeds shape memory alloy (SMA) springs in ergonomic stickers that can follow the natural shape and movement of the body. SMA springs are thin (µm coil radius) and very soft alloys that contract like muscles when current is applied, generating smooth, powerful, and silent movements. They have a higher force-to-weight density than any electromechanical actuator [19]. By virtue of their flexibility and compact form factor, SMAs can be adapted to numerous mechanical tactile designs. Springlets build on these benefits to create a library of primitive actuators that can generate a wide range of tactile sensations. By actuating the skin where the Springlet is attached, or via moving an object on the skin surface between two attachment points, Springlets can produce pinch, directional stretch, press, pull, drag, and expand gestures. Springlets are simple, low-cost, compact, and easy to fabricate, and their modular nature makes it easy to combine or extend them to create more complex sensations across the body. Beyond that, by manipulating the applied current, at low-to-moderate frequencies, and using multiple SMA springs, Springlets support more expressive variable force profiles and spatiotemporal patterns. Thus, Springlets offer a simple and unified design platform for creating expressive skin-worn tactile interfaces using a single type of actuator.\nWe detail the design, fabrication, and implementation of six modular Springlets that support pinching, directional stretching, pressing, pulling, dragging, and expanding on the skin surface. We then report on a user study that evaluated the perceptibiliy, discriminability, and wearability of a set of Springlets on six body locations (wrist, upper arm, shoulder, neck, chest, and back) while the user was sitting and walking. The results demonstrate that Springlets are effective at generating expressive stimuli and very comfortable to wear on various body locations even while the user is mobile. Finally, we present a number of applications that are enabled by the unique expressiveness, softness, and discreetness of Springlets: An intimate messenger on the ear, a physical motion guide interface on the forearm, a breathing coordinator on the chest, a navigator on the back, and a virtual reality backpack on the shoulders. In summary, this paper makes the following contributions:\n• The concept of Springlets, a novel class of SMA-based tactile interfaces for expressive, non-vibrotactile output in soft and discreet form factors that can be worn like stickers. We describe the fundamental actuation mechanism and the design factors that enable two types of modular Springlets, skin actuators and end-effector actuators, and a wide range of expressive touch sensations.\n• Details on the fabrication, implementation, and performance of six modular Springlets. We present a multi-layer approach to creating safe, ergonomic and customizable Springlet stickers for encapsulating SMAs on the skin.\n• A study providing insights into the perception of Springletbased tactile feedback across different parts of the body, and in different situational contexts.\n• Five application scenarios that illustrate use cases that the expressive, flexible, silent nature of Springlets enables.", "n_publication_ref": 9, "n_figure_ref": 1}, {"heading": "BACKGROUND AND RELATED WORK", "text": "Tactile stimulation allows for discreet, eyes-free communication with a user via the skin, particularly in mobile scenarios when visual and auditory feedback are impractical or impossible [36]. It also enables rending touch output for mediated social communication [17], physical motion guidance [44], navigation [45], virtual reality applications [40], and sensory supplementation [3]. The majority of wearable tactile devices rely on vibration motors to generate output, mainly due to their high perceptibility, compactness, and low cost [39]. But vibrations cannot convey a large range of tactile gestures that mimic real-world experiences [8]. Therefore, research has been investigating non-vibrating stimuli for a more natural and expressive interaction on the skin [43].\nSkin stimulation methods can be divided into three categories: thermal, electrical, and mechanical. Thermal stimulation is often used to add quality characteristics in the information delivery [51]. However, alone, it is inadequate to present rich information due to its low spatial resolution and its lower state transition time. Electrotactile stimulation uses electrical current flow from electrodes on the skin to deliver stimuli to the sensing nerves, mimicking pressure and vibration. Recently, Withana et al. [52] showcased Tacttoo, a very thin (35 µm thick) skin tattoo that can generate electrotactile patterns on the skin. Although electrotactile systems are structurally simple i.e., they do not consist of mechanical components, and they are very energy-efficient, challenges remain in limited expressiveness. Mechanical stimulation is the most commonly used method to create a tactile sensation. The mechanoreceptors of the skin easily perceive vibration, skin stretch and deformation, and relative tangential movement on the skin surface at finer spatial resolution, compared to thermal and electrotactile stimulation [5]. This enables a more expressive range of mechanotactile gestures.\nPrior work has presented promising prototypes based on various actuation technologies for creating rich mechanotactile stimuli. Electric motors and actuators, such as DC motors, servos, piezoelectric and magnetic actuators, are the most prevalent actuation technology for wearable tactile feedback. They have been used to create tapping, squeezing, stretching, dragging, dynamic pressure, twisting, and brushing sensations [1,4,18,20,24,43,45,48]. While these systems can achieve high speeds and forces, and enable fine positional control, challenges remain in bulkiness, rigidity, and acoustic friction noise. Recently, Pece et al. [37] presented a fabrication technique that embeds small rigid magnetic actuators in a soft band to achieve a flexible wearable pin array display.\nPneumatic and hydraulic actuators can be soft, compact, and light on the skin. Fluid-based tactile devices can generate squeeze and pressure gestures using fluid balloons and tubes [13,14,38], contact-free stroke and tap stimuli using airflow [28], and skin pulling effect using air suction [32]. The main challenge in this category of systems is that they require external pipes and pumps to generate pressure in a fluid.\nInherently soft actuators in the form of dielectric elastomer actuators (DEAs) are very flexible, compact, and silent. Koo et al. [26] used DEAs to create a grid of small tactile stimulation elements for the fingertip. DEAs are soft, making it easy to simulate contact with soft objects [9]. However, they require a high supply voltage (1-5 kV), which is impractical, especially for wearable applications.\nShape memory alloys are made of a metal alloy, like nickeltitanium, typically shaped into small diameter wires and springs. They contract like a muscle when electricity is applied and reach certain temperatures, and expand when electricity is removed. SMAs are attractive for their very high force-to-weight ratio, compactness, softness and pliability, silent mechanical and electrical operation, and their simple mechanics and control circuitry [19]. They are ideal for small and flexible applications that require noiseless physical movement with low-to-moderate actuation frequency.\nThe majority of wearable tactile devices use SMAs to create a squeeze stimulus by varying contraction speeds and stroke lengths [6,11,46]. Beyond squeeze output, the Tickler [25] generates a tickling sensation by actuating SMA wires to move several bars laterally on the user's skin. Scheibe et al. [41] developed a thimble device that uses SMA wires to compress the fingertip and provide feedback for VR applications. Solazzi et al. [42] presented a wearable tactile device that uses a SMA wire to stretch the skin of the fingerpad in two directions. In the previous examples, however, SMAs were usually embedded in a rigid mechanical casing.\nOverall, of the above types of actuators, SMAs provided the best combination of features for our goals with on-skin Springlets, in particular because they are pliable and do not make any noise during operation. Silent actuation enables private communication with the wearer and enables placing tactile devices near the user's head and neck region. We describe the SMA-based design and implementation of our Springlets in the next section.", "n_publication_ref": 35, "n_figure_ref": 0}, {"heading": "SPRINGLETS", "text": "We propose Springlets as the first on-skin, non-vibrating mechanotactile interfaces. We implement Springlets as thin, lightweight and ergonomic stickers. Embedded with SMA springs, this unique form factor enables us to create interfaces that deliver expressive tactile output over various body locations, while operating silently. In this section, we describe the actuation mechanism and design factors that enable Springlets to generate a wide range of tactile sensations. We then present a new technique for fabricating customizable and scalable Springlet interfaces. Finally, we detail the implementation and performance of six modular Springlets, and describe how they can be extended using computergenerated tactile patterns and SMA spring arrangements.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Actuation Mechanism and Design Factors", "text": "Our approach is based on using a soft SMA spring to stretch the skin where an interface is attached, or move an object on the skin surface between two attachment points. The basic idea of using an SMA spring as a mechanotactile actuator is illustrated in Fig. 2.a: When current flows through the SMA spring, it heats it up, contracts and reduces its effective length, stretching the skin at the attachment points towards its center, simulating a pinch gesture. However, depending on how the spring is attached to the skin, a wide range of touch sensations can be produced, which we explore further below. The contraction stops when the spring reaches its shortest length, or when the bias force, here the skin elastic resistance, becomes higher than the spring's contraction force. Once power is removed, the bias force stretches the SMA spring back to its original position. A systematic investigation of this actuation mechanism led us to the main design factors that influence a Springlet's tactile output.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Physical Attachment", "text": "Technique. An SMA spring actuates by contracting its length. Thus, how it is physically laid out and attached to the skin determine the general shape of the tactile output. We identify two attachment techniques that are realized by skin actuators and end-effector actuators.\nSkin actuators attach the ends of the SMA spring to the skin and apply the contraction force directly at the attachment points. As a result, the skin underlying an actuated attachment point gets stretched, pulled upwards, pressed downwards, squeezed or twisted, based on the spring's applied force vector. In these actuators, skin elastic resistance serves as the main bias force. We illustrate two skin actuators: In Fig. 2.a, an SMA spring stretches the skin at the attachment points symmetrically, creating a pinch. In Fig. 2.b, an SMA spring stretches the skin at the attachment points asymmetrically, due to unbalanced bias forces, creating a directional stretch. These basic actuators can be spatially arranged and linked to create complex shapes on the skin. End-effector actuators attach at least one end of the SMA spring to an end-effector and apply the contraction force directly to it. An end-effector may be a rigid or a soft object that is attached to the SMA. When the SMA contracts, it causes the end-effector to change its position or shape on the skin surface. In these actuators, a soft end-effector or a bias spring reverts the SMA to its original position after contraction. We illustrate four example end-effector actuators: In Fig. 2.c-d, an SMA connected to a soft bendable object bends the object, causing it to press or pull the underlying skin. In Fig. 2.e, two SMA springs connected to a rigid object pull the object alternately, causing it to drag over the skin surface in two directions. In Fig. 2.f, an SMA spring connected to a soft zigzag object pulls the object, causing it to unfold and expand on the skin during actuation. End-effectors expand the design space of Springlets. They introduce haptic objects of various shapes, dimensions, textures, and flexibility as well as dynamic shape-changing features that can unravel on the skin throughout the actuation.\nBias Force. It is the force that acts against the force and movement of an SMA spring during actuation. In our actuation mechanism, bias force is the main factor that influences the distribution of force on the skin. When an SMA spring contracts, a contact point with a higher bias force (\"resistance to being moved\") will move less than a contact point with a lower bias force. In Fig. 2.a, the bias force at both skin attachment points is equal and initially less than the SMA's produced force, thus they are stretched symmetrically towards the center of contraction. In contrast, in Fig. 2.b, the bias force at the left point is larger than at the right. This can be because the left attachment point covers a larger skin surface, or because the skin surrounding the left point has a higher elastic resistance, for example. As a result, the skin at the right point is then stretched towards the left point simulating a directional stretch. In skin actuators, we leverage these variables to direct the force and movement of an SMA spring to one attachment point or another.\nEnd-effector actuators are attached to the skin between two points of balanced bias forces. To direct the force of an SMA spring to the end-effector, we connect at least one end of the SMA to the surface of the end-effector. As a bias force we can suspend an expansion spring between the endeffector and the closest skin attachment point (Fig. 2.c-d, expansion springs colored in grey), or use the end-effector itself, if it has elastic properties (Fig. 2.f). In both cases, it is necessary for the end-effector bias forces to be less than the elastic resistance of the skin attachment points but larger than skin friction forces.\nActuators with a single SMA spring can only apply a unilateral force e.g., a pull but not a push, when they contract. The bias force is responsible for stretching the SMA spring back to its original position once actuation is done to enable repeated contractions. Thus, it can influence the frequency of actuation. To enable bidirectional force and have digital control over the bias force, we could use an antagonistic (opposite) SMA spring in place of an expansion bias spring (Fig. 2.e). When one SMA spring contracts, it pulls the end-effector towards its attachment point on the skin and stretches the opposite SMA spring. This technique enables faster actuation and higher force and motion ranges [2].\nAngles and Curvatures. The angle between an SMA spring and a contact point influences the force vector that is applied at that point. For example, in Fig. 2.e, the angle between the SMAs and the end-effector is slightly less than 90 • in order to apply a large tangential force for dragging the endeffector, and a small normal force to keep the end-effector in contact with the skin while it is dragged. When an actuator is attached to a curved body surface, the number of effective contact points between the SMA and the skin increases as the SMA moves closer to the skin. As a result, the contraction force distributes over more contact points creating a new tactile sensation. For example, applying a pinch Springlet (Fig. 2.a) on a curved surface results in a squeeze effect, while applying a drag Springlet (Fig. 2.e) creates a press effect. These observations were collected during user experiments.\nSMA Specifications. The physical dimensions of an SMA spring affect the intensity, size, and frequency thresholds of the tactile output. The wire gauge and coil diameter of the SMA spring determine the maximum contraction force that it can produce. The length of the SMA determines the largest displacement i.e., contraction, that it can achieve. The wire gauge inversely affects the bandwidth of actuation. For skin actuators, the choice of SMA diameter is dependent on the elastic resistance of the skin at the desired body location. Softer skin e.g., at the neck, requires less actuation force, thus, SMAs with smaller diameters, compared to more resistant skin e.g., on the back. In end-effector actuators, the bias force can be tweaked e.g., by using a stronger or a weaker expansion spring, to fit the requirements of any SMA spring.\nKey for an effective tactile actuator is to select an SMA spring that matches the bias forces. As a rule of thumb, if an SMA spring contracts to its maximum capacity when driven with its standard current and activation duration, then the bias forces applied to it are not too high, and would not damage it. If a spring starts to expand immediately after electricity is removed, then the bias forces are not too low, and would not decrease its bandwidth or effective displacement. Since SMA springs contract by several percent of their length, the required SMA length is directly related to the desired size of the interaction area on the skin. Table 1 1: SMA springs that were examined in this paper. BioMetalHelix [47] and Flexinol [7] springs can contract down to 50% of their stretched length when they reach 60 • C and 90 • C, resp., driven with their standard current for two seconds. The springs come in millimeter -meter lengths.", "n_publication_ref": 2, "n_figure_ref": 13}, {"heading": "Fabrication", "text": "We describe a technically simple and rapid technique for fabricating Springlet interfaces as skin-worn stickers using DIY tools and affordable materials. We propose a multi-layer soft sticker structure, inspired by prior HCI work in the area of on-skin interactive devices [22,29,50]. The main technical challenge that we had to face was to find a structure and materials that are (a) thin and flexible to allow the embedded SMA to actuate efficiently, (b) adaptable to Springlets' design factors and spatial arrangements, (c) skin-compatible and heat resistant, to protect the skin from the SMA as it heats up during contraction (up to 90 • C), and (d) comfortable and ergonomic to wear on various body locations. A Springlet sticker is composed of three functional layers (Fig. 3): Layer 1: The enclosing layer covers the embedded SMA from one side to protect it and the user from accidental contact. The layer leaves a 2 mm spacing between it and the SMA, which is embedded in layer 2: the tactile layer, to allow for free and frictionless movement. This air gap also serves to insulate the heat of a contracting SMA. The layer may also include a ventilation mechanism e.g., holes in its surface, to accelerate SMA cooling. This layer is cut in the shape of the tactile layer from a thin (0.5 mm thick) self-adhesive tape 1 made of silicone-rubber. This material is skin-compatible, heat resistant (up to 260 • C), and highly stretchable (up to 300%) and durable. In addition, two pieces of this material can fuse to each other after a few minutes of contact, creating a secure and seamless bond (up to 700 PSI tensile strength). We leverage this material feature to bind this layer with the tactile layer, and to secure the SMA in the tactile layer, without additional binding agents.\nLayer 2: The tactile layer is a frame that embeds the SMA spring and end-effectors and provides a custom design for the skin attachment points. The layer's design and contact points with the SMA determine the shape of movement and distribution of force on the skin. The opening at the center of this layer frames the tactile interaction area on   the skin. It provides movement space for the SMA to contract and expand. For end-effector actuators, the opening is necessary to sense the movement of the end-effector on the skin. This layer can be customized and scaled to embed several SMAs and end-effectors and create tactile displays for various applications and body locations. It also provides the contact points between the embedded SMAs and the driving controller. This layer, like layer 1, is made of a thin sheet of the silicone-rubber tape. Incisions in this layer are made to thread the SMA spring and secure it at the contact points. Layer 3: The attachment layer encloses the SMA from the other side of the sticker, and it is used to attach a Springlet to the skin or other surfaces. For this layer we used kinesiology tape 2 , a breathable medical fabric tape that is thin (0.1 mm thick), stretchable (up to 100%), and can withstand the heat of a contracted SMA. This tape can stay on the skin for up to five days, and can be reapplied using a skin-grade adhesive spray or gel. This layer binds to the tactile layer using acrylic glue. For additional safety, we line this layer with a piece of thin (0.01 mm thick) thermal insulating tape 3 . The thermal barrier has a smooth finish to reduce friction with the SMA. The barrier is applied to the areas under the SMA spring in its contracted state.\nConstruction. To construct a Springlet we (1) cut the tactile layer in the desired shape and size, and cut the enclosing and attachment layers to match the tactile layer's outline (see section Implementation), (2) stretch an SMA spring to its maximum length and cut it to the desired length (as a rough guideline, the relation between the SMA's length and the interaction size on the skin is 2:1), (3) stretch the last 2-2.5 mm sections from the spring's ends further, this helps prevent the ends form contracting when the current flows, and crimp each section together with a thin and lightweight electrical wire using a small terminal, (4) thread the ends of the SMA through small incisions in the tactile layer's frame, and (5) assemble the layers. If an end-effector is desired, we connect it to the SMA, and optionally to a bias spring, then we thread the free ends of this connection in the tactile layer. Fabricating a Springlet takes less than 15 minutes, and about $6 of materials, including a $4 SMA spring. See video figure for a complete walkthrough.", "n_publication_ref": 4, "n_figure_ref": 1}, {"heading": "Implementation", "text": "Figure 4 shows six implemented modular Springlets in their actuated state on the wrist. It also provides a technical drawing for the tactile layer of each Springlet to enable replicating them. In a preliminary study, we found that the minimal contraction force that can be perceived by users on the arm and near the neck region is 30g of force. Accordingly, our Pincher, Directional Stretcher, Dragger, and Expander Springlets embed a 40g force-producing SMA spring. In the Presser and Puller we used a 140g SMA spring since their end-effectors applied a relatively high bias force. Our design decisions were derived iteratively while testing with volunteers. They are not meant as constraints, rather validated instances and guidelines. In section Applications, we scale, combine, and modify these Springlets to better satisfy the requirements of different applications and body locations.\nIn our Pincher (Fig. 4.a), a rectangular tactile layer creates two attachment points of balanced bias forces. The SMA pulls on both points symmetrically creating a skin pinch, given that the points are placed on skin areas of equal elastic resistance. In the Directional Stretcher (Fig. 4.b), the left attachment point has a relatively larger surface area on the skin compared the right, thus, the SMA stretches mainly the skin under the right point. In the rest of the Springlets, which are end-effector actuators, the tactile layer creates balanced attachment points on the skin.\nThe Presser and Puller (Fig. 4.c-d) have a similar tactile design; they use a bendable end-effector. In the Presser, the SMA is conntected on top of the end-effector while in the Puller it is on the bottom. The ends of the end-effector are connected to the layer via strips of silicone-rubber, which the bias force necessary to flex it back quickly. The Dragger and Expander (Fig. 4.e-f) also share a single layer design but have different end-effectors. In the Dragger, a rigid end-effector is attached between two antagonistic SMAs to enable controlled bilateral dragging. In the Expander, a soft zigzag with an embedded expansion spring is attached from one end to the SMA, and from the other to the tactile layer. When the SMA contracts, it unfolds the zigzag, gradually changing its effective size on the skin. The expansion spring pulls the zigzag back once the current is For reference, Table 2 describes the performance of these Springlets on the wrist. The results are adjustable using other tactile layer designs, SMAs, or bias forces. In addition, our modular linear actuators can be extended by chaining Springlets to enable curved paths and full-body tactile gestures.\nSpringlet Control Parameters and Mechanisms. So far, we have described how a Springlet performs when driven with its standard current for a fixed duration. we describe how to digitally manipulate the actuation displacement, and force of a Springlet to create expressive tactile patterns.\nspeed controlled by the amount of current flowing in an SMA. An increasing current accelerates conwhile a deceasing current can be used to slow down contraction or expansion, depending on the initial state of SMA. We can improve the overall actuation frequency of a Springlet by using two antagonistic SMAs in place of a single SMA and a bias spring. Alternatively, we can accelerate SMA cooling and expanding by replacing a large SMA with multiple smaller ones, arranged in parallel and electrically connected in series, to keep current requirements practical.\ndisplacement is controlled by the duration of current flowing in an SMA. We can limit how far an SMA contracts by stopping the current flow at any point before full contraction. Alternatively, we can connect multiple SMAs in series and selectively contract some to the desired length.\nforce reaches its maximum capacity when an SMA is fully contracted. Thus, limiting the duration of curflow is also a mechanism to limit the generated force. To increase the actuation force of a Springlet, we embed it with multiple parallel SMAs. By selectively driving these SMAs, create variable force patterns.\nIn section Applications, we create spatiotemporal tactile patterns by combining several Springlets in a single interface.\nController. Springlets' control circuit requires a controller with pulse-width-modulator (PWM) to control the current flow. We used a RedBear BLE Nano 2 controller, providing Bluetooth connectivity. But since the RedBear pins provide the required current output, we connected its PWM pins to a motor controller (ULN2803A), consisting of an array of Darlington transistors, to supply a current of from a 9 V battery. Each SMA was connected between a pin on the motor controller and ground. We connected the wireless controller to a Springlet via a long thin cable to keep the controller off the skin e.g., in a pocket.\nWe have implemented a control application using that runs on a MacBook Pro and connects to the Springlet controller using a Bluetooth connection. A data stream included {SMA_ID, CYCLE_TIME, DURATION}. SMA_ID refers to the SMA that will be actuated in case of multiple connected SMAs; CYCLE_TIME represents the duty cycle time for simthe effective voltage e.g., using an 8-bit PWM a CY-CLE_TIME of 255 allows the SMA to draw maximum current, in our case 500mA; DURATION is the delay in milliseconds before voltage is shutdown. The software was extended to participants' input during the user study.", "n_publication_ref": 0, "n_figure_ref": 5}, {"heading": "EVALUATION", "text": "To validated the functionality of Springlets as wearable tactile actuators, we investigated four questions: Can Springlets noticeable tactile sensations on the skin? Can users the stimuli generated by different Springlets? Can Springlets be worn on challenging body locations? How does user mobility affect the perception of Springlets? To answer these questions, we conducted a within-subjects experiment with factors actuator {pincher, presser, dragger}; location {wrist, upper Arm, shoulder, neck, chest, back}; mobility {sitting, walking}.\nThe selected Springlets represent the three main types of stimuli that skin mechanoreceptors can detect, beside vibration: stretch, pressure, and motion [5]. The rest of Springlets create different sensations on the skin but essentially target same receptors. The body locations were derived from [23] to represent skin with various levels of elastic resistance, surface curvature, and tactile sensitivity. In addition, these locations are less explored in the literature, yet very promising [16]. We explore additional locations in section Applications.\nPreliminary Study. performed a preliminary study with eight participants (3 female; ages 23-33 years) to identify the minimal contraction force to perceive and distinguish pinching, pressing, and dragging with an SMA spring on the skin. We examined SMA springs, and combinations of springs, with contraction forces 20g, 30g, 40g, 60g, 90g, on the participants' wrist. We found that 30g is the minimal force that can efficiently actuate the skin or move an object on the surface. We verified these results on the remaining body locations with two of our colleagues. Based on this finding we selected the 40g SMA spring for the Pincher and Dragger, and the 140g SMA for the Presser, as described in section\nThe actuators were tested extensively by the authors to determine their safety before the study.\nParticipants. Ten new volunteers participated (3 female; ages 21-35 years). One of them had previous experience with non-vibrotactile feedback on the body.\nThe experiment was conducted in a large quite room. The participant wore view-blocking glasses. The experimenter mounted an actuator on a location on the participant's body (Fig. 5). actuator location were counterbalanced to avoid order effects. The participant was not made aware of which actuator she wore, what tactile stimulus it generated, or that each actuator generated only one unique stimulus. The participant always experienced a newly mounted actuator in the condition first followed by walking condition. In each condition, the experimenter triggered the actuator remotely via our control application.\nThe participant held a Bluetooth-connected button and was asked to press it once she recognized the stimulus. If the participant missed the stimulus completely, it was repeated one more time after a random delay of 10-20 seconds.\nparticipant was not aware of this procedure. (Only four 6: Noticeability rating of Springlets on 5-point-scale (mean, 95% CI), in both mobility conditions. of this procedure appeared in our final data set.) After pressing the button, the participant was asked to describe the felt stimulus in her own words, classify the stimulus as a pinch, a press, or a drag, rate the stimulus' noticeability and the actuator's comfort. Once her answers were logged, she was asked to switch the condition, and another stimulus was triggered after a random delay of seconds. This procedure was repeated three times. the experiment included 3 actuator × 6 location × 2 mobility × 3 repetitions × 10 participants = 1,080\nIn each trial we measured stimulus noticeability (Very noticeable (5) -Not noticeable (1)); stimulus pinch, a press, or a drag); actuator comfort (Very comfortable (5) -Not comfortable (1)); and reaction time (ms), measured from the time an actuator was triggered until the participant pressed the handheld button. The experiment took about 120 minutes per participant.\nOccasionally adhering an actuator to the skin was unsuccessful. Therefore some participants reported the lack of tactile stimulus in some trials. We removed 3.3% of the trials where participants (a) rated a stimulus' with 1 i.e., not noticeable, and/or (b) could not classify the stimulus. This left a total of 1,044 data points. For Likertdata we conducted a repeated measures ANOVA with aligned rank transform [53], Tukey post-hoc analysis, and Holm-Bonrerroni's to correct for multiple comparisons.\nNoticeability. It was rated high with a global average of = 4.07 (SD = .86). ANOVA reveals a significant main effect of actuator, location, and actuator location interaction on noticeability ratings (F 10,999 = 13.03, p < .01). Post-hoc analysis shows significant differences (p < .01) between all actuator pairs, between back and the rest of locations, and between and the rest of locations. On average, the stimulus was more   noticeable (M = 4.34, SD = .78), than the dragger's (M = 4.18, SD = .87) and presser's (M = 3.68, SD = .78). The actuators were more noticeable on the followed by the wrist, upper arm, neck, back, and chest (see Fig. 6). We found a significant main effect of mobility on noticeability ratings (F 1,999 = 27.67, p < .01). Our actuators' stimuli were more noticeable during (M = 4.18, SD = .85) compared to walking (M = 3.96, SD = .85).\nDiscriminability. Participants discriminated the stimulus of the pincher (79.31%) more accurately than the (58.84%) and the dragger's (54.43%). ANOVA reveals a significant main interaction effect of actuator actuator location interaction on discriminability (F 10,999 = 2.72, p < .01). Post-hoc analysis shows significant differences (p .01) only between the and the other actuators. In Fig. 7, a confusion matrix reveals the discriminability of each tuator on a given location. Mobility had no significant effect on stimulus discriminability (p > .01).\nComfort. It was rated high with a global average of = 4.20 (SD = 1.13). ANOVA reveals a significant main interaction of location and actuator location interaction on comfort (F 10,999 = 3.66, p < .01). Post-hoc analysis shows significant differences (p < .01) only between the followlocations: wrist and the rest of locations, neck and {chest, Upper Arm}, and between back and chest. Mobility had no significant effect on (p > .01).\nReaction time. Participants' reaction time was the shortest for the pincher's stimulus M = 1.22 (SD = .87) sec, followed by dragger's M = 1.47 (SD = 1.0) sec, and the M = 2.43 (SD = 0.62) sec. Using our Springlet controller, dragger and pincher required two seconds to fully while the presser required four seconds because of its larger SMA spring and our limited current output. Figure 9 reflects the effect of actuator and location on participants' reaction time to a stimulus. On average, reaction time was shorter during the sitting compared to the walking. The effect size of this difference was 0.3 sec for the 0.44 sec for the dragger, and 0.16 sec for the", "n_publication_ref": 4, "n_figure_ref": 4}, {"heading": "Discussion", "text": "Springlets deliver noticeable tactile sensations on the skin? on some body locations more than others. On average, the Pincher's noticeability ratings were the highest. It was the most noticeable on the chest; comparable to the Dragger on the wrist, upper arm, shoulder and neck; and comparable to the Presser on the back. The data shows a clear interaction effect between Springlets and body locations on stimulus noticeability. One reason for the declined noticeability of the Dragger on the chest and back is that our selected mounting surfaces on these locations were concave, and the Dragger was built to accommodate mainly for convex. We predict that the overall lower noticeability of the Presser was due to slower actuation.\nCan users distinguish the stimuli generated by different more accurately from some actuators than others. Here, the body location did not have a significant effect on stimulus discriminability. Results show that if a participant rated the noticeability of an actuator between 4-5, she was 73% more likely to distinguish its stimulus correctly. which stretched two points on the skin towards other, generated the most discriminable stimulus, on body locations. On average, the Dragger and Presser performed equivalently. Figure 7 shows participants often confused the Dragger's and Presser's stimuli with the (p > .01). We noticed that if the first two Springlets not mounted properly on the skin, their often resulted in stretching the underlying skin. Overall, our results were in-line with previous research, which found tactile perception on the skin depends on the body location and stimulus' characteristics i.e., its intensity, frequency, temporal pattern, and spatial pattern as well as the user's and age [21]. Can Springlets be worn comfortably on challenging body Yes, participants were overwhelmingly positive about the comfort of Springlets. They found them very light and did not interfere with their movement. The main two exceptions were (a) placing the actuators on the neck using kinesiology tape felt \"strange\" for most participants, and (b) placing the actuators on body hair, like on the chest region of our male participants, felt \"painful\" when the actuator pulled on the hair. For some male participants, the hair on chest area prevented the actuators from adhering and moving on the skin. In contrast, our three female participants rated the comfort of the actuators high on the chest area: \"I wear necklaces...I am used to having something there\" (P09). Between trials, some participants commented that they almost forgot they were wearing something on their body: \"I it was still on my back\" (P04). After the study ended, a participant commented that the actuators were aesthetically pleasing: \"I like how this looks on me\" (P06). In terms of heat, the participants had no major complaints. One participate asked: \"Why do you keep asking me about heat?\" In one incident, however, the end-effector of the Dragger got stuck due to misplacement, which constrained the movement of the SMA causing it to accumulate heat that was noticeable.\nHow does user mobility affect the perception of Springlets? Walking compared to sitting affected the noticeability but the discriminability or comfort of Springlets' stimuli. Participants' reaction time to a stimulus decreased by 160 -440ms while walking, depending on the actuator.", "n_publication_ref": 1, "n_figure_ref": 1}, {"heading": "APPLICATIONS", "text": "We present five unique applications for Springlets in the contexts of tactile social communication, physical guidance, health interfaces, navigation, and virtual reality gaming 10). The applications demonstrate how Springlets can be customized, scaled, and controlled to create expressive effects across the body. Intimate Messenger on the Ear: Mediated social touch requires a finer granularity of sensations, beyond vibration [17]. Springlets' smooth and silent operation enables them to communicate non-critical, enjoyable events, such as receiving an intimate tactile message from a remote partner to communicate \"I miss you\". Motivated by prior work on behind-the-ear input [49], we contribute an approach for intimate discreet haptic messaging directly on the ear (Fig. 10.a). Placement on the ear has been chosen wearing objects in, on and behind the ear, such as frames for glasses or headphone earpieces is widely accepted without concern [16]. Springlets' noiselessness is one of the major advantages in this scenario, where aural sense could otherwise be impacted majorly. We attached a skin actuator Springlet between the helix and earlobe of the ear, and since earlobe is softer, our Springlet behaved like a stretcher, only on the earlobe. Three volunteers tested this application in an informal setting and were able to distinguish at least three levels of stretch. With this application in place it is possible for the user to receive basic haptic messages convey feelings or intentions. Non-Restricitive Motion Guide on the Forearm: guidance systems for the limbs are kinesthetic and restrictive in nature. The stick-on and pliable features of Springlets enable placing them freely on the body and grounding them directly on the skin, without restricting its natural movement. Inspired by the work from Kuniyasu et al. [27], who used skin stretching on the forearm as a mean to hint movement of the arm, we developed our motion guidance interface (Fig. 10.b). Our interface is composed of two stretch Springlets embedded with powerful 245g SMAs that can generate a range of The Springlets are placed on the outer and inner sides of the forearm and can be actuated in sync for a larger impact, or separately to deliver different hints. Our was worn by two volunteers who the stimuli as smooth and powerful. On the back it can serve as a slouch reminder.\nBreathing Coordinator on the Chest: Apps for sports health often integrate breathing rhythm aids to accomplish a steady heart rate or help calming down after stress They make use of tactile pulsating and visual patterns coordinate breathing. We developed a breathing coordinator that mimics the natural expansion contraction of the chest breathing (Fig. 10.c). The interface is composed of two expander Springlets connected back-to-back and placed on the chest. To signify 'inhale', the SMAs contract in sync, causing the zigzag end-effector to expand on the skin gradually. When the springs start expand back, the zigzag starts to contract to its position, signifying 'exhale'. By controlling the amount and duration of the driving current we can mimic deep breathing and shallow breathing.\nNavigator on the Today's navigation apps often make it possible to move the navigating device out of view and get auditory or vibrotactile feedback when change in movement direction is required. We implemented a haptic navigation device that can be worn on the back (Fig. 10.d). Our interface uses four stretch Springlets that are mapped to the 'forward', 'backward', 'left', and 'right' directions. The stimuli of the stretchers are 5-8 cm each other to guarantee a clear two-point discrimination [35]. More directions could be communicated by combining the signals of two or more Springlets. This interface could also benefit blind users by freeing their auditory channel.\nReality Backpack: In virtual reality gaming, vicues and visual cues, such as bar graphs, are often to convey artificially imposed weight levels to the user. We present an application that maps virtual weights in a player's backpack to dynamic pressure on his shoulder. Cutaneous haptic feedback enables simulation of weight, without kinesthetic limitation of movement [33]. Mounting three pressure Springlets on the shoulders of a user enables sensation of increasing weight in the place where backpack straps would tug. Collecting items generates short bursts of pressure to simulate throwing them into the backpack, while the basic pressure used for these bursts rises with the fill level of the user's inventory.\nBeyond On-Skin Applications: the shape-changing naof Springlets enables them to support on-skin tactile perception and active tactile perception, which requires user to actively move the skin on the display to receive tactile feedback [52]. For example, an end-effector Springlet like the Expander can be attached to the surface of a rigid device to provide on-demand tactile feedback on its battery status when a user touches it. While a skin actuator may attached to a soft object, like a toy, and pull or squeeze different parts of it for affective communication [54].", "n_publication_ref": 6, "n_figure_ref": 4}, {"heading": "LIMITATIONS AND FUTURE WORK", "text": "Our empirical results indicate that Springlets are a promising initial step towards expressive, thin and flexible tactile displays on the skin. But there remains room for important future work. The main limitations of Springlets stem from their actuation technology, the SMAs. SMAs suffer from (a) low controllability due to their hysteresis behaviour, and (b) low bandwidth and energy efficiency due to their heating cooling rates. To overcome these issues, we are designing a second generation of Springlets. Specifically, we are planning to implement a closed-loop feedback system [30] that the position and state of an SMA during actuation and allows us to adapt the driving current accordingly. This could enable us to calibrate the output of Springlets and improve their resolution across skins of variable elastic resistance and friction. It could also help detect in SMAs and enhance safety conditions. To improve the bandwidth of Springlets, we aim to modify the ventilation mechanism in our sticker structure. Alternatively, immersing the SMA in a fluid like water with glycol was found to improve response time by a factor of 100 [7].\nThis paper contributes a simple and rapid manual technique for fabricating Springlets. Our long-term goal is to develop an interactive design tool that allows designers to create a Springlet interface by simulating the desired tactile directly on the skin [43]. An integrated finite element method could help designers better predict the force distribution and effect of the Springlet on a given body location, without excessive field testing-a challenging direction for work. In the meanwhile, we are developing a digital tool that allows designers to control the intensity, frequency, and patterns of the Springlet's stimulus. Finally, making the device self-contained e.g., using a flexible PCB, is the necessary step to improve Springlets' wearability. We expect advances in energy harvesting technologies [31] to enable more practical wearable systems for powering future displays. So far, we have studied Springlets in a lab setting on the skin. For future work, we want to investigate Springlets in-the-wild to validate how they perform in a more noisy environment and under worn clothes. We would also like to explore techniques for integrating Springlets into wearable bands and rings as well as smart garments [12]. Beyond actuation, the sensing properties of SMAs could be leveraged to enable multi-modal input and output interfaces.", "n_publication_ref": 5, "n_figure_ref": 0}, {"heading": "CONCLUSION", "text": "We have introduced Springlets, the first on-skin, expressive and silent mechanotactile interfaces. We used thin and flexible shape memory alloy springs to create a wide range of gestures like pinch, stretch, press, pull, drag, and that go beyond squeeze. We have presented the actuation mechanism, design factors, fabrication technique, and details that enable creating and programming versatile Springlet interfaces on various body locations. Experimental results validate the perceptibility and wearability of Springlets over challenging body locations, like the neck and in different mobile situations. Springlets open up new opportunities for designing natural, real-world tactile experiences that can scale over the entire body.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "We thank Vyacheslav Kryvosheya, Paulina Reijsmeijer and Michał Supczyński for their help in the studies. This work was funded by the German 3D-Kompetenzzentrum and the ERC StG Interactive Skin (No 714797).", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Emulating Human Attention-Getting Practices with Wearable Haptics", "journal": "", "year": "2010", "authors": "A Baumann; K E Maclean; T W Hazelton; A Mckay"}, {"title": "Shape memory alloy microactuators", "journal": "Sensors and Actuators A: Physical", "year": "1990", "authors": "P Bergamasco; F Dario;  Salsedo"}, {"title": "HaptiColor: Interpolating Color Information As Haptic Feedback to the Colorblind", "journal": "ACM", "year": "2016", "authors": "Marta G Carcedo; Soon Hau Chua; Simon Perrault; Raj Pawełwozniak; Mohammad Joshi; Morten Obaid; Shengdong Fjeld;  Zhao"}, {"title": "Design and Evaluation of a Wearable Skin Stretch Device for Haptic Guidance", "journal": "IEEE Robotics and Automation Letters", "year": "2018-01", "authors": "C Chinello; J Pacchierotti; N G Bimbo; D Tsagarakis;  Prattichizzo"}, {"title": "Molecular Mechanisms of Mechanotransduction in Mammalian Sensory Neurons", "journal": "Nature Reviews Neuroscience", "year": "2011-09", "authors": "Patrick Delmas; Jizhe Hao; Lise Rodat-Despoix"}, {"title": "Active \"Hugging\" Vest for Deep Touch Pressure Therapy", "journal": "DYNALLOY Inc", "year": "2016-01-07", "authors": "Julia C Duvall; Lucy E Dunne; Nicholas Schleif; Brad Holschuh"}, {"title": "Inherent Problems of Attempts to Apply Sonar and Vibrotactile Sensory Aid Technology to The Perceptual Needs of The Blind. Optometry and vision science: official publication the American Academy of", "journal": "Optometry", "year": "1992", "authors": " Randolph D Easton"}, {"title": "Wearable Wireless Tactile Display for Virtual Interactions with Soft Bodies", "journal": "in bioengineering and biotechnology", "year": "2014", "authors": "Gabriele Frediani; Daniele Mazzei; Danilo Emilio De Rossi; Federico Carpi"}, {"title": "Jetto: Using Lateral Force Feedback for Smartwatch Interactions", "journal": "ACM", "year": "2018", "authors": "Da-Yuan Gong; Teddy Huang; Te Seyed; Tao Lin; Xin Hou; Molin Liu; Boyu Yang; Yuhan Yang; Xing-Dong Zhang;  Yang"}, {"title": "HapticClench: Investigating Squeeze Sensations Using Memory In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17)", "journal": "ACM", "year": "2017", "authors": "Aakar Gupta; Antony Albert ; Raj Irudayaraj; Ravin Balakrishnan"}, {"title": "Sketch&Stitch: Interactive Embroidery for E-textiles", "journal": "ACM", "year": "2018", "authors": "Nur Al-Huda Hamdan; Simon Voelker"}, {"title": "HydroRing: Supporting Mixed Reality Haptics Using Liquid Flow", "journal": "ACM", "year": "2018", "authors": "Teng Han; Fraser Anderson; Pourang Irani; Tovi Grossman"}, {"title": "PneuHaptic: Delivering Haptic Cues with a Pneumatic Armband", "journal": "", "year": "2015", "authors": "Liang He; Cheng Xu; Ding Xu; Ryan Brill"}, {"title": "Respiratory Sinus Arrhythmia in Humans: How Breathing Pattern Modulates Heart Rate", "journal": "ican Journal of Physiology-Heart and Circulatory Physiology", "year": "1981", "authors": "J A Hirsch; B Bishop"}, {"title": "Orecchio: Extending Body-Language Through Actuated Static and Dynamic Auricular Postures", "journal": "ACM", "year": "2018", "authors": "Teddy Huang; Linjun Seyed; Jun Li; Zhihao Gong; Yuchen Yao; ' Xiang; Xing-Dong Anthony' Chen;  Yang"}, {"title": "Social Touch Technology: A Survey of Haptic Technology for Social Touch", "journal": "IEEE Transactions on Haptics", "year": "2017-07", "authors": " Huisman"}, {"title": "Skin Drag Displays: Dragging a Physical Tactor Across the User's Skin Produces a Stronger Tactile Stimulus Than Vibrotactile", "journal": "ACM", "year": "2015", "authors": "Alexandra Ion; Edward Jay Wang; Patrick Baudisch"}, {"title": "A Review of Shape Memory Alloy Research, Applications and Opportunities", "journal": "Materials & Design", "year": "1980", "authors": "Jani Jaronie Mohd; Martin Leary; Aleksandar Subic; Mark A Gibson"}, {"title": "VT-ware: A Wearable Device for Upper Extremity Motion Guidance", "journal": "", "year": "2014", "authors": "S Jin; H Y Chun; E T Kim; S Kang"}, {"title": "Vibrotactile Pattern Recognition on the Arm and Back", "journal": "", "year": "2009", "authors": "A Lynette; Jacquelyn Jones; Erin Kunkel;  Piateski"}, {"title": "DuoSkin: Rapidly Prototyping On-skin User Interfaces Using Skin-friendly Materials", "journal": "", "year": "2016", "authors": ") Cindy; Christian Kao; Asta Holz; Andres Roseway; Chris Calvo;  Schmandt"}, {"title": "", "journal": "ACM", "year": "", "authors": ""}, {"title": "Small and lightweight tactile display(SaLT) its application", "journal": "ACM", "year": "2009", "authors": "Idin Karuei; Karon E Maclean; Zoltan Foley-Fisher; Russell Mackenzie; Sebastian ; Mohamed El-Zohairy"}, {"title": "The Tickler: A Compliant Wearable Tactile Display for Stroking and Tickling", "journal": "ACM", "year": "2015", "authors": "Espen Knoop; Jonathan Rossiter"}, {"title": "Development of Soft-Actuator-Based Wearable Tactile Display", "journal": "Transactions on Robotics", "year": "2008-06", "authors": "I M Koo; K Jung; J C Koo; J D Nam; Y K Lee; H R Choi"}, {"title": "Transmission of Forearm Motion by Tangential Deformation the Skin", "journal": "ACM", "year": "2012", "authors": "Yuki Kuniyasu; Michi Sato; Shogo Fukushima; Hiroyuki Kajimoto"}, {"title": "Designing a Non-contact Wearable Tactile Display Using Airflows", "journal": "ACM", "year": "2016", "authors": "Geehyuk Lee;  Lee"}, {"title": "Designing and Creating Epidermal Interactions", "journal": "ACM", "year": "2016", "authors": "Joanne Lo; Doris Jung ; Lin Lee; Nathan Wong; David Bui; Eric Paulos"}, {"title": "Position Control of Shape Memory Alloy Actuators with Internal Electrical Resistance Feedback Using Neural Networks", "journal": "Smart Materials and Structures", "year": "2004", "authors": "G Song; H-J Lee"}, {"title": "Wearable Energy Harvesting: From body to battery", "journal": "", "year": "2017", "authors": "D Magno;  Boyle"}, {"title": "A Whole Palm Tactile Display Using Suction Pressure", "journal": "", "year": "2004", "authors": "Yasutoshi Makino; Naoya Asamura; Hiroyuki Shinoda"}, {"title": "Gravity Grabber: Wearable Haptic Display to Present Virtual Mass Sensation", "journal": "ACM", "year": "2007", "authors": "Kouta Minamizawa; Souichiro Fukamachi; Hiroyuki Kajimoto; Naoki Kawakami; Susumu Tachi"}, {"title": "Wearable Haptic Systems for the Fingertip and the Hand: Taxonomy, Review, and Perspectives", "journal": "Transactions on Haptics", "year": "2017-10", "authors": "S Pacchierotti; M Sinclair; A Solazzi; V Frisoli; D Hayward"}, {"title": "Just Breathe: In-Car Interventions for Guided Slow Breathing", "journal": "ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1, Article", "year": "2018-03", "authors": "Pablo E Paredes; Yijun Zhou; Nur Al-Huda Hamdan; Stephanie Balters; Elizabeth Murnane; Wendy Ju; James A Landay"}, {"title": "A Haptic for Eyes-free Interactions", "journal": "ACM", "year": "2011", "authors": "Scott J Pasquero; Noel Stobbe;  Stonehouse"}, {"title": "MagTics: Flexible and Thin Form Factor Magnetic Actuators for Dynamic and Wearable Haptic Feedback", "journal": "ACM", "year": "2017", "authors": "Juan Jose Pece; Velko Zarate; Nadine Vechev; Olexandr Herbert Besse; Otmar Shea;  Hilliges"}, {"title": "Squeezeback: Pneumatic Compression for Notifications", "journal": "ACM", "year": "", "authors": "Henning Pohl; Peter Brandes; Hung Ngo Quang; Michael Rohs"}, {"title": "Vibrotactile Perception: Examining the Coding of Vibrations and the Just Noticeable Difference under Various Conditions", "journal": "Multimedia systems", "year": "2008", "authors": "Helena Pongrac"}, {"title": "VaiR: Simulating 3D Airflows in Virtual Reality", "journal": "ACM", "year": "2017", "authors": "Michael Rietzler; Katrin Plaumann; Taras Kränzle; Marcel Erath; Alexander Stahl; Enrico Rukzio"}, {"title": "Tactile Feedback the Finger Tips for Improved Direct Interaction in Immersive Environments", "journal": "", "year": "2007", "authors": "M Scheibe; B Moehring;  Froehlich"}, {"title": "Design of a SMA actuated 2-DoF tactile device for displaying tangential displacement", "journal": "", "year": "2011", "authors": "M Solazzi; W R Provancher; A Frisoli; M Bergamasco"}, {"title": "Design of Body-Grounded Tactile Actuators for Playback of Human Physical Contact", "journal": "", "year": "2011", "authors": "A Stanley; K J Kuchenbecker"}, {"title": "Evaluation of Tactile Feedback Methods for Wrist Rotation Guidance", "journal": "Transactions on Haptics", "year": "2012", "authors": "A A Stanley; K J Kuchenbecker"}, {"title": "Brush-Touch: Exploring an Alternative Tactile Method for Wearable Hap", "journal": "ACM", "year": "2017", "authors": "Evan Strasnick; Jessica R Cauchard; James A Landay"}, {"title": "User Experiences and Expectations of Vibrotactile, Thermal and Squeeze Feedback in Interpersonal Communication", "journal": "British Computer Society", "year": "2012", "authors": "Katja Suhonen; Kaisa Väänänen-Vainio-Mattila; Kalle Mäkelä"}, {"title": "HaptiHug: A Novel Haptic Display for Communication of Hug over a Distance", "journal": "", "year": "2010-01", "authors": ""}, {"title": "", "journal": "", "year": "", "authors": "Heidelberg Springer Berlin"}, {"title": "iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15)", "journal": "ACM", "year": "2015", "authors": "Martin Weigel; Tong Lu; Gilles Bailly; Antti Oulasvirta; Carmel Majidi; Jürgen Steimle"}, {"title": "SkinMarks: Enabling Interactions on Body Landmarks Using Conformal Skin Electronics", "journal": "ACM", "year": "2017", "authors": "Martin Aditya Shekhar Nittala; Alex Olwal; Jürgen Steimle"}, {"title": "Thermal Icons: Evaluating Structured Thermal Feedback for Mobile Interaction", "journal": "ACM", "year": "2012", "authors": "Graham Wilson; Stephen Brewster; Martin Halvey; Stephen Hughes"}, {"title": "The Role of Affective in Human-Robot Interaction: Human Intent and Expectations in Touching the Haptic Creature", "journal": "ACM", "year": "2012-04-01", "authors": "O Wobbrock; Leah Findlater; Darren Gergle; James J Yohanan; Karon E Maclean"}], "figures": [{"figure_label": "2", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 2 :2Figure 2: Springlets' actuation mechanism. Skin actuators deform the skin by applying force directly to the attachment points. End-effector actuators move or transform objects on the skin surface.", "figure_data": ""}, {"figure_label": "3", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 3 :3Figure 3: Springlets' multi-layer sticker structure. Bottom: Demonstration of a 3.5 mm thick Springlet embedding a 0.62 mm diameter SMA spring and lined with a heat barrier.", "figure_data": ""}, {"figure_label": "4", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 4 :4Figure 4: Implemented modular Springlets when actuated on the wrist along with technical drawings of their tactile layer.", "figure_data": ""}, {"figure_label": "", "figure_type": "", "figure_id": "fig_3", "figure_caption": "FigureFigure On-body placements of Springlets during the user study: Wrist, upper arm, shoulder, neck, chest, back.", "figure_data": ""}, {"figure_label": "7", "figure_type": "", "figure_id": "fig_4", "figure_caption": "Figure 7 :7Figure 7: Discriminability agreement rates of Springlets' as classified by participants, in both mobility conditions.", "figure_data": ""}, {"figure_label": "8", "figure_type": "", "figure_id": "fig_5", "figure_caption": "Figure 8 :8Figure 8: Comfort ratings of Springlets on 5-point-scale (mean, 95% CI), in both mobility conditions.", "figure_data": ""}, {"figure_label": "9", "figure_type": "", "figure_id": "fig_6", "figure_caption": "Figure 9 :9Figure 9: Reaction time to Springlets as logged participants (mean, 95% CI), in both mobility conditions.", "figure_data": ""}, {"figure_label": "10", "figure_type": "", "figure_id": "fig_7", "figure_caption": "10 :10Springlets' interactive applications. (a) Intimate messenger, (b) Non-restrictive motion guide, (c) Breathing coordinator, (d) Navigator, (e) Virtual reality backpack.", "figure_data": ""}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "depicts the specifications of the SMAs examined in this paper.", "figure_data": "SMA SupplierToki BioMetalHelix®Dynalloy Flexinol®Coil diameter (mm)0.40.621.37 2.54 3.45Generated force (g)203040140245Standard current (mA) 150300700 1,900 3,400Table"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "Specifications and performance of our six modular Springlets placed on the wrist. The embedded SMAs were driven with their standard current until full contraction.", "figure_data": ""}], "doi": "10.1145/3290605.3300718"}