{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.36800003051758,
      "x2": 295.5633544921875,
      "y1": 445.5959777832031,
      "y2": 608.6119995117188
    },
    "text": "ABSTRACT We propose a novel type of olfactory device that creates a stereosmell experience, i.e., directional information about the location of an odor, by rendering the readings of external odor sensors as trigeminal sensations using electrical stimulation of the user’s nasal septum. The key is that the sensations from the trigeminal nerve, which arise from nerve-endings in the nose, are perceptually fused with those of the olfactory bulb (the brain region that senses smells). As such, we propose that electrically stimulating the trigeminal nerve is an ideal candidate for stereo-smell augmentation/substitution that, unlike other approaches, does not require implanted electrodes in the olfactory bulb. To realize this, we engineered a self-contained device that users wear across their nasal septum. Our device outputs by stimulating the user’s trigeminal nerve using electrical impulses with variable pulse-widths; and it"
  },
  "figures": [{
    "caption": "Figure 5: (a) To stimulate the during inhalation, we use a photo-interrupter. (b) The sensor measures how nostril flares during inhalation. (c) In turn, this flare creates an increase in the distance between the photo-interrupter and the nostril.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.202880859375,
      "y1": 209.73512268066406,
      "y2": 226.32501220703125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "5",
    "page": 5,
    "regionBoundary": {
      "x1": 86.0,
      "x2": 526.0,
      "y1": 83.0,
      "y2": 196.0
    }
  }, {
    "caption": "Figure 12: On average, participants were closer to the odor source in the virtual condition than in the real. Note that there was no training phasewhatsoever in our study and these participants had no experiencewith our electrical trigeminal stimulation.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.2029418945312,
      "y1": 220.31910705566406,
      "y2": 236.90899658203125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "12",
    "page": 10,
    "regionBoundary": {
      "x1": 162.0,
      "x2": 450.0,
      "y1": 83.0,
      "y2": 207.0
    }
  }, {
    "caption": "Figure 6: Two example pulses, of which (a) is monophasic and (b) is biphasic. (c) The Rehamove signal generator, which we used in our studies.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.2030029296875,
      "y1": 211.25306701660156,
      "y2": 227.84295654296875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "6",
    "page": 6,
    "regionBoundary": {
      "x1": 93.0,
      "x2": 519.0,
      "y1": 83.0,
      "y2": 198.0
    }
  }, {
    "caption": "Figure 2: (a) Our user burnt their toast while making breakfast, which unfortunately emits a strong odor that masks the actual danger, a gas leak in their stove. (b) As the user inhales, our device renders the smell of methane by stimulating the user’s trigeminal nerve electrically and to the left—indicating the location of the methane gas leak, which is tracked via an external odor sensor that relays these readings to our sensor via Bluetooth. (c) This allowed the user to find the leak.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.2030639648438,
      "y1": 236.69007873535156,
      "y2": 275.19793701171875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "2",
    "page": 2,
    "regionBoundary": {
      "x1": 87.0,
      "x2": 525.0,
      "y1": 83.0,
      "y2": 223.0
    }
  }, {
    "caption": "Figure 8: Participants reported the (a) intensity and (b) lateralization of all 25 pulse candidates. The left-most column and top-most row represent the pulse’s first and second phases, respectively.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.2027587890625,
      "y1": 470.412109375,
      "y2": 487.00201416015625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "8",
    "page": 7,
    "regionBoundary": {
      "x1": 89.0,
      "x2": 523.0,
      "y1": 241.0,
      "y2": 457.0
    }
  }, {
    "caption": "Figure 7: Metrics used to analyze the electrical waveforms are total charge (yellow) and net charge (red).",
    "captionBoundary": {
      "x1": 96.94499969482422,
      "x2": 515.0549926757812,
      "y1": 220.8950958251953,
      "y2": 226.5260009765625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "7",
    "page": 7,
    "regionBoundary": {
      "x1": 159.0,
      "x2": 453.0,
      "y1": 83.0,
      "y2": 207.0
    }
  }, {
    "caption": "Figure 9: Perceived intensity ratings for the different waveforms according to their total charge.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 295.6487121582031,
      "y1": 634.820068359375,
      "y2": 651.4100341796875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "9",
    "page": 7,
    "regionBoundary": {
      "x1": 67.0,
      "x2": 281.0,
      "y1": 505.0,
      "y2": 621.0
    }
  }, {
    "caption": "Figure 11: Our suggested pulses are divided into three directions and three intensities to render both changes in source location and proximity. Each pulse shows its reported intensity (vertical plot) and reported lateralization (horizontal plot).",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.2030639648438,
      "y1": 458.11309814453125,
      "y2": 474.7030029296875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "11",
    "page": 8,
    "regionBoundary": {
      "x1": 87.0,
      "x2": 525.0,
      "y1": 263.0,
      "y2": 445.0
    }
  }, {
    "caption": "Figure 10: (a) Perceived lateralization (direction) of the different waveforms based on their net electric charge. (b) Pulse candidates were categorized as either starting with a negative or positive current; (0,0)-pulses are excluded. Participants ultimately rated pulses starting with a positive phase as more to the right.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 559.8079833984375,
      "y1": 220.46607971191406,
      "y2": 248.01495361328125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "10",
    "page": 8,
    "regionBoundary": {
      "x1": 89.0,
      "x2": 523.0,
      "y1": 83.0,
      "y2": 207.0
    }
  }, {
    "caption": "Figure 4: (a) High-level schematic for our device’s hardware and (b) a stimulation that creates trigeminal sensation to the left nostril (i.e., a lateralized sensation to the left; more details of how we found these waveforms in our first user study).",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.2028198242188,
      "y1": 426.6211242675781,
      "y2": 443.21099853515625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "4",
    "page": 4,
    "regionBoundary": {
      "x1": 89.0,
      "x2": 523.0,
      "y1": 262.0,
      "y2": 413.0
    }
  }, {
    "caption": "Figure 3: (a, b) Our device is comprised of two printed circuit boards (PCB), one in each nostril. (c) Small magnets on each side allow the device to hold securely to the user’s nose by means of magnetism.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.203125,
      "y1": 231.0200958251953,
      "y2": 247.6090087890625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "3",
    "page": 4,
    "regionBoundary": {
      "x1": 91.0,
      "x2": 521.0,
      "y1": 83.0,
      "y2": 218.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.31700134277344,
        "x2": 294.1769714355469,
        "y1": 621.4981079101562,
        "y2": 707.3469848632812
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. CHI ’21, May 08–13, 2021, Yokohama, Japan © 2021 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 978-1-4503-8096-6/21/05. . . $15.00 https://doi.org/10.1145/3411764.3445300"
    }, {
      "page": 0,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.5853271484375,
        "y1": 446.5919189453125,
        "y2": 551.0780029296875
      },
      "text": "inputs by sensing the user’s inhalations using a photoreflector. It measures 10x23 mm and communicates with external gas sensors using Bluetooth. In our user study, we found the key electrical waveform parameters that enable users to feel an odor’s intensity (absolute electric charge) and direction (phase order and net charge). In our second study, we demonstrated that participants were able to localize a virtual smell source in the room by using our prototype without any previous training. Using these insights, our device enables expressive trigeminal sensations and could function as an assistive device for people with anosmia, who are unable to smell."
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 538.1337280273438,
        "y1": 571.2371215820312,
        "y2": 591.7860107421875
      },
      "text": "CCS CONCEPTS • CSS CONCEPTS; • Hardware→ Emerging technologies;"
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549560546875,
        "x2": 515.368408203125,
        "y1": 611.9451293945312,
        "y2": 632.4949951171875
      },
      "text": "KEYWORDS Electrical stimulation, trigeminal, olfaction, intranasal"
    }, {
      "page": 0,
      "region": {
        "x1": 317.6599426269531,
        "x2": 559.430419921875,
        "y1": 652.5287475585938,
        "y2": 707.3469848632812
      },
      "text": "ACM Reference Format: Jas Brooks, Shan-Yuan Teng, Jingxuan Wen, Romain Nith, Jun Nishida, and Pedro Lopes. 2021. Stereo-Smell via Electrical Trigeminal Stimulation. In CHI Conference on Human Factors in Computing Systems (CHI ’21), May 08–13, 2021, Yokohama, Japan. ACM, New York, NY, USA, 13 pages. https: //doi.org/10.1145/3411764.3445300"
    }]
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.0295104980469,
        "y1": 101.49192810058594,
        "y2": 151.1829833984375
      },
      "text": "The sense of smell is what allows us to understand a wide range of everyday experiences, from pleasurable ones (such as enjoying good food) to detecting potential hazards (e.g., smell of rotten food, microbial threats, and non-microbial threats such as from hazardous gases) [53]."
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.4250793457031,
        "y1": 156.28697204589844,
        "y2": 315.5669860839844
      },
      "text": "Traditionally, olfactory interfaces physically push odor molecules into the user’s nose. This methodology is limiting: it requires olfactory interfaces to be built from bulky actuators (tubes, pumps, and transducers) that redirect smell from containers to the user’s nose. While this works in scenarios where one can hide a large device (e.g., smells as notifications while driving [11]) these actuators are impractical for ubiquitous everyday use because their form-factor is dictated by the size of reservoirs and actuators. One of the most promising ways to break from size-limitations is to shift from analog (i.e., pushing odor molecules to the nose) to digital (i.e., stimulating the olfactory bulb to generate the odor perception) actuation. This approach has gained some attention in the HCI community [52]. While this approach digital actuation is certainly promising, it involves risky insertion procedures with little success at reproducing smells."
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5567321777344,
        "y1": 320.6709289550781,
        "y2": 359.4020080566406
      },
      "text": "Instead, we approach digital actuation from a new angle by searching for a less-invasive location to apply electrical nose stimulation, one that still works without the need for invasive and risky electrodes attached to the olfactory bulb."
    }, {
      "page": 1,
      "region": {
        "x1": 52.78499984741211,
        "x2": 295.560302734375,
        "y1": 364.50592041015625,
        "y2": 512.8270263671875
      },
      "text": "The principle behind our approach is the fact that while, previously, the sense of smell was attributed to the function of the olfactory bulb alone, this notion has been revised once the contributions of the trigeminal nerve to smelling were understood. In fact, the trigeminal nerve, which has nerve-endings lodged in the nasal cavity, works in tandem with the olfactory bulb to detect the warmth, freshness, astringency, etc. of incoming odors (e.g., the freshness of mint) [5]. In other words, we do not perceive the “freshness of mint” in isolation from the “odor of mint” because the experiences of the trigeminal nerve and the olfactory bulb are often fused together into what we experience as a “smell.” In fact, some of our examples for the role of smell included situations in which the trigeminal sensations are key, for instance, in detecting potential hazards via the smell of noxious gases [53]."
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2790222167969,
        "y1": 517.9309692382812,
        "y2": 655.29296875
      },
      "text": "Building on this perceptual fusion between the sensations of the trigeminal nerve and olfactory bulb, we propose a novel type of olfactory substitution device that renders readings from odor or gas sensors as trigeminal sensations bymeans of electrically stimulating their trigeminal nerve. Our device is a new alternative to olfactory devices that stimulate the olfactory bulb via electrodes deep in the nose [59], which unfortunately require trained personnel. Our device sits across the user’s nasal septum, where it can already access the trigeminal nerve, unlike other devices that require the insertion of electrodes up the nasal cavity. While our device does not create an entire “digital smell,” because it does not extend to the olfactory bulb, it does create sensations typically associated with smelling: trigeminal sensations."
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5594177246094,
        "y1": 660.39697265625,
        "y2": 699.1279907226562
      },
      "text": "Our device measures 10x23 mm and communicates with external sensors via Bluetooth, allowing it to fit entirely inside the user’s nose (including battery, sensors, wireless, stimulator, electrodes) like a nose-ring across the septum. While our device is"
    }, {
      "page": 1,
      "region": {
        "x1": 317.7489929199219,
        "x2": 558.739990234375,
        "y1": 87.79393005371094,
        "y2": 170.36102294921875
      },
      "text": "self-contained, it is only capable of electrical trigeminal stimulation and requires a connection to external odor sensors (via Bluetooth) to obtain odor or gas readings. It stimulates the trigeminal nerve using an electric, biphasic waveform (using a positive and negative current) with computer-controlled pulse-width, depicted in Figure 1. This electrical waveform design is key to how our device allows users to feel via trigeminal cues: not only the intensity of the odor but also its direction, i.e., stereo-smell."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.7979736328125,
        "x2": 156.52896118164062,
        "y1": 86.7980728149414,
        "y2": 93.64898681640625
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.1864624023438,
        "y1": 225.60997009277344,
        "y2": 373.9309997558594
      },
      "text": "Figure 2 shows an example of a user, who while making toast for breakfast uses our device to find a gas leak. In this case, our device augments their perception, making a gas that humans cannot detect, methane, interpretable via the trigeminal sensation. To sense this gas, our device is connected (via Bluetooth) to a combustible gas sensor (see Implementation for details). In everyday life, gas leaks are recognizable because gas providers inject an additional odor molecule called mercaptan, which smells of “rotten eggs”, to alert consumers to the presence of a leak. Unfortunately, mercaptan often fails to alert users due to: temporary loss of smell (e.g., as a cause of other illnesses, such as COVID-19); smell impairments (such as anosmia, loss of sense of smell, or hyposmia, reduced sense of smell); or simply due to the unfortunately common odor masking (i.e., other smells that are stronger and mask the mercaptan) [46]."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1921997070312,
        "y1": 379.0349426269531,
        "y2": 439.68499755859375
      },
      "text": "To this user these limitations are not a problem, since our device allows this user to perceive the gas leak (the methane sensed by the external combustible gas sensor) by feeling a tingling sensation inside their nose which is synchronized with their breathing-in, depicted in Figure 2 (b). This sensation is a trigeminal cue, like the sensation when smelling white vinegar."
    }, {
      "page": 1,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.720947265625,
        "y1": 444.7879333496094,
        "y2": 582.1500244140625
      },
      "text": "To render this trigeminal sensation: (1) our device detects inhalation bymeasuring the flare of the user’s nostril with a photoreflector (i.e., as the user breathes in, their nostrils enlarge); (2) then, as the user inhales, our device stimulates their trigeminal nerve with an electrical impulse which renders both the intensity of the gas, and its direction (i.e., to the left or right of the external odor sensor). The latter is particularly useful to locate odors in space and allows this user to experience stereo-smell for methane. As such, as depicted in Figure 2 (c), they find that it is their stove, which is to their left, that is leaking the gas and it is not the burnt toast smell to their right. As we will detail in our implementation and study, we induce this stereo-smell sensation by varying the electrical characteristics of the stimulation waveform (pulse-width and polarity)."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 550.5260620117188,
        "y1": 185.01309204101562,
        "y2": 217.76702880859375
      },
      "text": "2 WALKTHROUGH: A USER SMELLING THE DIRECTION OF A GAS LEAK (STEREO-SMELL)"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.6409912109375,
        "x2": 559.5850830078125,
        "y1": 611.4969482421875,
        "y2": 650.22802734375
      },
      "text": "The work presented in this paper builds primarily on the fields of electrophysiology, olfactory interfaces, and sensory substitution. Also, to familiarize the reader with the underutilized trigeminal nerve, we present an overview of its functions."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 421.744140625,
        "y1": 596.8021240234375,
        "y2": 603.6530151367188
      },
      "text": "3 RELATEDWORK"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.4334716796875,
        "y1": 679.574951171875,
        "y2": 707.3469848632812
      },
      "text": "Sensory substitution involves a translation of information from one sensory modality to another. Sensory substitutions for vision are most common and translate images into other modalities, usually"
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.4259338378906,
        "y1": 297.53692626953125,
        "y2": 369.1449890136719
      },
      "text": "as assistive devices for visually impaired individuals. For instance: SmartTouch is a system that uses electrotactile stimulation on the skin to render an image [25]; and, the tongue display unit is a tactile-vision sensory substitution systemwhich translates an image from a camera into electrotactile stimulation on the tongue [2]. Other popular sensory substitutions involve image-to-sound, such as Meijer et al.’s device [38]."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 445.19873046875,
        "y1": 664.880126953125,
        "y2": 671.7310180664062
      },
      "text": "3.1 Sensory Substitution"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.5624084472656,
        "y1": 400.8849182128906,
        "y2": 538.2459716796875
      },
      "text": "While sensory substitution for vision has been extensively researched, little research has investigated the translation of olfactory cues into other sensory modalities. Two key contributions in olfactory substitution have investigated the translation of non-olfactible gaseous compounds (e.g., combustible gases, such as methane) into detectable stimuli for humans. The Olfactory Assist Mask is a wearable that converts metal-oxide gas sensor responses to combustible gases that cannot be smelled into actual smells, such as the fragrance of apple [36]. Choi et al. engineered a wearable augmentation that converts detected combustible gases into vibrotactile stimulation on the forearm [10]. Unfortunately, as far as we know, no other existing works explore the substitution of olfactory cues to other sensory modalities."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 230.87449645996094,
        "y1": 386.1900634765625,
        "y2": 393.0409851074219
      },
      "text": "3.2 Olfactory Sensory Substitution"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.0347595214844,
        "y1": 569.9859619140625,
        "y2": 707.3469848632812
      },
      "text": "The trigeminal nerve (cranial nerve V) is a somatosensory nerve primarily known for sensing mechanical and thermal stimulation, sensing changes in pressure, vibration, or temperature [39]. A lesser known property of the trigeminal nerve is that its receptors (the transient receptor potential ion channels) also respond to airborne particles [39]. It is their ability to detect both airborne particles and temperature shifts that explains why scents such as peppermint feel cool [37]. The effects of the trigeminal experiences are readily recognizable in everyday life, e.g., eating or smelling spicy food, pungent flavors, and breathing cold air [1]. What is remarkable is that humans rarely experience pure olfactory or pure trigeminal sensations in isolation—in other words, these senses are uniquely intertwined."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 171.9326629638672,
        "y1": 555.2910766601562,
        "y2": 562.1419677734375
      },
      "text": "3.3 Trigeminal System"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.715087890625,
        "y1": 311.2359313964844,
        "y2": 437.6390075683594
      },
      "text": "Though the trigeminal and olfactory bulb have different structures and functions, most smells simultaneously activate both systems, each contributing to the overall perception of smell (e.g., freshness of menthol being inseparable from its minty odor). There are few chemicals that selectively stimulate only one of the two: carbon dioxide only stimulates the trigeminal nerve and vanillin only stimulates the olfactory bulb. Several electrophysiological and imaging studies have demonstrated that the perception of trigeminal and olfactory systems is intertwined and that these systems influence one another [5, 20, 32, 33]. For further detailed information, Brand et al. present a thorough review of literature on the interactions between the olfactory bulb and the trigeminal nerve [5]."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.95501708984375,
        "x2": 485.1152648925781,
        "y1": 296.5411071777344,
        "y2": 303.39202880859375
      },
      "text": "3.4 Trigeminal-Olfactory Fusion"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7150268554688,
        "y1": 471.35491943359375,
        "y2": 630.635009765625
      },
      "text": "Our device is inspired by four recent interactive systems that stimulate the trigeminal nerve. The first two interfaces leverage the interactions between the thermal-side of the trigeminal nerve and olfactory bulb to modulate the perception of an odor: Fujino et al. change the temperature of the air to modulate the perceived odor [17]; and, similarly, affecting tumbler is a cup lid that thermally stimulates the skin around the nose during drinking to modulate the perceived flavor [56]. The other two interfaces leverage the chemical side of the trigeminal nerve, creating a temperature sensation. In Season Traveller, Ranasinghe et al. utilize peppermint essential oil (which contains menthol) to stimulate a cooling sensation for their VR winter environments alongside thermoelectric materials [44]. Similarly, Brooks et al.’s wearable device induces temperature illusions, both hot and cold, by delivering aerosolized trigeminal stimulants to the user’s nose [6]."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1865844726562,
        "y1": 635.7389526367188,
        "y2": 707.3469848632812
      },
      "text": "Unlike these devices, our approach is the first wearable device to electrically stimulate the trigeminal nerve endings in the nose. This has several advantages when it comes to sensory substitution: (1) it is a much smaller device (no need for liquids, reservoirs, pumps, large batteries, etc.); and (2) stimulation patterns can be controlled at the microsecond level, which is difficult to achieve using liquids or gases."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 450.1187744140625,
        "y1": 456.66107177734375,
        "y2": 463.5119934082031
      },
      "text": "3.5 Trigeminal Interfaces"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5628967285156,
        "y1": 114.44395446777344,
        "y2": 142.21697998046875
      },
      "text": "Previous neuroscience and physiology research have investigated the perceived sensations of electrical stimulation of the nasal mucosa and olfactory epithelium."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.56427001953125,
        "y1": 147.3209686279297,
        "y2": 262.7650146484375
      },
      "text": "Researchers have been exploring reproducing smell via electrical stimulation of the olfactory bulb. Such stimulation requires a trained experimenter to insert a long prong up the user’s nostril to touch the olfactory bulb (brain region at eye-level) with an electrode, holding the electrode-prong in place to maintain constant contact with the olfactory bulb. Unfortunately, most researchers either fail to produce such smell percepts via electrical stimulation of the olfactory bulb [19, 55, 59] or fail to produce consistent sensations among participants [9, 19]. Nonetheless, they all succeeded to produce several unintended trigeminal percepts, such as warm, tingly, painful, etc."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5599670410156,
        "y1": 267.8689270019531,
        "y2": 339.47698974609375
      },
      "text": "In contrast, less research has been devoted to electrical stimulation of intranasal trigeminal nerve-endings. Most notable is Iannili et al.’s studies that confirmed that electrical stimulation consistently elicited trigeminal sensations, rather than olfactory ones [21]. The sensitivity threshold for the trigeminal nerve was determined to be at 0.6 mA and upper-threshold stimuli to be 1.8 mA for electrical stimulation [21]."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.7979736328125,
        "x2": 262.59869384765625,
        "y1": 86.7980728149414,
        "y2": 106.5999755859375
      },
      "text": "3.6 Intranasal Electrical Stimulation of Olfactory Bulb and Trigeminal Nerve"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5580139160156,
        "y1": 372.72491455078125,
        "y2": 510.0870056152344
      },
      "text": "Humans can track an odor and follow its route by searching and comparing different locations in an odor field, i.e., by sampling different locations one builds a mental map of odor intensities. However, this process is not what we typically would call “stereo-smell” as the user needs to move to sample the space. Surprisingly, there is recent evidence that humans do exhibit stereo-smell even when standing still, however these sensations are pre- or non-conscious and cannot be verbalized [60]. When non-trigeminal smells arrive at the olfactory bulb via different nostrils, they moderately bias humans’ perceived direction of self-motion towards the nostril with a higher concentration of the smell, but when asked users cannot verbalize which nostril smells stronger [60]—this is called stereo-olfaction (as in olfactory bulb)."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5639343261719,
        "y1": 515.1909790039062,
        "y2": 564.8820190429688
      },
      "text": "On the flipside, the trigeminal nerve is capable not only of recognizing the concentration of trigeminal-odors in the different nostrils, but its user is capable of verbalizing it, i.e., we can consciously tell in which nostril we smell more of a particular trigeminal odor [12, 27, 51]—this is called trigeminal lateralization."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5590515136719,
        "y1": 569.9859619140625,
        "y2": 608.7169799804688
      },
      "text": "In contrast, pure odorants such as vanillin (the core ingredient in the smell of vanilla) cannot be consciously used for spatial navigation, but trigeminally irritants such as menthol (minty fresh compound) yield lateralization rates of more than 96% [27]."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5638732910156,
        "y1": 613.8209838867188,
        "y2": 707.3469848632812
      },
      "text": "As discussed, the trigeminal system responds to mechanical, chemical, and electrical stimulation [21].When electrically stimulating the olfactory epithelium (which includes trigeminal enervation [50]) in one nostril, participants reported localizing the stimulation to the stimulated side [13, 18, 19, 21, 22], suggesting one may also accurately lateralize electrical stimulations detected by the trigeminal system.We take advantage of these neuroscientific observations to propose using the electrical-sensitivity of the trigeminal nerve for stereo-smell."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 278.67816162109375,
        "y1": 358.03106689453125,
        "y2": 364.8819885253906
      },
      "text": "3.7 Stereo Olfaction and Odor Lateralization"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.5850830078125,
        "y1": 127.39494323730469,
        "y2": 242.8389892578125
      },
      "text": "This lateralization, which is a unique feature of the trigeminal nerve, is what our device leverages to allow users to experience a kind of “stereo-smell”; one that is not driven by the olfactory bulb but instead by the electrical stimulation of the trigeminal nerve. To leverage this lateralization, we designed our novel device to be inside the nose and stimulate the nasal septum, where the trigeminal nerve can be easily found [16].While theoretically onemight be able to access the trigeminal nerve by electrically stimulating different areas of the nose, we found that not only the septum was more easily accessible, but other areas of the nose did not work in our initial experimental pilots."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7132568359375,
        "y1": 247.9429168701172,
        "y2": 363.3869934082031
      },
      "text": "Furthermore, it is worth emphasizing that we found that while our approach shares some similarities with electrotactile skin stimulation (e.g., [23, 24, 58]), our approach is in fact specific to the trigeminal nerve inside the nose. While the area where we attach the electrodes is also skin (hence the apparent similarity to electrotactile), yet, as we will demonstrate in our studies, electrical stimulation of the septum creates lateralizable sensations. Feeling the direction of the current is something that we found to be unique to the nose’s trigeminal nerve; in fact, to support this assertion, we placed our device across the finger pad, but we failed to elicit any lateralization in the finger pad’s skin."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 317.95501708984375,
        "x2": 551.6826171875,
        "y1": 86.7980728149414,
        "y2": 119.552001953125
      },
      "text": "3.8 Framing Our Approach: Lateralization Via Electrical Stimulation Of The Intranasal Trigeminal Nerve"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.7183837890625,
        "y1": 416.5609130859375,
        "y2": 455.2929992675781
      },
      "text": "Our key contribution is the first wearable device that fits in the user’s nose to electrically stimulate their trigeminal sense. Our device enables users to feel, via trigeminal cues, not only the intensity of an odor but also its direction (i.e., to their left or right)."
    }, {
      "page": 3,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.71337890625,
        "y1": 460.3969421386719,
        "y2": 597.7579956054688
      },
      "text": "Our approach has four key benefits: (1) as we observed in our second study, users are able to make use of our device to locate smells without any training; (2) this new modality (electrical trigeminal stimulation) can also be employed as an assistive device for smell-impaired individuals, because it electrical stimulating the trigeminal nerve, which remains functional in most anosmics, instead of the olfactory bulb; (3) it is an safe alternative to electrically stimulating the olfactory bulb with electrodes inside the user’s nose, which require surgical and invasive procedures; and, (4) it is the first wireless and self-contained interactive device that can be worn nasally, providing an alternative means for trigeminal stimulation without the use of chemical reservoirs, utilized in prior research [6, 44]."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1983032226562,
        "y1": 602.8619384765625,
        "y2": 707.3469848632812
      },
      "text": "However, our approach is not without its limitations. (1) We purposely explored electrical stimulation of the trigeminal nerve rather than the olfactory bulb for accessibility reasons. This means that our device is limited to the creation of trigeminal sensations— as such our stereo-smell is trigeminally induced: in other words, this is not a traditional olfactory device (one with chemical-based odors). (2) While our device is entirely self-contained (including battery, sensors, wireless, stimulator, electrodes), it is only capable of trigeminal stimulation and depends upon a connection to external odor sensors (via Bluetooth) to obtain odor readings."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 512.1041870117188,
        "y1": 388.9150695800781,
        "y2": 408.71697998046875
      },
      "text": "4 BENEFITS, CONTRIBUTIONS, AND LIMITATIONS"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.56146240234375,
        "y1": 479.2489318847656,
        "y2": 517.98095703125
      },
      "text": "To help readers replicate our design, we now provide the necessary technical details. Furthermore, to accelerate replication we provide all the source code, firmware, and schematics of our implementation.1"
    }, {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5593566894531,
        "y1": 523.0849609375,
        "y2": 550.8580322265625
      },
      "text": "Figure 3 shows our complete and self-contained prototype, including its battery. It measures 10x23x5 mm in one nostril, 10x23x7 mm in the other, and weighs 3.4 g."
    }, {
      "page": 4,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.56396484375,
        "y1": 555.9619750976562,
        "y2": 605.6519775390625
      },
      "text": "To implement our device, we utilized an nRF52811 (Nordic Semiconductors) as the system’s microcontroller, because of its small size as well as integrated ARM Cortex M4 and Bluetooth Low Energy (BLE) radio. We leverage the BLE to communicate with external devices, such as gas sensors or even mobile phones."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 169.8053741455078,
        "y1": 464.5550842285156,
        "y2": 471.406005859375
      },
      "text": "5 IMPLEMENTATION"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.52899932861328,
        "x2": 294.2474670410156,
        "y1": 657.6569213867188,
        "y2": 707.3469848632812
      },
      "text": "To create an electrical stimulation of the user’s trigeminal nerve, we designed our own stimulator based on the results from our Studies 1 and 2; its circuit design is depicted in Figure 4 (a). We did so because no existing stimulator would fit in the user’s nose. Additionally, the septum is an ideal stimulation location as trigeminal stimulation is"
    }, {
      "page": 4,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.717529296875,
        "y1": 465.5509338378906,
        "y2": 559.0770263671875
      },
      "text": "perceived as stronger in the front of the nasal cavity [16]. To create the stimulation waveform depicted in Figure 4 (b), we utilize a DRV8847 (Texas Instrument), a dual h-bridge capable of outputting up to 18 Vpp in a 3x3 mm footprint. The voltage supply for the stimulation is generated from a MT3608 (Aerosemi Technology) boost-converter with adjustable voltage output, which we set at 18V. The parameters of the generated waveform (such as pulsewidth or current polarity) are generated by the microcontroller by controlling the h-bridge’s enable and direction."
    }, {
      "page": 4,
      "region": {
        "x1": 317.6860046386719,
        "x2": 558.3681030273438,
        "y1": 564.1809692382812,
        "y2": 635.7890014648438
      },
      "text": "Lastly, to deliver the electrical impulses from our stimulator to the user’s trigeminal nerve, we utilize two silver/silver chloride (Ag-AgCl) disc electrodes, which protrude on the back side of each PCB. Thus, these act as points of contact with the nasal septum for stimulation. Ag-AgCl electrodes were chosen because they do not corrode over time, as it is common with copper or other types of electrodes."
    }, {
      "page": 4,
      "region": {
        "x1": 317.8290100097656,
        "x2": 436.103271484375,
        "y1": 701.1298828125,
        "y2": 707.3480224609375
      },
      "text": "1https://lab.plopes.org/#stereo-trigeminal"
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 256.5872497558594,
        "y1": 630.0111083984375,
        "y2": 649.81298828125
      },
      "text": "5.1 Design of Our Intranasal Stimulator (Output)"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.0329895019531,
        "y1": 275.31494140625,
        "y2": 390.7590026855469
      },
      "text": "To allow users to feel the trigeminal sensations in a realistic manner, we coupled the stimulation to the user’s breath-in phase. To track the breathing patterns, we added a SG-105F reflective-type infrared photo interrupter (Kodenshi Corp) on the PCB, angled directly outwards to one of the user’s nostrils, as depicted in Figure 5. We sample this sensor at over 100 Hz (at a 12-bit resolution) to measure the distance between nostril and PCB as the user’s nose flares during the breathing cycle; it is known that nostrils enlarge as we breath in [28]. Furthermore, users can turn on/off the stimulation by quickly inhaling three times; moreover, we acknowledge there are other methods to handle nose gestures as input [31]."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 293.3182373046875,
        "y1": 247.66812133789062,
        "y2": 267.4710693359375
      },
      "text": "5.2 Design of Our Intranasal Nostril Movement Sensor (Input)"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.5842590332031,
        "y1": 420.3629150390625,
        "y2": 491.97100830078125
      },
      "text": "To ensure the device makes good contact with the user’s septum without the need for implantation (e.g., such as an actual nose ring) we use two magnets, one on each side of the PCB. The magnets hold the device in place by attracting each other, even across the nasal septum. The use of magnets also allows a user to snap the device on or off their nasal septum, without any overly complicated insertion procedure."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 293.6454772949219,
        "y1": 405.6680908203125,
        "y2": 412.5190124511719
      },
      "text": "5.3 Securing Our Device Inside The User’s Nose"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.0313720703125,
        "y1": 521.574951171875,
        "y2": 615.1010131835938
      },
      "text": "We power our device using a 10 mAh lithium polymer battery (PGEB201212, General Electronics Battery Co.). It draws an average 0.2 mAh while connected wirelessly to an external odor sensor using BLE. To this, it adds an additional current draw of 0.05-1 mAh during electrical stimulation. Thus, at an average of 12-20 stimulations per minute (human’s average respiratory rate [47]), our device runs for around one hour using a single battery. Note that a second one can be added to the other PCB to double the battery life."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 137.43807983398438,
        "y1": 506.8800964355469,
        "y2": 513.7310180664062
      },
      "text": "5.4 Battery Life"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.36800003051758,
        "x2": 294.04876708984375,
        "y1": 657.6569213867188,
        "y2": 707.3469848632812
      },
      "text": "While we chose to focus our contribution on the stimulation side of our device, which is entirely novel, the sensing side is important to close the loop between odor-sensing and stimulation. There is a wide range of approaches that previous engineers and researchers have devised to sense the intensity of a gas, such as methane, in"
    }, {
      "page": 5,
      "region": {
        "x1": 317.6860046386719,
        "x2": 558.3688354492188,
        "y1": 248.66392517089844,
        "y2": 298.3550109863281
      },
      "text": "the air. The most popular approach is to use metal oxide sensors (often also referred to as combustible gas detector) to determine the location of a gas source [8, 48, 49, 57]. Additionally, researchers have employed gas sensors in wearables, such as wristbands, for personal air quality monitoring [34, 35, 43]."
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.4367065429688,
        "y1": 303.45892333984375,
        "y2": 407.9440002441406
      },
      "text": "As such, to complement our device and to demonstrate it in a closed-loop fashion, we replicated the sensor design of Kohnotoh and Ishida’s ASNose [29], using two 3.0 V pumps (SC3101PW) and two metal-oxide sensors (MiCS-5524); this configuration is referred to as an “active stereo nose” as it detects the gas’s direction (i.e., to the left or to the right) by comparing intensity of the readings on both sensors. We sample the metal-oxide sensors systems using a RedBear DUO BLE microprocessor. The gas’ direction and intensity are sent directly from the sensor-device to our intra-nasal device with Bluetooth."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0491638183594,
        "y1": 630.0111083984375,
        "y2": 649.81298828125
      },
      "text": "5.5 Pairing Our Device With An Existing Stereo Gas Sensing Device"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.5862426757812,
        "y1": 471.5919189453125,
        "y2": 543.2000122070312
      },
      "text": "Our first study aims to understand the relationship between the stimulation parameters and the perceived direction and intensity. We hypothesize that different stimulation patterns result in different trigeminal sensations. Our study was approved by our Institutional Review Board (IRB20-0308). User Study 1 and 2 were completed before our device implementation, as we used these studies to inform the stimulator’s design."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 547.5587768554688,
        "y1": 430.99407958984375,
        "y2": 463.74798583984375
      },
      "text": "6 USER STUDY 1: INTENSITY & DIRECTION USING ELECTRICAL TRIGEMINAL STIMULATION"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7212524414062,
        "y1": 580.9449462890625,
        "y2": 674.4710083007812
      },
      "text": "A simplified version of our wearable device was used. Participants wore a 3D-printed nose clip with Ag-AgCl electrodes (same as used in our final device), but this time connected to a Hasomed RehaMove 3, a medically compliant functional electric stimulator. We used this stimulator as it allowed us to vary all possible waveform parameters prior to designing our own device based on the study findings. Once we found the relevant waveform parameters from this study, we started the design of our own stimulator to support those waveforms."
    }, {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.200927734375,
        "y1": 679.574951171875,
        "y2": 707.3469848632812
      },
      "text": "Prior to the start of the study, we asked participants to insert the nose clip into their nose such that the bridge was flush against the bottom of the nose and the pressure felt even across the septum."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 394.28594970703125,
        "y1": 566.2501220703125,
        "y2": 573.1010131835938
      },
      "text": "6.1 Apparatus"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.58673095703125,
        "y1": 263.8809509277344,
        "y2": 357.4070129394531
      },
      "text": "Since our study was the first to explore the sensations that arise from electrical stimulation across the septum, we aimed to vary as many waveform parameters as possible to maximize our insights into this novel modality. Following, we varied the three parameters of a typical squared stimulation waveform: (1) pulse width, (2) polarity, and (3) phase order. We fixed the frequency of stimulation at 62 Hz and the intensity of each pulse was at 1 mA, within the range of noticeable yet pain-free electrical stimulation as shown in [21]."
    }, {
      "page": 6,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.0476989746094,
        "y1": 362.51092529296875,
        "y2": 390.28399658203125
      },
      "text": "Pulse width:We utilized pulse widths of 100 µs, 250 µs, and 500 µs for each pulse phase. All 0mA phases were reduced to a pulse width of 0µs to avoid redundancy."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04833984375,
        "y1": 395.387939453125,
        "y2": 445.0790100097656
      },
      "text": "Waveform polarity: We designed our study around the two traditional types of electrical stimulation waveforms, which are depicted in Figure 6 (a) monophasic (only one polarity, as in DC currents); or, (b) biphasic (i.e., current switches direction, as in AC currents)."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.4239501953125,
        "y1": 450.18292236328125,
        "y2": 477.9549865722656
      },
      "text": "Phase order: Additionally, the phase order was variable, e.g. positive first or negative first, which is depicted in Figure 6 (a) and Figure 6 (b) respectively."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0470275878906,
        "y1": 483.0589294433594,
        "y2": 521.791015625
      },
      "text": "Thus, all combinations of the parameters above result in a total of 25 different waveforms (the total was in fact 75, but to avoid redundant stimulations, we removed all waveforms that starts with a pulse of 0 mA intensity)."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 159.26718139648438,
        "y1": 249.18704223632812,
        "y2": 256.0379638671875
      },
      "text": "6.2 Stimulus Design"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.55609130859375,
        "y1": 553.9199829101562,
        "y2": 581.6929931640625
      },
      "text": "Each participant performed a total of 75 trials: 25 possible waveforms x 3 repetitions. Waveforms were presented in a randomized order across participants."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.6502990722656,
        "y1": 586.7959594726562,
        "y2": 647.4459838867188
      },
      "text": "Per each trial, participants felt one brief electrical trigeminal stimulation (out of the possible 25), delivered to across their nasal septum. Each stimulation contained a sequence of 20 impulses, lasting a total of 322 ms. After each trial, participants rated the stimulation intensity (1=“did not feel”; 7=“most intense”) and direction (-3=left; +3=right) using 7-point Likert scales."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 211.60903930664062,
        "y1": 539.22509765625,
        "y2": 546.0759887695312
      },
      "text": "6.3 Trial design and Procedure"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.42462158203125,
        "y1": 679.574951171875,
        "y2": 707.3469848632812
      },
      "text": "We recruited 10 participants from our local institution (4 women, 5 men, and 1 non-binary person) aged 20-25 years old (M=22.7, SD=1.9). Participants received 25 USD compensation for their time."
    }, {
      "page": 6,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7156372070312,
        "y1": 250.18296813964844,
        "y2": 321.7909851074219
      },
      "text": "Participants were given the Nasal Obstruction Symptom Evaluation (NOSE) 5-point Likert Scale [54] at the start. With it we confirmed that no participant had nasal congestions or stuffiness (M=0.5, SD=0.53), blockages or obstruction (M= 0.2, SD=0.42), trouble breathing through nose (M=0.5, SD=0.53), trouble sleeping (M=0.5, SD=0.53), or difficulty breathing through their nose during exercise or exertion (M=0.1, SD=0.32)."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.798004150390625,
        "x2": 138.51808166503906,
        "y1": 664.880126953125,
        "y2": 671.7310180664062
      },
      "text": "6.4 Participants"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7186279296875,
        "y1": 378.20391845703125,
        "y2": 427.8940124511719
      },
      "text": "Towards our results, we describe the aggregated electrical properties of our waveforms using two existing metrics, which are exemplified in Figure 7 the total electrical charge, which represents the sum of all charges over time regardless of sign; and the net electrical charge, which represents the charge imbalance."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 500.2242431640625,
        "y1": 350.5580749511719,
        "y2": 370.3599853515625
      },
      "text": "6.5 Metrics for Analyzing Electrical Waveforms"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.7161254882812,
        "y1": 472.085693359375,
        "y2": 575.8410034179688
      },
      "text": "6.6.1 We conducted a one-way MANOVA and used Bonferronicorrected t-tests. Figure 8 depicts ratings for (a) lateralization and (b) intensity for all 25 pulse candidates. First, we examined the perception of the intensity of the stimulation for the different waveforms. We found a statistically significant effect of total electrical charge on reported intensity [F(7,719)=10.5, p=1.2e-12]. Of the eight total electrical charges, all were statistically significant, except for 250 mAµs and 500 mAµs. This suggests that, as total charge increases, we tend to observe an increase in perceived intensity, as depicted in Figure 9"
    }, {
      "page": 6,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.72119140625,
        "y1": 580.9449462890625,
        "y2": 652.552978515625
      },
      "text": "Secondly, we examine the perception of direction (also known as trigeminal lateralization). We found a statistically significant effect of net electric charge on reported lateralization [F(10,719)=16.8, p<2.2e-16], as shown in Figure 10 (a). Of the 11 possible net charge values, all were statistically significant, except for -100 mAµs, 0 mAµs, and 100 mAµs; suggesting that net charge influences perceived lateralization."
    }, {
      "page": 6,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.2052001953125,
        "y1": 657.6569213867188,
        "y2": 707.3469848632812
      },
      "text": "Additionally, we found that the phase order (whether the pulse began with a negative or positive stimulation) also had a significant effect on perceived lateralization [F(1,719)=41.3, p=2.3e-10]. As depicted in Figure 10 (b), pulses beginning with a positive phase were typically perceived as right-sided stimulus."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 379.1768493652344,
        "y1": 456.6611022949219,
        "y2": 463.51202392578125
      },
      "text": "6.6 Results"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 342.74102783203125,
        "x2": 517.908447265625,
        "y1": 521.297119140625,
        "y2": 528.1480102539062
      },
      "text": "Multiple Intensities And Directions"
    }, {
      "page": 7,
      "region": {
        "x1": 317.6860046386719,
        "x2": 558.2025146484375,
        "y1": 535.9920043945312,
        "y2": 563.7640380859375
      },
      "text": "To make use of our findings we chose nine pulses that allow us to render three intensity levels (low, middle, high) and three directions (left, center, right), which are depicted in Figure 11"
    }, {
      "page": 7,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.1865844726562,
        "y1": 568.8679809570312,
        "y2": 640.4769897460938
      },
      "text": "The final set of waveforms is: at a low intensity (-1, 250), (1, 250) for left; (-1, 100), (0, 0) for center; and (-1, 100), (1, 100) for right; at amedium intensity (-1, 250), (0, 0) for left; (1, 100), (-1, 250) for center; and (-1, 100), (1, 250) for right; lastly, at a high intensity (-1, 500), (0, 0) for left; (-1, 500), (1, 500) for center; and (1, 500), (-1, 100) for right. Next, we will put these waveforms to an actual test in our User Study 2."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.95501708984375,
        "x2": 517.940673828125,
        "y1": 508.3460998535156,
        "y2": 515.197021484375
      },
      "text": "6.7 Resulting Waveforms That Achieve"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.6409912109375,
        "x2": 558.436279296875,
        "y1": 679.574951171875,
        "y2": 707.3469848632812
      },
      "text": "All participants commented being interested in and entertained by the sensation; no pain was reported by any participant. P6 reported a watery nasal drip and had to blow their nose. This was consistent"
    }, {
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.55792236328125,
        "y1": 497.04193115234375,
        "y2": 535.7739868164062
      },
      "text": "with the type of dripping that occurs when eating trigeminal stimulants in food, such as in spicy food [45]. The drip ended as soon as the study was completed, and no other participants reported similar experiences."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 446.3768615722656,
        "y1": 664.880126953125,
        "y2": 671.7310180664062
      },
      "text": "6.8 Qualitative Feedback"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.37628173828125,
        "y1": 602.8619384765625,
        "y2": 707.3469848632812
      },
      "text": "In our first study, we found the waveform parameters that allow us to render the intensity and direction of an odor via electrical trigeminal stimulation. As such, in our second study, we aimed to determine whether participants new to this modality, could make use of these trigeminal cues to locate an odor source. As such, our study’s objective was explorative: we were not aiming to show which condition improved gas source localization, but instead were interested in seeing whether localization using electrical trigeminal stimulation had similarities to how we ordinarily navigate gas sources."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 285.9873352050781,
        "y1": 575.2161254882812,
        "y2": 595.0189819335938
      },
      "text": "7 USER STUDY 2: FINDING AN ODOR USING OUR (ELECTRICAL) STEREO-SMELL"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7136840820312,
        "y1": 510.7409362792969,
        "y2": 626.1849975585938
      },
      "text": "Participants explored a simplified, virtual reproduction of the testing space using a Wireless HTC Vive, headphones, and the same stimulator and nose clip from our previous study. The tracking area was approximately 5 x 5 meters, and this study was conducted in the same location as our previous study. The virtual space and VR headset served as a “blindfold” so that the participant was unable to see where the odor source was placed but would be alerted by the headset to walls as they approached them. Our experiment was conducted in a ventilated laboratory, with one perforated duct ventilation (500 CFM) and two fume hoods. The ambient temperature was kept at 24{°}C."
    }, {
      "page": 8,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.4326782226562,
        "y1": 631.2889404296875,
        "y2": 691.93798828125
      },
      "text": "A fan was placed at a 45-degree angle, approximately 2.5 meters away from the participant at one of 3 pre-selected locations. Using an anemometer, the fan’s wind speed was 2.7 m/s at 5 cm away from the fan and 0 m/s after 50 cm. From pilot studies, participants were not able to feel the tactile stimulation of the fan, and as the fan produced no measurable wind space after 50 cm, unintentional"
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.047119140625,
        "y1": 87.79393005371094,
        "y2": 104.60797119140625
      },
      "text": "tactile stimulation from the fan was ruled out as a confounding factor in navigating the odor field."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.95501708984375,
        "x2": 394.28594970703125,
        "y1": 496.04608154296875,
        "y2": 502.8970031738281
      },
      "text": "7.1 Apparatus"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.555908203125,
        "y1": 134.43492126464844,
        "y2": 151.2490234375
      },
      "text": "Participants were presented with two possible conditions: navigating a real or virtual odor field."
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2756652832031,
        "y1": 162.6459197998047,
        "y2": 256.1719970703125
      },
      "text": "7.2.1 Real Odor Field. In the real odor field condition, a small cup filled with a 50% v/v peppermint essential oil in ethanol solution is placed behind the fan to inject a steady stream of mint/menthol throughout the task. The participant was asked to localize the source with their sense of smell, while wearing the nose clip but not receiving any stimulation. Note that adding a real odor field condition setup was not unique to our study design, as this setup is often used in gas source localization studies, which typically involve gas searching robots [7]."
    }, {
      "page": 9,
      "region": {
        "x1": 53.57400131225586,
        "x2": 295.5635986328125,
        "y1": 267.5679016113281,
        "y2": 470.6839904785156
      },
      "text": "7.2.2 Virtual Odor Field. The participant was asked to localize the virtual odor source using the trigeminal stimulation. In this virtual odor field condition, as there was no odor. Instead, we simulated a turbulent virtual odor field in a simulated laboratory space matching ours as closely as possible. We did this to exclude any potential confounds from tracking odor sources using external sensors, all of which have tracking errors that are not what we are interested in measuring. On the contrary, simply guiding participants via perfect left/right cues to the source is unrealistic as odors move fluidly and turbulently through air, and as we smell around in the real world we also deal with these turbulences. As such, a simulated odor field with turbulences proved the best setting to gather a realistic understanding of our device. Adding these turbulences allowed us to make the conditions more comparable. The inclusion of a simulated odor field condition is also not unique to our study design, previous olfactory work has leveraged CFD for modeling virtual conditions: \"[CFD] enables us to have the dynamic odor concentration distribution even if we have complicated obstacles in the virtual environment\" [41]."
    }, {
      "page": 9,
      "region": {
        "x1": 53.48400115966797,
        "x2": 295.56158447265625,
        "y1": 475.7879333496094,
        "y2": 656.9849853515625
      },
      "text": "To simulate the virtual odor field, we used ANSYS, a computational fluid dynamics (CFD) software, to mimic as many parameters as possible from a real odor field: (1) we added turbulent air sources from the fan, HVAC, and participant movements in the space; (2) we added the odor’s dynamic viscosity, which was estimated by that of liquid ethanol at 24{°}C and 1 bar, approximately 1.1 cP. The simulation’s timestep results (around 41M air flow intensity samples from ANSYS) were then exported, segmented using a simple Bounding Volumes Hierarchy algorithm, and imported into Unity3D. From Unity3D, a script simulates the detection of the odor, comparing the odors concentration captured in two Unity3D colliders, one for each nostril. To emulate the tidal breathing, each collider is approximately 0.25 L in volume. We then separately sum the concentrations of any odor samples within the colliders for each nostril to get estimated inhaled odor concentrations. The estimated intensity of the odors uses the following equation based on Murphy’s results for varying menthol concentrations [40],"
    }, {
      "page": 9,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.37957763671875,
        "y1": 647.9259643554688,
        "y2": 707.3469848632812
      },
      "text": "i = 2.5 × ( c 1.7 )0.617 where i is the estimated intensity and c is the total inhaled menthol concentration. Additionally, we cut off any concentrations below"
    }, {
      "page": 9,
      "region": {
        "x1": 317.7489929199219,
        "x2": 558.2037353515625,
        "y1": 87.79393005371094,
        "y2": 104.60797119140625
      },
      "text": "1.4e-3 ppm to reflect human odor detection threshold of menthol [11]."
    }, {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7163696289062,
        "y1": 109.71195983886719,
        "y2": 203.23797607421875
      },
      "text": "Finally, we map the estimated intensity to three intensity levels for stimulation obtained in our User Study 1 (see Figure 11). Estimated intensities under 3 were mapped to the low intensity stimulations. Estimated intensities between 3 and 6 were mapped to medium intensity. Finally, estimated intensities above 6 were mapped to high intensity. The Unity3D script then stimulates the participant’s nose 24 times per minute with a short trigeminal cue. Our CFD simulation and study scripts are provided to assist with replication of our study1"
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 133.4562530517578,
        "y1": 119.7410659790039,
        "y2": 126.59197998046875
      },
      "text": "7.2 Conditions"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7135620117188,
        "y1": 232.7499237060547,
        "y2": 249.56402587890625
      },
      "text": "Participants performed a total of four trials: 2 conditions x 2 repetitions; the order of trials was randomized."
    }, {
      "page": 9,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.720947265625,
        "y1": 254.66795349121094,
        "y2": 326.2760009765625
      },
      "text": "Per trial, participants were asked to navigate the room and identify where the odor source (either real or virtual) was by declaring when they finished and standing at the estimated location. The examiner then measured the distance between the user and the target. Participants were given 5 minutes to complete the task, and–at the end of the allocated time–were given a few seconds to make a forced choice."
    }, {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8095092773438,
        "y1": 331.3799133300781,
        "y2": 370.11199951171875
      },
      "text": "Most importantly, we designed this procedure to have no training. We never shown the stimulation to the participants beforehand nor there were any “habituation trials” or explanations. We just let them locate the odor."
    }, {
      "page": 9,
      "region": {
        "x1": 317.6860046386719,
        "x2": 558.20556640625,
        "y1": 381.1939392089844,
        "y2": 485.6789855957031
      },
      "text": "7.3.1 Deodorization. After each trial, the participant was asked to take a 12-minute break outside of the testing room. During this time, the examiner deodorized the space. For odor control with ozone oxidation, we used a portable ozone generator that outputs 50 mg/h. To comply with OSHA exposure limits in a workspace (0.2 ppm for no more than 2 hours exposure [30]), we only emit 10 mg of ozone for the entirety of a study with one participant (not counting the ventilation). Following, the ozone generator is placed at the gas source location and turned on for only 6 minutes (5 mg of ozone) after real odor field condition trials."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 440.3113708496094,
        "y1": 218.05606079101562,
        "y2": 224.906982421875
      },
      "text": "7.3 Task and Procedure"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.7194213867188,
        "y1": 515.1909790039062,
        "y2": 707.3469848632812
      },
      "text": "We recruited four participants from our institution (two selfidentified as women and two as men) aged 20-40 years old (M=30.3, SD=6.55). Participants were given an intake form at the start of the study. Of the four participants, three participants reported using VR before and one reported experiencing VR with smell before. Participants were given the Nasal Obstruction Symptom Evaluation (NOSE) 5-point Likert Scale [54] at the start. With it we confirmed that no participant had nasal congestions or stuffiness (M=0.5, SD=0.58), blockages or obstruction (M= 0.25, SD=0.5), trouble breathing through nose (M=0.5, SD=0.58), trouble sleeping (M=0.75, SD=0.96), or difficulty breathing through their nose during exercise or exertion (M=0, SD=0). Additionally, we asked that participants estimate how well they detect odors in their daily lives: of the 4 participants, 2 reported normal smell function, 1 reported higher sensitivity, and 1 reported not detecting odors frequently. Finally, we asked participants to rate how often they experienced a runny nose after eating spicy food on a 5-point Likert Scale, which they reported experiencing every so often (M=2.25, SD=1.26)."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 402.67498779296875,
        "y1": 500.4960632324219,
        "y2": 507.34698486328125
      },
      "text": "7.4 Participants"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2123718261719,
        "y1": 272.9469299316406,
        "y2": 333.59600830078125
      },
      "text": "Considering the small sample size (N=4), we opted to discuss the measured data without invoking statistical tests. Our results are depicted in in Figure 1. We observed that even without any training or calibration phase participants in the virtual condition halved their average distance (m) to the target (M=0.631, SD=0.337) compared to the real condition (M=1.20, SD=0.585)."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 115.0198745727539,
        "y1": 258.2521057128906,
        "y2": 265.10302734375
      },
      "text": "7.5 Results"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.55914306640625,
        "y1": 372.15093994140625,
        "y2": 553.3489990234375
      },
      "text": "Of the four participants, only one reported experiencing some nasal drip after one virtual odor trial. Participants reported that the electrical stimulation was clear and easy to use. P1 and P2 shared that their confidence locating the virtual odor field was much higher than when locating real odors. Similarly, P3 describes the electrical stimulation as “strong, loud and clear,” and P1 refers to the experience as “clear zaps”. Most participants reported that the electrical stimulation felt like a new sensation (P1, P3). Participants were able to distinguish levels of intensity and direction at different rates: P3 specifically mentioned the directional sensation and P2 reported distinguishing two intensities as well as two “nostril type stimuli”; P2 shared that they wished the stimulation were more constant, which is why our final device is tied with the user’s breathing cycle. Finally, most participants reported interest or excitement about the sensation (P1, P2, P4), though P2 shared that the stimulation in fact made them want to avoid the smell instead of pursuing it but did find the experience fun."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.797996520996094,
        "x2": 182.21994018554688,
        "y1": 357.45709228515625,
        "y2": 364.3080139160156
      },
      "text": "7.6 Qualitative Feedback"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.0315856933594,
        "y1": 591.9029541015625,
        "y2": 707.3469848632812
      },
      "text": "As we observed in our second study, users are able to make use of our device to locate smells without any training, we expect this to be the case as these sensations are similar to those elicited by the trigeminal nerve upon chemical or thermal stimulation (e.g., eating spicy food or inhaling cold air), which previous research has shown to be easily lateralizable. Additionally, we believe this contributes to the potential success of the system’s olfactory substitution, as users would not need a long learning phase to use the directional sensation’s information. This is in stark contrast to other types of sensory substitutions – such as that of the tongue display unit [2]– which require careful training to make sense of the new mapping."
    }, {
      "page": 10,
      "region": {
        "x1": 317.7309875488281,
        "x2": 558.4366455078125,
        "y1": 259.2479553222656,
        "y2": 341.8160095214844
      },
      "text": "As P1 reported, the sensation is unique and does not feel like smell (echoing results from prior papers such as [59]). This may be due to the waveforms not being designed to elicit more subtle stimulation (as 1 mA is already perceived quite intensely [21]), no variation during a stimulation itself, and because the RehaMove 3 does not provide stimulation in phase with inhalation nor varies stimulation based on the participant’s sniff strength (e.g., P2 desiring a “more constant” stimulation)."
    }, {
      "page": 10,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.1926879882812,
        "y1": 346.919921875,
        "y2": 429.48699951171875
      },
      "text": "P3’s comment regarding “two nostril type stimuli” may stem from the limitation in our first user study. Although we characterize relationships for intensity and lateralization with total and net charge, stimulations have perceivably different trigeminal qualities (e.g., prickling, warm, tickling, pressure, etc.). Following, despite the virtual odor field getting rendered for intensity and lateralization, the virtual odor’s quality may be non-uniform as the participant navigates the plume."
    }, {
      "page": 10,
      "region": {
        "x1": 317.7309875488281,
        "x2": 558.3693237304688,
        "y1": 434.5909423828125,
        "y2": 484.281005859375
      },
      "text": "Most participant’s confidence in the stimulation may come from the fact that they are experiencing verbalizable stereo-smell via electrical stimulation or may be due to clear differences between intensity levels and lateralization directions (as compared to smaller variations with the real odor)."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 131.8199005126953,
        "y1": 577.2091064453125,
        "y2": 584.0599975585938
      },
      "text": "7.7 Discussion"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.1917724609375,
        "y1": 526.1499633789062,
        "y2": 707.3469848632812
      },
      "text": "Smell is often leveraged in the detection of hazardous situations, such as expired food or chemical risks. Unfortunately, an individual with anosmia (loss of olfactory function) cannot detect gas, smoke, or fire through their sense of smell [3, 42]. In Keller and Malaspina’s reports, 72% of their subjects reported fearing exposure to dangers due to their olfactory dysfunction [26]. The main concern was the inability to detect a fire, volatile compounds, or a gas leak. (The later stems from people with anosmia not being able to smell the compound–methyl mercaptan–added to odorize natural gas, which is normally odorless.) Bonfils et al. reported similar results from incidents with their survey population [4]. 63% regularly burned their food, 47% had incidents where they did not detect a gas leak, and 26% had not detected active fires. These consequences ripple across many aspects of a person’s lives such as active avoidance of housing with natural gas, food poisoning, prolonged exposure to hazardous volatile chemicals, reduced quality of life from lack of flavor, and more."
    }, {
      "page": 11,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.42498779296875,
        "y1": 87.79393005371094,
        "y2": 247.072998046875
      },
      "text": "In contrast to their olfactory dysfunction, people with anosmia often retain trigeminal function, though it may be dampened in sensitivity [14, 15]. Our device may serve as an assistive technology for people with anosmia, as it can enable them to sense gases in the air. The specificity of the gaseous response is directly tied to the sensor, and the commercially cheap option (metal oxide sensors) often detect smoke and natural gas at incredibly low concentrations. If using a stereo sensing system, people with anosmia may use our device to also lateralize the direction of the gas and navigate towards the odor source to hopefully prevent potential harm from exposure. Though our device may serve as a technical foundation to achieve trigeminal-based stereo-smell, additional research on the design space of trigeminal stimulation and co-design with people with anosmia is necessary to further validate our system as an assistive tool."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 543.1077880859375,
        "y1": 498.50408935546875,
        "y2": 518.3060302734375
      },
      "text": "8 POTENTIAL BENEFITS AS AN ASSISTIVE DEVICE"
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5624084472656,
        "y1": 275.8879089355469,
        "y2": 358.45599365234375
      },
      "text": "In this paper, we proposed, explored, and engineered a novel type of olfactory device that creates a stereo-smell experience, i.e., directional information about the location of an odor, by rendering the readings of external odor sensors as trigeminal sensations using electrical stimulation of the user’s nasal septum. Our device outputs by stimulating the user’s trigeminal nerve using electrical impulses with variable pulse-widths; and it inputs by sensing the user’s inhalations using a photoreflector."
    }, {
      "page": 11,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.5867004394531,
        "y1": 363.5599365234375,
        "y2": 424.2090148925781
      },
      "text": "In our first user study, we found the key electrical waveform parameters that enable users to feel an odor’s intensity (absolute electric charge) and direction (phase order and net charge). In our second study, we demonstrated that participants could immediately make use of these stimulations to find a target (a virtual odor) without any previous training with it."
    }, {
      "page": 11,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.56390380859375,
        "y1": 429.31292724609375,
        "y2": 479.0039978027344
      },
      "text": "We believe this opens exciting new interactive uses. Most importantly, we believe this device is useful for users with loss of smell (anosmia) because our technique relies on electrical stimulation of the trigeminal nerve, and not on stimulation of the olfactory bulb; as such it is expected to work for most people with anosmia."
    }, {
      "page": 11,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.2123107910156,
        "y1": 484.1079406738281,
        "y2": 555.7160034179688
      },
      "text": "Moreover, while we think of our device as a sensory substitution device to create a proxy of smell sensations, other researchers might be inspired to use it for more general interactive uses, for example to build new types of haptic interfaces. For instance, feeling navigation cues, such as walking directions as though one were “smelling their way home.” Finally, we expect researchers to explore combinations of our device with chemical stimulation of the olfactory bulb."
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 242.67816162109375,
        "y1": 261.1940612792969,
        "y2": 268.04498291015625
      },
      "text": "9 CONCLUSIONS & FUTUREWORK"
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 57.04100036621094,
        "x2": 294.0443420410156,
        "y1": 582.8430786132812,
        "y2": 587.3970336914062
      },
      "text": "[1] Al Aïn, S. and Frasnelli, J.A. 2017. Intranasal Trigeminal Chemoreception. Conn’s"
    }, {
      "page": 11,
      "region": {
        "x1": 57.04100036621094,
        "x2": 294.8101806640625,
        "y1": 590.8131103515625,
        "y2": 603.3380126953125
      },
      "text": "Translational Neuroscience. Elsevier. 379–397. [2] Bach-y-Rita, P. and W. Kercel, S. 2003. Sensory substitution and the human–"
    }, {
      "page": 11,
      "region": {
        "x1": 57.04099655151367,
        "x2": 295.22332763671875,
        "y1": 606.7540893554688,
        "y2": 713.259033203125
      },
      "text": "machine interface. Trends in Cognitive Sciences. 7, 12 (Dec. 2003), 541–546. DOI: https://doi.org/10.1016/j.tics.2003.10.013. [3] Blomqvist, E.H. et al. 2004. Consequences of olfactory loss and adopted coping strategies. Rhinology. 42, 4 (Dec. 2004), 189–194. [4] Bonfils, P. et al. 2008. Accidents domestiques chez 57 patients ayant une perte sévère de l’odorat. La Presse Médicale. 37, 5 (May 2008), 742–745. DOI: https: //doi.org/10.1016/j.lpm.2007.09.028. [5] Brand, G. 2006. Olfactory/trigeminal interactions in nasal chemoreception. Neuroscience & Biobehavioral Reviews. 30, 7 (2006), 908–917. DOI: https://doi.org/10. 1016/j.neubiorev.2006.01.002. [6] Brooks, J. et al. 2020. Trigeminal-based Temperature Illusions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’20). (2020). [7] Burgués, J. et al. 2019. Smelling Nano Aerial Vehicle for Gas Source Localization and Mapping. Sensors. 19, 3 (Jan. 2019), 478. DOI: https://doi.org/10.3390/"
    }, {
      "page": 11,
      "region": {
        "x1": 321.197998046875,
        "x2": 558.198974609375,
        "y1": 89.0950927734375,
        "y2": 101.6190185546875
      },
      "text": "s19030478. [8] Burgués, J. and Marco, S. 2018. Low Power Operation of Temperature-Modulated"
    }, {
      "page": 11,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.3829345703125,
        "y1": 105.03509521484375,
        "y2": 699.3770141601562
      },
      "text": "Metal Oxide Semiconductor Gas Sensors. Sensors. 18, 2 (Jan. 2018), 339. DOI: https://doi.org/10.3390/s18020339. [9] Cheok, A.D. and Karunanayaka, K. 2018. Virtual Taste and Smell Technologies for Multisensory Internet and Virtual Reality. Springer International Publishing. [10] Choi, M.H. et al. 2018. Wearable Olfactory Augmentation Device for Hazardous Gas Detection. 2018 Design of Medical Devices Conference (Minneapolis, Minnesota, USA, Apr. 2018), V001T10A014. [11] Cometto-Muñiz, J.E. and Cain,W.S. 1990. Thresholds for odor and nasal pungency. Physiology & Behavior. 48, 5 (Nov. 1990), 719–725. DOI: https://doi.org/10.1016/ 0031-9384(90)90217-R. [12] Croy, I. et al. 2014. Human olfactory lateralization requires trigeminal activation. NeuroImage. 98, (Sep. 2014), 289–295. DOI: https://doi.org/10.1016/j.neuroimage. 2014.05.004. [13] Findler, G. and Feinsod, M. 1982. Sensory evoked response to electrical stimulation of the trigeminal nerve in humans. Journal of Neurosurgery. 56, 4 (Apr. 1982), 545–549. DOI: https://doi.org/10.3171/jns.1982.56.4.0545. [14] Frasnelli, J. et al. 2006. Chemosensory specific reduction of trigeminal sensitivity in subjects with olfactory dysfunction. Neuroscience. 142, 2 (Oct. 2006), 541–546. DOI: https://doi.org/10.1016/j.neuroscience.2006.06.005. [15] Frasnelli, J. et al. 2007. Interactions between Olfaction and the Trigeminal System: What Can Be Learned from Olfactory Loss. Cerebral Cortex. 17, 10 (Oct. 2007), 2268–2275. DOI: https://doi.org/10.1093/cercor/bhl135. [16] Frasnelli, J. et al. 2004. Responsiveness of human nasal mucosa to trigeminal stimuli depends on the site of stimulation. Neuroscience Letters. 362, 1 (May 2004), 65–69. DOI: https://doi.org/10.1016/j.neulet.2004.02.059. [17] Fujino, Y. et al. 2019. Odor Modulation by Warming/Cooling Nose Based on Cross-modal Effect. 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR) (Mar. 2019), 929–930. [18] Hariri, S. et al. 2016. Electrical stimulation of olfactory receptors for digitizing smell. Proceedings of the 2016 workshop on Multimodal Virtual and Augmented Reality - MVAR ’16 (Tokyo, Japan, 2016), 1–4. [19] Holbrook, E.H. et al. 2019. Induction of smell through transethmoid electrical stimulation of the olfactory bulb: Induced smell through electrical stimulation. International Forum of Allergy & Rhinology. 9, 2 (Feb. 2019), 158–164. DOI: https: //doi.org/10.1002/alr.22237. [20] Hummel, T. et al. 1998. Chemosensory event-related potentials change with age. Electroencephalography and Clinical Neurophysiology/Evoked Potentials Section. 108, 2 (Mar. 1998), 208–217. DOI: https://doi.org/10.1016/S0168-5597(97)00074-9. [21] Iannilli, E. et al. 2008. Trigeminal activation using chemical, electrical, and mechanical stimuli: Pain. 139, 2 (Oct. 2008), 376–388. DOI: https://doi.org/10.1016/j. pain.2008.05.007. [22] Ishimaru, T. et al. 1997. Olfactory Evoked Potential Produced by Electrical Stimulation of the Human Olfactory Mucosa. Chemical Senses. 22, 1 (1997), 77–81. DOI: https://doi.org/10.1093/chemse/22.1.77. [23] Kaczmarek, K.A. et al. 1994. Electrotactile haptic display on the fingertips: preliminary results. Proceedings of 16th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (Baltimore, MD, USA, 1994), 940–941. [24] Kajimoto, H. 2012. Electrotactile Display with Real-Time Impedance Feedback Using Pulse Width Modulation. IEEE Transactions on Haptics. 5, 2 (Apr. 2012), 184–188. DOI: https://doi.org/10.1109/TOH.2011.39. [25] Kajimoto, H. et al. 2003. SmartTouch - augmentation of skin sensation with electrocutaneous display. 11th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2003. HAPTICS 2003. Proceedings. (Los Angeles, CA, USA, 2003), 40–46. [26] Keller, A. and Malaspina, D. 2013. Hidden consequences of olfactory dysfunction: a patient report series. BMC Ear, Nose and Throat Disorders. 13, 1 (Dec. 2013), 8. DOI: https://doi.org/10.1186/1472-6815-13-8. [27] Kobal, G. et al. 1989. Is there directional smelling? Experientia. 45, 2 (Feb. 1989), 130–132. DOI: https://doi.org/10.1007/BF01954845. [28] Kodama, R. et al. 2019. Evaluation on Context Recognition Using Temperature Sensors in the Nostrils. Sensors. 19, 7 (Mar. 2019), 1528. DOI: https://doi.org/10. 3390/s19071528. [29] Kohnotoh, A. and Ishida, H. 2008. Active Stereo Olfactory Sensing System for Localization of Gas/Odor Source. 2008 Seventh International Conference on Machine Learning and Applications (San Diego, CA, USA, 2008), 476–481. [30] Ku, J. 2008. Ozone in Workplace Atmospheres. Technical Report #ID-214. OSHA Salt Lake Technical Center. [31] Lee, J. et al. 2017. Itchy Nose: Discreet Gesture Interaction Using EOG Sensors in Smart Eyewear. Proceedings of the 2017 ACM International Symposium onWearable Computers (New York, NY, USA, 2017), 94–97. [32] Lundstrom, J. and Hummel, T. 2006. Sex-specific hemispheric differences in cortical activation to a bimodal odor. Behavioural Brain Research. 166, 2 (Jan. 2006), 197–203. DOI: https://doi.org/10.1016/j.bbr.2005.07.015. [33] Lundström, J.N. et al. 2005. Sex differentiated responses to intranasal trigeminal stimuli. International Journal of Psychophysiology. 57, 3 (Sep. 2005), 181–186. DOI:"
    }, {
      "page": 12,
      "region": {
        "x1": 53.79800796508789,
        "x2": 294.04827880859375,
        "y1": 89.0950927734375,
        "y2": 101.6190185546875
      },
      "text": "https://doi.org/10.1016/j.ijpsycho.2005.01.003. [34] Maag, B. et al. 2018. W-Air: Enabling Personal Air Pollution Monitoring on"
    }, {
      "page": 12,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.2265319824219,
        "y1": 105.03509521484375,
        "y2": 420.4230041503906
      },
      "text": "Wearables. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies. 2, 1 (Mar. 2018), 1–25. DOI: https://doi.org/10.1145/3191756. [35] Mamun, M.A.A. and Yuce, M.R. 2019. Sensors and Systems for Wearable Environmental Monitoring towards IOT-enabled Applications: A Review. IEEE Sensors Journal. (2019), 1–1. DOI: https://doi.org/10.1109/JSEN.2019.2919352. [36] Matsukura, H. et al. 2017. Tracking of a Gas Plume With the Aid of Olfactory Assist Mask. IEEE Sensors Journal. 17, 16 (Aug. 2017), 5332–5340. DOI: https: //doi.org/10.1109/JSEN.2017.2721968. [37] McKemy, D.D. et al. 2002. Identification of a cold receptor reveals a general role for TRP channels in thermosensation. Nature. 416, 6876 (Mar. 2002), 52–58. DOI: https://doi.org/10.1038/nature719. [38] Meijer, P.B.L. 1992. An experimental system for auditory image representations. IEEE Transactions on Biomedical Engineering. 39, 2 (Feb. 1992), 112–121. DOI: https://doi.org/10.1109/10.121642. [39] Meredith, M. 1988. Trigeminal Response to Odors. Sensory Systems: II: Senses Other than Vision. J.M. Wolfe, ed. Birkhäuser Boston. 139–139. [40] Murphy, C. 1983. Age-related Effects on the Threshold, Psychophysical Function, and Pleasantness of Menthol. Journal of Gerontology. 38, 2 (Mar. 1983), 217–222. DOI: https://doi.org/10.1093/geronj/38.2.217. [41] Nakamoto, T. et al. 2020. Virtual environment with smell using wearable olfactory display and computational fluid dynamics simulation. 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR) (Atlanta, GA, USA, Mar. 2020), 713–720. [42] Nordin, S. et al. 2011. Effects of smell loss on daily life and adopted coping strategies in patients with nasal polyposis with asthma. Acta Oto-Laryngologica. 131, 8 (Aug. 2011), 826–832. DOI: https://doi.org/10.3109/00016489.2010.539625. [43] Piedrahita, R. et al. 2014. The next generation of low-cost personal air quality sensors for quantitative exposure monitoring. Atmospheric Measurement Techniques. 7, 10 (Oct. 2014), 3325–3336. DOI: https://doi.org/10.5194/amt-7-3325-2014. [44] Ranasinghe, N. et al. 2018. Season Traveller: Multisensory Narration for Enhancing the Virtual Reality Experience. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018), 1–13. [45] Raphael, G. et al. 1989. Gustatory rhinitis: A syndrome of food-induced rhinorrhea. Journal of Allergy and Clinical Immunology. 83, 1 (Jan. 1989), 110–115. DOI: https://doi.org/10.1016/0091-6749(89)90484-3. [46] Rawson, N. et al. 2011. Findings and recommendations from the joint NISTAGA workshop on odor masking. Journal of Research of the National Institute of Standards and Technology. 116, 6 (Nov. 2011), 839. DOI: https://doi.org/10.6028/ jres.116.026. [47] Rodríguez-Molinero, A. et al. 2013. Normal Respiratory Rate and Peripheral Blood Oxygen Saturation in the Elderly Population. Journal of the American Geriatrics"
    }, {
      "page": 12,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.1987915039062,
        "y1": 89.0950927734375,
        "y2": 101.6190185546875
      },
      "text": "Society. 61, 12 (Dec. 2013), 2238–2240. DOI: https://doi.org/10.1111/jgs.12580. [48] Rossi, M. and Brunelli, D. 2017. Gas Sensing on Unmanned Vehicles: Challenges"
    }, {
      "page": 12,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.380859375,
        "y1": 105.03509521484375,
        "y2": 410.8070068359375
      },
      "text": "and Opportunities. 2017 New Generation of CAS (NGCAS) (Genova, Italy, Sep. 2017), 117–120. [49] Sato, R. et al. 2020. Detection of Gas Drifting Near the Ground by Drone Hovering Over: Using Airflow Generated by Two Connected Quadcopters. Sensors. 20, 5 (Mar. 2020), 1397. DOI: https://doi.org/10.3390/s20051397. [50] Schaefer, M.L. et al. 2002. Trigeminal collaterals in the nasal epithelium and olfactory bulb: A potential route for direct modulation of olfactory information by trigeminal stimuli: Trigeminal Collaterals in the Nasal Epithelium and Olfactory Bulb. Journal of Comparative Neurology. 444, 3 (Mar. 2002), 221–226. DOI: https: //doi.org/10.1002/cne.10143. [51] Schneider, R. and Schmidt, C. 1967. Dependency of olfactory localization on non-olfactory cues. Physiology & Behavior. 2, 3 (Jul. 1967), 305–309. DOI: https: //doi.org/10.1016/0031-9384(67)90084-4. [52] Spence, C. et al. 2017. Digitizing the chemical senses: Possibilities & pitfalls. International Journal of Human-Computer Studies. 107, (Nov. 2017), 62–74. DOI: https://doi.org/10.1016/j.ijhcs.2017.06.003. [53] Stevenson, R.J. 2010. An Initial Evaluation of the Functions of Human Olfaction. Chemical Senses. 35, 1 (Jan. 2010), 3–20. DOI: https://doi.org/10.1093/chemse/ bjp083. [54] Stewart, M.G. et al. 2004. Development and Validation of the Nasal Obstruction Symptom Evaluation (NOSE) Scale. Otolaryngology–Head and Neck Surgery. 130, 2 (Feb. 2004), 157–163. DOI: https://doi.org/10.1016/j.otohns.2003.09.016. [55] Straschill, M. et al. 1983. Effects of electrical stimulation of the human olfactory mucosa. Applied Neurophysiology. 46, 5–6 (1983), 286–289. [56] Suzuki, C. et al. 2014. Affecting tumbler: affecting our flavor perception with thermal feedback. Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (2014), 1–10. [57] Takei, Y. et al. 2019. Development of 3D gas source localization using multicopter with gas sensor array. 2019 IEEE International Symposium on Olfaction and Electronic Nose (ISOEN) (Fukuoka, Japan, May 2019), 1–4. [58] Tezuka, M. et al. 2016. Presentation of Various Tactile Sensations Using MicroNeedle Electrotactile Display. PLOS ONE. 11, 2 (Feb. 2016), e0148410. DOI: https: //doi.org/10.1371/journal.pone.0148410. [59] Weiss, T. et al. 2016. From Nose to Brain: Un-Sensed Electrical Currents Applied in the Nose Alter Activity in Deep Brain Structures. Cerebral Cortex. 26, 11 (Oct. 2016), 4180–4191. DOI: https://doi.org/10.1093/cercor/bhw222. [60] Wu, Y. et al. 2020. Humans navigate with stereo olfaction. Proceedings of the National Academy of Sciences. 117, 27 (Jul. 2020), 16065–16071. DOI: https://doi. org/10.1073/pnas.2004642117."
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 123.21257781982422,
        "y1": 569.8361206054688,
        "y2": 576.68701171875
      },
      "text": "REFERENCES"
    }
  }]
}