{"authors": "Jason T Jacques; Ola 2019 Kristensson;  Crowdworker", "pub_date": "", "title": "Crowdworker Economics in the Gig Economy", "abstract": "The nature of work is changing. As labor increasingly trends to casual work in the emerging gig economy, understanding the broader economic context is crucial to effective engagement with a contingent workforce. Crowdsourcing represents an early manifestation of this fluid, laisser-faire, ondemand workforce. This work analyzes the results of four large-scale surveys of US-based Amazon Mechanical Turk workers recorded over a six-year period, providing comparable measures to national statistics. Our results show that despite unemployment far higher than national levels, crowdworkers are seeing positive shifts in employment status and household income. Our most recent surveys indicate a trend away from full-time-equivalent crowdwork, coupled with a reduction in estimated poverty levels to below national figures. These trends are indicative of an increasingly flexible workforce, able to maximize their opportunities in a rapidly changing national labor market, which may have material impacts on existing models of crowdworker behavior.• Human-centered computing → User studies; • Information systems → Crowdsourcing; • Social and professional topics → Economic impact.", "sections": [{"heading": "INTRODUCTION", "text": "As the nature of work has changed, an increasing proportion of the US workforce are now engaging in non-economically driven part-time work [32]. Whether or not work is \"economically driven\" is a function of the availability of work, rather than the availability of the worker; for example, medical issues, undertaking a course of study, or lack of affordable childcare that reduces availability below \"full-time\" would categorize any part-time work as \"non-economically driven\" [12]. Further, part-time workers in the emerging gig economy may be considered part of the contingent workforce. \"Contingent workers are those who don't have an implicit or explicit contract for long-term employment. \" [28] Crowdsourcing represents an early manifestation of this technologically facilitated on-demand workforce typified by the gig economy [10]. As academic discourse has focused on improving crowdsourcing models to reduce costs and increase efficiency, the socio-economic status of the workforce and the impact of these models in a expanding market of what might otherwise be undertaken as \"at-will\" employment [15] has been the subject of little direct investigation.\nThis work, analyzing the result of four surveys over a six-year period, focuses on the economic status of US-based Amazon Mechanical Turk workers in the context of national economic trends. Each survey, with approximately 3,000 unique respondents each, was conducted over the end-ofthe-year festive period for 2012 -13, 2013-14, 2016-17, and 2017-18. Our results are presented in the context of two broad economic measures, unemployment and poverty.\nWe relate employment status among our participants to broader economic trends in the market and make observations on changing worker behavior. Combining the underlying economic markers of household income and household size, we present estimated poverty rates for crowdworkers and consider how these vary in the context of broader economic trends and an expanding national labor market for technologically facilitated casual work.\nFinally, we consider the impact of these findings on existing models of crowdworker behavior with a particular focus on emerging upward pressure on income as workers are able to consider new opportunities in the broader gig economy.\nTo allow further analysis of these trends the full anonymized data-set of more than 10,000 unique respondents is available at https://doi.org/10.17863/CAM.34827", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "BACKGROUND", "text": "The gig economy is typified by technologically facilitated ondemand labor [10]. Crowdsourcing is an established mechanism for rapid recruitment and is recognized as one of the early manifestations of this sector of the economy [21,38]. Commercially, crowdsoucing represents the commoditization of labor [1]. Inconsistent income typical of this type of precarious employment [38], with limited practical regulation [13], may have potential impact on worker behavior and psychology [39].\nOne facet of research has been determining an appropriate payment for a particular crowdsourced task. The time commitment and difficulty of the task, available budget, required quality, expected turn-around time, applicable labor laws, and a sense of fairness may all be considered before selecting a price. However, without a fundamental understanding of the economic effects of this potentially mutually beneficial relationship, effective and appropriate pricing remains difficult [23]. Despite significant research carried out using crowdworkers, the underlying economics of those who choose to participate is still quite opaque [4].\nUnderstanding worker motivation has been a similar stimulus of related work. In one study the reservation wage of crowdworkers, the lowest wage at which workers will carry out the task, has been estimated to be $1.38 per hour for an on-screen target acquisition task [19]. Measuring workers' reactions to varied task motivations, Chandler and Kapelner [8] noted that workers would undertake tasks for an average hourly wage of $1.34 per hour. Despite these findings reflecting almost a decade of inflationary pressures, more recently work by Hara et al. [16] suggests that the median hourly earnings remain around $2 per hour.\nIn support of these low payments, Mason and Suri [23] suggest that most workers are not using Mechanical Turk to cover necessities, and highlight that working conditions are determined by the worker. However, Ross et al. [26] report that US-based Mechanical Turk workers in their 2008-09 surveys earn an average of $2.30 per hour, compared with the federal minimum of $7.25 per hour [37], and highlight that 14% reported using crowdwork income to cover basic needs. Their work further indicated that among Indian crowdworkers 27% use this income to cover basic needs [26]. Chen and Dolan [9] report the still higher figure of 37% of crowdworkers indicating that they use this income to pay for essential products and services, such as food and utilities.\nThe ethical position of low-wages for crowdworkers is muddied by their typical function in the academic community as research participants. The status of crowdworkers as employees and their precise rights with regard to pay is the subject of academic discourse [10,13,23]. However, from a legal standpoint, the status of Mechanical Turk workers as members of the workforce is much more concretely defined. A worker status of \"independent contractor\" is agreed and defined by the Mechanical Turk Participation Agreement [2], while the US Government Accountability Office is clear that such contractors are members of the \"contingent workers\" category [25], and are in the labor force under the Bureau of Labor Statistics definition.\nEmployment status is just one of many key economic markers. Some limited economic considerations are touched upon by Difallah et al. [11] who take a high-level view of household income, and a limited look at household size, sampling from the global population over a continuous 28-month period in their broad review of worker population dynamics and trends. Similarly, a recent report from the International Labour Organization has considered the transformative nature of online digital labor platforms in the world of work with their global survey of 3,500 crowdworkers (1,393 USbased) carried out in 2015 and 2017 [5].\nIn contrast, this work focuses on US-based crowdworkers and analyzes 11,862 responses over a six-year period, sampled at specific fixed points in time. Further, the design and scale of our work allows this data to be compared to national figures for the appropriate periods, and allows us to present our analysis in the context of national economic trends.", "n_publication_ref": 23, "n_figure_ref": 0}, {"heading": "MEASURING ECONOMIC STATUS", "text": "There are a number of commonly considered metrics to measure an individual's economic status. Two of the most broadly reported, and widely understood, are unemployment or worker status and measures of destitution or poverty. Such measures in turn encompass a broad range of metrics including how the employment itself is categorized, income levels, household size, and further how these contribute to standards of living, all in the context of the wider economy.\nIn the United States, official unemployment figures are released both monthly and annually and offer a measure of the proportion of the potential labor force who are out of work. These figures are gathered by the US Census Bureau and reported by the US Bureau of Labor Statistics (BLS) [30]. While unemployment is a widely reported economic measure, it offers only a superficial view of the economic status of an individual [39]. For example, a senior consultant between contracts might have a much more comfortable and secure economic outlook than a single parent with multiple paid occupations. Measures of income offer deeper insights into an individual's economic well-being [3].\nPoverty levels provide a scaled measure useful in assessing the impact and reality of an individual's economic status. Official figures are computed annually by the US Census Bureau, offering both a baseline value in dollars, below which households of a specified size may be considered \"in poverty\" [18], and a percentage of the population affected [35] arrived at by applying these measures to the current population estimates. To highlight those households who are \"at risk\" the Census Bureau provide additional statistics for those below 1.25× the stated poverty levels highlighting the \"near poor\" [18]. We consider both unemployment and poverty metrics in our own surveys.", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "SURVEY DESIGN", "text": "This work reports results from four surveys recording the economic status of respondents using Amazon Mechanical Turk (MTurk). Each survey, with approximately 3,000 unique respondents, captures broad economic markers and this work considers how the economic makeup of the Mechanical Turk workforce has changed over a six-year period. The surveys were carried out over the end-of-the-year festive period for 2012 -13, 2013-14, 2016-17, and 2017-18. Each survey captured approximately 2% of the estimated 150,000 US-based crowdworkers using Amazon Mechanical Turk [11], representing a sample size far in excess of the approximately 0.05% of households surveyed in the current population survey by the US Census Bureau (60,000 [30] of 126 million [34]) and used to generate the Bureau of Labor Statistics unemployment figures.\nThe surveys attempt to capture comparable data to nationally produced estimates, in a minimally invasive fashion. To maximize uptake by workers and ensure a large sample could be collected in the survey period, the survey was kept as short as possible. The first survey was made available on Amazon Mechanical Turk as a single HIT (Human Intelligence Task) and consisted of six questions:\n(1) Age: 18-24, 25-34, 35-44, 45-54, 55-64, 64+ (2) Gender: Male, Female, Unspecified (3) Education level: ISCED, 1997 [29]; 0-6 (4) Household income (thousands, USD): <20, 20-40, 40-60, 60-80, 80-100, 100+ (5) Employment status: as detailed below (6) Hours using MTurk per week: <1, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10+\nThe surveys relied on the Mechanical Turk qualification system to ensure that participants were located within the US, and, as required by Amazon's worker policy, had a minimum participation age of 18. To allow further post hoc verification of participant eligibility, and to gain potential further insights into regional variation, where possible each worker was geolocated to the state-level based on their IP address.\nEach participant was paid $0.05 USD, comparable to contemporary surveys in 2012, and this was held constant across all four surveys for consistency. While the nature of paidparticipation in an economic survey might suggest a sampling bias, previous work has established that neither income nor household size are contingent factors for engagement in Mechanical Turk tasks [11].", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "Measuring Employment Status", "text": "Accurately representing an individual's employment status can present a number of difficulties. To allow the collected data to be comparable to nationally recognized statistics we base our definition of employment on that given by the BLS.\nThe BLS, in association with the US Census Bureau, uses an extensive questionnaire involving complex skip patterns through more than 200 questions to determine employment status, recognizing that \". . . many of them [respondents] may not be sure of their actual [employment] classification when the interview is completed\" [30]. To minimize the number of questions asked, and to maximize participation, we attempted to condense this extensive interrogation and complex definition into a single question, asking participants to answer yes or no to the following:\nExcluding time on Mechanical Turk, in any one of the last four weeks have you carried out 15 or more hours of paid work, including selfemployed work?\nTo consider those who were out of work for reasons such as temporary illness or vacation, we counted those who worked in any week of the last four as employed, negating a need for follow-up questioning regarding temporary absence. Similarly, to minimize participant confusion, we required the work to be paid despite a limited number of exceptions, such as farming and working for family businesses [30]. Our use of 15 hours per week reflects the BLS requirement for such workers [30]. In the interest of comprehensively evaluating worker employment status in a single question we included the 15 hour requirement, despite the BLS acknowledgement of the small size of this sector of the workforce.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Actual Joblessness", "text": "Attempting to capture the various exceptions, exclusions, and requirements of employment offers a conservative estimate of the employed. However, this risks over-estimating the unemployment rate among survey respondents.\nTo avoid this in the 2013-14 survey we expanded our definition of employment, removing the minimum hourly requirement and instead explicitly asked how many hours were worked. To facilitate this change, in all subsequent surveys, we swapped the order of questions five and six and modified both questions as follows:\n(5) Hours using MTurk per week: <1, These changes both broadened the definition of employment to consider any paid work, erring in favour of considering participants employed rather than unemployed, and extended the range of the collected data to allow for analysis of workers using Amazon Mechanical Turk as full-timeequivalent employment.\nFor question 6, participants were only shown the second part of the question if they answered \"yes\" to the first part. This allowed the number of questions seen to be minimized, while providing a more detailed breakdown of the workers' employment status.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Improved Estimates of Economic Status", "text": "Economic status is a function not just of employment and income, but also the number of people supported by that income. To improve our estimates of economic status in the 2016-17 and later surveys we inserted an additional question, between 4 and 5, as follows:\n(x) People in household: 1, 2, 3, 4, 5, 6, 7, 8, 9 or more This change allows for much more robust estimates of poverty levels, and replicates the US Census Bureau measures of household size [35]. However, as discussed in the results, this refinement had little substantive impact on the estimated levels of poverty.\nDespite the modifications made to the survey the completion time, from accepting to submitting the task, remained brief and reasonably constant. Workers spent a mean time of 55 s (sd = 32 s) in 2012-13, 59 s (sd = 36 s) in 2013-14, 51 s (sd = 27 s) in 2016-17, and 54 s (sd = 26 s) in 2017-18.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "UNEMPLOYMENT", "text": "Measuring unemployment can be complex. The US Bureau of Labor Statistics uses a complex series of questions to distill a binary result. By their own admission, those surveyed may not know their classification at the end of this process [30]. To attempt to encapsulate the BLS definition with a single question is a significant challenge and capturing the nuances of the official definition of employment required careful consideration and a revision of our approach.\nUnemployment is distinct from joblessness. For example, someone who depends entirely on retirement income or income from a spouse and is not actively looking for work would not be considered part of the workforce and would not be considered in the official unemployment figures [30]. Crowdworkers using Amazon Mechanical Turk are classified as \"independent contractors\" by the Mechanical Turk Participation Agreement [2]. The US Government Accountability Office is clear that such contractors are members of the \"contingent workers\" category [25], and are in the labor force under the Bureau of Labor Statistics definition.\nIt could be argued, that simply by browsing the task listing on Mechanical Turk our participants are \"seeking paid employment\" and by taking our survey all respondents might be considered \"in work. \" Such a literal interpretation offers little insight into workers' general employment status, and the practical implications of workers' broader engagement in the emerging gig economy.\nTo tease-apart this distinction and capture employment status, excepting the use of a paid crowdsourcing as a platform for socio-economic research, we specifically asked participants to answer our work-status question by \"Excluding time on Mechanical Turk. . . \"\nTable 1 summarizes the estimated unemployment level for each survey. The measured unemployment rates are 5-7× higher for the surveyed workers than the nationally reported figures. However, these results indicate the same downwards trend noted in national unemployment figures indicating a reduction in unemployment levels. While the 2012-13 survey indicates unemployment as the complement of our strict and restrictive definition of employment, detailed previously, the result presented is congruent with those of later surveys.\nDue to the large sample sizes, and respondents returning to later surveys, our data offers some longitudinal insights. For example, our data might also be considered as two pairs of year-on-year studies: 199 workers participated in both the 2012-13 and 2013-14 survey; 420 workers participated in both the 2016-17 and 2017-18 survey. In contrast to both national trends and overall survey responses, unemployment actually increased for the the 199 respondents over the 2012-14 period from 34% to 40%. However, for the 420 respondents for the 2016-18 period unemployment dropped from 34% to 25%, besting the overall figure.\nFurther, over the course of the six years that these surveys were undertaken, seven workers participated in all four. Initially, four workers were categorized as unemployed. However, in the most recent survey all but one of these seven respondents had taken up other employment. The remaining participant was unique in remaining classified as in each of the four surveys. Additional crossreferenced groupings can be found in, and from, accompanying data file.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Hours Using Amazon Mechanical Turk", "text": "While the indicative unemployment rates among the respondents are much higher than national estimates, many workers report spending substantial using the platform. Figure 1 shows the percentage of respondents using the platfor at least x hours per week. As detailed earlier, for 2012-13 survey, workers were limited to reporting up to hours. \" For subsequent surveys, 5-7% of workers report working on the platform 35 or more hours per week, which would place them in the full-time employment category under BLS definitions [30]. Further, 7-10% of respondents indicate using the platform in excess of 30 hours per week, which may entitle them to employer-subsidized health-care under the Affordable Care Act had they been pursuing similar hours in traditional employment [24].\nWhile an increasing hourly usage of the platform among respondents was established in the first three surveys, the most recent 2017-18 survey indicates a reversal of this trend. This may be indicative of a more competitive recruitment environment in the rapidly expanding gig economy, with many more, and potentially higher paying, worker-directed casual employment opportunities.\nReflecting the trends seen in the the overall figures, the 199 repeat respondents from the 2012-14 period reported an increase from 31% to 41% using the platform for 10+ hours per week. However, the 2016-18 period showed a slowing, rather than reversal, of the trend toward increasing hours with a modest increase from 51% to 52% reporting using MTurk 10+ hours per week among these 420 respondents.\nOf our seven workers who participated in all four surveys, the number of hours spent using Mechanical Turk remained stable in the region of 11-20 hours per week. However, once these workers undertook employment, their reported number of hours spent using the Mechanical Turk typically decreased. addition to representing a small subset of the respondents, as a group of workers who have continued to engage with the platform over a six-year period, the hourly commitment of these seven workers is higher than the workforce at Overall, all respondents reported a median time comof 6-10 hours per week. This lower typical level of might be expected from the broader population which been estimated to have a worker replacement rate of 50% every 400 days [11], and suggests an overall workforce with limited long-term commitment to the platform.", "n_publication_ref": 3, "n_figure_ref": 1}, {"heading": "POVERTY", "text": "coarse household income brackets used to minimize the invasiveness and encourage uptake make accurate estimates poverty challenging. Beginning with household income, and combining with other known measures including income distribution and household size, allows us to calculate estimates of poverty among the workforce.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Income", "text": "Income represents the market value of labor and, for many workers, is an important socio-economic marker. Figure 2 summarizes the percentage of respondents reporting household income in each bracket for the four surveys. Figure 2 highlights the broad trend: a decrease in respondents indicating household income in the lower brackets, and an increase in the higher brackets. This trend is representative of the national household income figures, as reported by the US Census Bureau [36], which show a similar but more marked movement from the lower to the higher income brackets.\nConsidering the year-on-year changes, for both the 2012-14 and 2016-18 periods, workers who participated in both surveys from each show a median reported household inof $40,000-60,000. similar to the overall trend identified, workers did report an increase income. For the period the proportion of the 199 respondents rea household of than $40,000 dropped from just under 50% to 48%. Similarly, in the 2016-18 period the proportion of the 420 respondents reporting a household income of less than $40,000 dropped from 37% to 35%\nAll but one of our seven workers who completed all four reported an increase in household income. This rise is expected when considered in concert with the increasing level of employment among this sub-sample. The sole exception, who reported remaining in the $20,000-40,000 bracket each of the four surveys over the six-year period, being the worker consistently reporting unemployment.\nThe US Census Bureau provides estimates of the number of households for each income bracket in intervals of $5,000 from $0-250,000+. These statistics are further enhanced by given means in each bracket. Using these more detailed figures, a reasoned model of the income distribution for the cohort can be computed, based on this distribution.\nPrevious work has shown that using interpolated cumulative distribution functions (CDFs) with mean matching offers a more accurate approach to estimating income statistics from binned data than fitting continuous parametric distributions or using the bin midpoint [17]. While the US Bureau typically uses a simple linear interpolation between the minimum and maximum value in each inter- [14], which assumes a constant population distribution within each income interval, this approach offers a more nuanced view of income distribution.\nAs seen in the companion data file, applying this computed national income distribution model to the cohort generally indicates a higher estimated income for these otherwise lowincome workers, in particular when compared with simple linear interpolation, and acknowledges the reality of income distribution rather than arbitrarily assuming a particular for each bracket or an artificial uniform distribution.", "n_publication_ref": 3, "n_figure_ref": 2}, {"heading": "Household Size", "text": "Poverty is also a function of household size. Having perreporting of household size allows for improved poverty estimates to be calculated, using the appropriate threshold. In the 2016-17 and 2017-18 surveys, where household size was gathered, responses reveal that mean household size is marginally higher for survey respondents to the later inclusion of this question, household size is unavailable for the 2012-14 period, however for the 420 respondents for the 2016-18 period the mean reported household size increased from 2.57 to 2.61. Similarly, the mean household size among the seven respondents to all four surshowed a slight increase in 2017-18. One respondent reported adding two household members, while another reported a reduction by one.\nThe varied reason for changes in household size, such as the forming and breaking of relationships, the birth and departure of children, or even deaths of household members, make these shifts difficult to contextualize without more invasive and unnecessary questioning.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Estimating Poverty", "text": "coarse household income brackets, used to minimize the invasiveness and encourage uptake, make accurate estimates of poverty challenging. For example: for a respondent to our survey reporting a household size of three and an income of $0-20,000 USD, it is not possible to state with absolute certainty whether or not this household would be as in poverty by the US Census Bureau, as the 2017 threshold for a three-person household was $19,515 [35].\nfor a reported household size of four, within the income bracket, we could categorically classify such a household as in poverty as the 2017 threshold was $25,094 for a four-person household [35]. These categories and classifications, however, do provide minimum and maximum bounds for poverty measures.\nUsing the more detailed income estimates, derived from income distribution figures as described earlier, it is possible calculate a reasoned representative value. Figure 3 shows the estimated poverty levels of the survey respondents and the official figures for the corresponding end-of-year 1.0× and 1.25× official national poverty thresholds poverty and the near poor [18]). The error bars indicate the minimum and maximum bounds, as a percentage of the cohort, which can be categorically classified in each group. Error bars show minimum and maximum for the cohort; prior to 2016-17, estimates based on national average household size. National figures [35].\nPrior to 2016-17, these estimates are dependent on national average household size and as such have a much broader For the latter surveys, requesting household size, we are able to offer higher accuracy estimates and narrower minimum and maximum bounds to these estimates.\nThe 2012-13 and 2013-14 surveys both indicated a higher level among Mechanical Turk workers compared to the national population, however, both the 2016-17 and surveys indicate poverty levels below the national figures. While the addition of a specific question regarding household size does improve the bounds, continuing to apply the official mean household size to the 2016-17 and 2017-18 results in poverty estimates that are all within 1.1% of those seen in Figure 3. This marked change of circumstance, coupled with the reduced commitment to the platform seen in Figure 1, may reflect the increase in the availability of alternative casual employment opportunities.\nDue to the coarse income brackets in our data, and the nature of population-level estimation of income distribution and household size, calculation of year-on-year changes is problematic. However, for completeness, none of the seven who participated in all four surveys would be classified as in poverty by the US Census Bureau by 2017-18. The single participant who continued to report an income bracket of $20,000-40,000 throughout the six-year period be near poor at the 2017 1.25× threshold of $24,394 for a three-person household [35].", "n_publication_ref": 5, "n_figure_ref": 3}, {"heading": "BROADER ECONOMIC TRENDS", "text": "The unemployment rate is down [31] and Americans are than ever before [36]. While these broad economic are captured in these surveys, the rates of improvelag the national figures. Between 2016-17 and 2017-18 unemployment among respondents dropped by 5.3% yearwhile the national figure saw a relative drop of 13.7% (see Table 1). For 2016-17, 13.7% of respondents indicated a household income in excess of $100,000 (Figure 2); nationally that figure is over twice as high at 27.7% [36].\nCrowdwork represents one of the earliest forms of what is now colloquially known as the gig economy, a technologically facilitated manifestation of non-economically driven part-time work [10]. Over the last 10 years the number of US workers engaged in non-economically driven part-time work has increased by 10.1%, from a mean of 19.3 million in 2008 to a mean of million in 2018 [32].\nnational economic data highlights an increasing wealth-divide among Americans [33], the rich are getting but, crucially, the poor are also getting less poor. Decreased unemployment, and the fluidity of labor between uncontracted laisser-faire opportunities in gig economy type jobs could be a contributory factor to the reduced estimated poverty rates for respondents in the 2016-17 and 2017-18 which are lower than the population at large. In essence, those applying themselves to these new forms of work may be better able to capitalize on increased opportunities in a turbulent growth-driven economy.\nConversely, these new labor markets do have drawbacks those who participate in them. While traditional employers typically provide a suitable working environment, tools, facilities, and consumables they may also offer a range benefits to their employees: tax-deductible retirement contributions; subsidized food, housing and clothing; employee loans or discount schemes; and crucially, health-care. As highlighted earlier, 7-10% of survey respondents indicate the Mechanical Turk in excess of 30 hours per week which may entitle them to employer subsidized health-care the Affordable Care Act, had they been pursuing similar hours in traditional employment [24].\nFurther, it is important to recall that \"non-economically driven\" part-time workers include those who undertake parttime work for reasons including medical issues, undertaking a course of study, or lack of affordable childcare [12]. It does not consider the individuals' need for income, as all in the workforce are expected to be participating for remuneration. Part-time work is only considered \"involuntary\" or \"economically driven\" due to slack economic conditions or lack of available full-time jobs [12]. However, the expanding segment of the job market that is now filled by gig economy positions may impact this categorization.\nexample, a pizza delivery driver may previously have taken on as full-time-equivalent employee, however in the gig economy these roles are increasingly being offered only through providers such as GrubHub where workers are classified as contractors, denying the protections and benefits of traditional employment. This change in the makeup of job availability may have an increasingly turbulent effect on employment figures during economic downturns.\nThe known disconnect between economic markers, including household income, and worker propensity to undertake Mechanical Turk tasks [11] further suggests that expansion of gig economy may encourage workers to undertake contingent work, and opportunistic behavior may be a necessary fundamental characteristic of the workforce.", "n_publication_ref": 9, "n_figure_ref": 1}, {"heading": "Potential Impact on Worker Models", "text": "Income is an important factor for those undertaking crowdwork. Workers rank, compare, and boast of their earnings in informal online forums [22]. While some work suggests that altruism, enjoyment, or spending free time are more domidrivers [23], Mechanical Turk workers expect to be paid their contributions [4]. The importance of this income to the workforce remains a matter of debate [9,21,23,26], and the impact of researchers themselves on marketplace characteristics raises varied ethical considerations.\nThe ease of which automated application of crowd intelligence can be applied to computationally difficult problems was raised by Bederson and Quinn [4] in their guidelines for fostering positive relationships between the requesters and workers using Amazon Mechanical Turk. Later work by Salehi et al. [27] considered the ability for the workforce to effect change, building a platform on which these workers could gather and stand to promote views. The project 1 saw early success in promoting Guidelines for Academic Requesters, however it lists no new motions in the last year.\nWorkers may have a sense of identity through association with the platform [21]. However, as the broader market for casual labor continues to develop, workers who feel subjugated by the platform are able to pursue a variety of viable alternatives. Between August 2011 and October 2018 3 Amazon continued to promote Mechanical Turk as having a worker population of \"more than 500,000\" suggesting limited stagnant growth over the 7-year period. Recent work by Difallah et al. [11], using capture-recapture of the workforce, suggests the number may be as low as 100,000.\nThe improving economic fortunes and reduced enthusiasm for the platform may have impacts on how researchers model worker behavior. The changing nature of work means that workers now have alternative casual employment opgig economy jobs. Previous work suggesting typical earnings of no more than $2 per hour [8, 16, 19] need to consider not only inflationary pressures, but also the decreasing attractiveness of low-wage tasks for a workforce who have a demonstrably higher hourly worth. research applications, including in HCI, crowdsourcing has long been identified as a mechanism for rapid, low-cost user studies and data acquisition tasks [20]. With increasing opportunities for contingent workers in the gig economy both the availability of workers, as they reduce hours, and the increasingly unattractive rates paid may erode these advantages of Mechanical Turk. While a small pool of altruistic and intrinsically driven workers are likely to continue using crowdlabor platforms, these low-cost workers will be in high demand and may be less representative of the population as a whole. Researchers may have to reconsider the appropriateness of their task not just from a technological and ethical position, but also from an increasingly economically driven one: both for the researcher and the participant.\nThis increased fluidity of the workforce may also impact the practical application of crowdlabor. Previous work, such the Soylent text editor [7], highlighted the ability to keep workers on retainer at extremely low-cost to provide esinstantaneous worker availability [6,7]. Models of worker behavior that depend on, or suggest, a ready and waiting workforce may be be disrupted by more attractive employment opportunities in the developing market as even the most committed long-term workers show a reduction in hours spent using crowdsourcing platforms.", "n_publication_ref": 15, "n_figure_ref": 0}, {"heading": "CONCLUSION", "text": "Crowdsourcing represents an early manifestation of the techfacilitated, laisser-faire, on-demand workforce typical of the so-called gig economy. This work has analyzed the results of four large-scale surveys of US-based Amazon Mechanical Turk workers. Each survey sampled approximately 3,000 workers; in total over 10,000 unique crowdworkers over a six-year period.\nOur results show that unemployment among the surveyed is far higher than national levels. However, crowdworkers are seeing limited positive shifts in employment status and household income, even where these may lag national trends. Our recent surveys indicate a move away from full-time-equivalent crowdwork, coupled with a reduction in estimated poverty levels to national figures. These trends are indicative of an increasingly workforce, able to maximize their opportunities rapidly changing labor market.\nAs national unemployment levels continue to fall and the labor market continues to expand, crowdworkers are undertake alternative employment in the contingent worker category. These behavioral changes have the potential for material impact to existing crowdworker models as workers are able to opportunistically from task to task job to job, no longer tied to a specific platform or role, to capitalize on their flexibility and maximize their income in the emerging modern gig economy.\nThe of this work were not supported by any online labor platform in the creation of this, or any prior, work. This work was supported by an EPSRC studentship and EP/N010558/1 and EP/R004471/1. Additional data related to this publication is available at the University of Cambridge Repository: https://doi.org/10.17863/CAM.34827.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Commoditized Workers: Case Study Research on Labor Law Arising from a Set of on-Demand/Gig Economy Comparative Labor Law &", "journal": "Policy Journal", "year": "2015", "authors": "Antonio Aloisi"}, {"title": "Amazon Mechanical Turk -Participation Agreement", "journal": "", "year": "2012", "authors": " Amazon"}, {"title": "The Determinants of Individual Unemployment Durations in an Era of High Unemployment", "journal": "Economic Journal", "year": "1995", "authors": "Wiji Arulampalam; Mark B Stewart"}, {"title": "Web Workers Unite! Addressing Challenges of Online Laborers", "journal": "ACM", "year": "2011", "authors": "B Benjamin; Alexander J Bederson;  Quinn"}, {"title": "Digital Labour Platforms and the Future of Work: Towards Decent Work in the Online World", "journal": "Report. International Labour Organization", "year": "2018", "authors": "Janine Berg; Marianne Furrer; Ellie Harmon; Uma Rani; M Six"}, {"title": "Crowds in Two Seconds: Enabling Realtime Crowd-Powered", "journal": "ACM", "year": "", "authors": "S Bernstein; Joel Brandt; Robert C Miller; David R Karger"}, {"title": "Soylent: A Word Processor with a Crowd Inside", "journal": "ACM", "year": "2010", "authors": "Michael S Bernstein; Greg Little; Robert C Miller; S Hartmann; David R Ackerman; David Karger; Katrina Crowell"}, {"title": "Breaking Monotony with Meaning: Motivation in Crowdsourcing Markets", "journal": "Journal of Economic Behavior & Organization", "year": "2013-06", "authors": "Dana Chandler; Adam Kapelner"}, {"title": "Building a Persistent Workforce on Mechanical Turk for Multilingual Data Collection", "journal": "", "year": "2011", "authors": "L David; William B Chen;  Dolan"}, {"title": "Djellel Difallah, Elena Filatova, and Panos Ipeirotis", "journal": "ACM", "year": "2016", "authors": "Stefano Valerio De"}, {"title": "Who Chooses Part-Time Work and Why? : Labor Review: U.S. Bureau of Labor Statistics. time-work-and-why.htm#BLS_table", "journal": "", "year": "2018", "authors": "Megan Dunn"}, {"title": "Working the Crowd: Employment Labor Law in the Crowdsourcing Industry", "journal": "Journal of Employment and Labor Law", "year": "2011-08", "authors": "Alek Felstiner"}, {"title": "Income and Poverty in the United States: 2017", "journal": "", "year": "2018", "authors": "Kayla Fontenot; Jessica ; Melissa Kollar"}, {"title": "Workers without Employers: Shadow Corporations and the Rise of the Gig Economy", "journal": "Review of Keynesian Economics", "year": "2014-04", "authors": "Gerald Friedman"}, {"title": "A Data-Driven Analysis of Workers' Earnings on Amazon Mechanical Turk", "journal": "ACM", "year": "2017-11", "authors": "Kotaro Hara; Abigail Adams; Kristy Milland; Saiph Savage; Chris Callison-Burch; Jeffrey P Bigham"}, {"title": "Living in Near Poverty in the United States", "journal": "", "year": "1966", "authors": "Charles Hokayem; Misty L "}, {"title": "The Labor Economics of Paid Crowdsourcing", "journal": "ACM", "year": "2010", "authors": "John Joseph Horton; Lydia B Chilton"}, {"title": "Crowdsourcing User Studies with Mechanical Turk", "journal": "ACM", "year": "2008", "authors": "Ed H Kittur; Bongwon Chi;  Suh"}, {"title": "The Rise of the \"Gig Economy\" and Implications for Understanding Work and Workers. Industrial and Organizational", "journal": "Psychology", "year": "2016-03", "authors": "Kristine M Kuhn"}, {"title": "Being a Turker", "journal": "", "year": "2014", "authors": "David Martin; Benjamin V Hanrahan; Jacki O Neill; Neha Gupta"}, {"title": "", "journal": "ACM", "year": "", "authors": ""}, {"title": "Conducting Behavioral Research on Amazon's Mechanical Turk", "journal": "Behavior Research Methods", "year": "2010", "authors": "Siddharth Mason;  Suri"}, {"title": "Employment Arrangements: Improved Outreach Could Help Ensure Proper Worker Classification", "journal": "US Government Accountability Office", "year": "2006-08", "authors": "R E Robertson; B S Fallavollita; L L Siegel; J Peterson;  Campbell"}, {"title": "Who Are the Crowdworkers?: Shifting Demographics Mechanical Turk", "journal": "ACM", "year": "2010", "authors": "Joel Ross; Lilly Irani; M Six; Andrew Silberman; Bill Zaldivar;  Tomlinson"}, {"title": "We Are Dynamo: Over-Stalling and Friction in Collective Action for Crowd Workers", "journal": "ACM", "year": "2015", "authors": "Niloufar Salehi; Lilly C Irani; Michael S Bernstein; Ali Alkhatib; Eva Kristy Milland; Clickhappier "}, {"title": "Working in a Gig Economy : Career Outlook: Bureau of Labor Statistics", "journal": "", "year": "2016", "authors": "Elka Torpey; Andrew Hogan"}, {"title": "International Standard Classification of Education", "journal": "UNESCO", "year": "1997", "authors": ""}, {"title": "How the Government Measures Unemployment", "journal": "", "year": "2009", "authors": ""}, {"title": "Unemployment Rates by Age, Sex, and Marital Status, Seasonally Adjusted", "journal": "", "year": "2018", "authors": ""}, {"title": "Table A-8. Employed Persons by Class of Worker and Part-Time Status", "journal": "", "year": "2014", "authors": ""}, {"title": "Historical Poverty Tables: People and -1959 to", "journal": "", "year": "2017", "authors": ""}, {"title": "Fair Minimum Wage Act of", "journal": "", "year": "2007", "authors": " Us Government"}, {"title": "Microworkers of the Gig Economy: Separate and Precarious", "journal": "New Forum", "year": "2016-09", "authors": "Juliet Webster"}, {"title": "The Role of Income, Life-Style Deprivaand Financial Strain in Mediating the Impact of Unemployment on Psychological Distress: Evidence from the Republic of Ireland", "journal": "Journal of Occupational and Psychology", "year": "1992-12", "authors": "T Christopher"}], "figures": [{"figure_label": "2", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 2 :2Figure 2: Percentage of surveyed MTurk workers reporting household income in each bracket (thousands, USD).", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Unemployment rate of surveyed US-based MTurk workers, with contemporary official national figures[31].", "figure_data": "Survey Respondents Unemployed (%) National (%)2012-133,04939.857.802013-143,04738.566.682016-172,88631.674.752017-182,88030.004.10"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "Mean reported household size of respondents with contemporary official national figures [34].", "figure_data": "SurveyMean household sizeNational2012-13-2.552013-14-2.542016-172.682.532017-182.772.54than the official national figures for the same period (see2). However, where individual figures are unavailablethe national mean provides reasonably approximate valuesthe cohort."}], "doi": "10.1145/3290605.3300621"}