{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.31999969482422,
      "x2": 295.7409973144531,
      "y1": 217.5719757080078,
      "y2": 454.135009765625
    },
    "text": "ABSTRACT We report a laboratory study (N=53) in which participants browsed their own Facebook news feeds for 10-15 minutes, choosing exactly when to quit, and later rated the overall emotional utility of the episode before attempting to recall threads. Finally, the emotional utility of each encountered thread was rated while looking over a recording of the interaction. We report that Facebook browsing was, overall, an emotionally positive experience; that recall of threads exhibited classic primacy and recency serial order effects; that recalled threads were both more positive and more valenced (less neutral) on average, than forgotten threads; and that overall emotional valence judgments were predicted, statistically, by the peak and end thread judgments. We find no evidence that local quit decisions were driven by the emotional utility of threads. In the light of these findings, we discuss the suggestion that emotional utility might partly explain the attractiveness of reading the news feed, and that an emotional memory bias might further increase the attractiveness of the newsfeed in prospect."
  },
  "figures": [{
    "caption": "Table 1: Encountered threads, judgments of emotional utility and recall performance",
    "captionBoundary": {
      "x1": 133.78799438476562,
      "x2": 477.9029541015625,
      "y1": 94.68436431884766,
      "y2": 100.323974609375
    },
    "figType": "Table",
    "imageText": ["Overall", "emotional", "rating", "of", "episode", "3.62", "3.21", "Number", "of", "encountered", "threads", "27.54", "17.76", "Number", "of", "recalled", "threads", "8.84", "4.83", "Number", "of", "forgotten", "threads", "18.70", "14.56", "Number", "of", "positively", "rated", "encountered", "threads", "18.40", "12.21", "Number", "of", "negatively", "rated", "encountered", "threads", "5.90", "7.55", "Number", "of", "neutral", "(zero)", "rated", "encountered", "threads", "3.30", "3.88", "Average", "emotional", "rating", "of", "encountered", "threads", "2.79", "1.83", "0.31", "Average", "emotional", "rating", "of", "recalled", "threads", "3.86", "2.06", "0.23", "Average", "emotional", "rating", "of", "forgotten", "threads", "2.30", "1.90", "0.23", "Emotional", "rating", "of", "peak", "encountered", "thread", "7.66", "4.20", "0.45", "Emotional", "rating", "of", "end", "encountered", "thread", "3.23", "4.88", "0.30", "Emotional", "rating", "of", "last", "three", "encountered", "threads", "3.03", "2.34", "0.23", "M", "SD", "Correlation", "with", "overall", "emotional", "rating"],
    "name": "1",
    "page": 5,
    "regionBoundary": {
      "x1": 75.0,
      "x2": 537.0,
      "y1": 115.0,
      "y2": 294.0
    }
  }, {
    "caption": "Figure 1: Mean proportion of recalled threads by serial position of encounter",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 295.63787841796875,
      "y1": 260.2394104003906,
      "y2": 276.8370361328125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "1",
    "page": 6,
    "regionBoundary": {
      "x1": 61.0,
      "x2": 285.0,
      "y1": 92.0,
      "y2": 247.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0487060546875,
        "y1": 487.12518310546875,
        "y2": 505.58599853515625
      },
      "text": "•Human-centered computing→ Empirical studies in HCI."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 128.51052856445312,
        "y1": 472.2608642578125,
        "y2": 478.68701171875
      },
      "text": "CCS CONCEPTS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.73895263671875,
        "y1": 538.5751342773438,
        "y2": 557.0360107421875
      },
      "text": "Facebook; Emotional Utility; The Peak–End Rule; Information Addiction"
    }, {
      "page": 0,
      "region": {
        "x1": 53.24800109863281,
        "x2": 295.0179748535156,
        "y1": 585.57958984375,
        "y2": 712.3289794921875
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. CHI 2019, May 4–9, 2019, Glasgow, Scotland UK © 2019 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 978-1-4503-5970-2/19/05. . . $15.00 https://doi.org/10.1145/3290605.3300252"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.798004150390625,
        "x2": 111.39410400390625,
        "y1": 523.7108154296875,
        "y2": 530.136962890625
      },
      "text": "KEYWORDS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.6679992675781,
        "x2": 559.2564086914062,
        "y1": 229.1021728515625,
        "y2": 278.79302978515625
      },
      "text": "Pawarat Nontasil and Stephen J Payne . 2019. Emotional Utility and Recall of the Facebook News Feed. In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), May 4–9, 2019, Glasgow, Scotland UK. ACM, New York, NY, USA, 9 pages. https: //doi.org/10.1145/3290605.3300252"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.6230163574219,
        "x2": 415.48681640625,
        "y1": 218.35836791992188,
        "y2": 223.99798583984375
      },
      "text": "ACM Reference Format:"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.89794921875,
        "y1": 307.55517578125,
        "y2": 589.0289916992188
      },
      "text": "A very large number of people spend a great deal of time using social media. For example, The Pew Research Centre [42] reported in 2018 that 68% of adult Americans used Facebook and 74% of these used it every day. Why is social media so compelling to so many users? We are convinced that there is no single answer to the general question of why Facebook is so widely used. Indeed, a substantial literature testifies to a wide variety of motivations, at the level of social and behavioural goals, for social media use. In Section 2, we will briefly review this literature, to provide general context to our particular, theoreticallymotivated study of the emotional utility of reading the Facebook news feed. Among its many uses and supported behaviours, the importance of reading (from the news feed or from friends’ walls) is testified by Pempek et al.[35] who noted that most of the college students in their sample spend \"more time observing content on Facebook than actually posting content\" (p. 227). Furthermore we know from the interview study of Lapides et al. [25]. that browsing the news feed is an emotionally mixed experience. We therefore argue that it is important to understand more of the structure of these emotional responses if we are to understand why, beyond its broad function, the news feed is attractive."
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980102539062,
        "y1": 594.4791259765625,
        "y2": 660.760009765625
      },
      "text": "In this article we adopt a particular decision-theoretic approach to what is attractive about browsing the Facebook news feed. We suggest that to understand Facebook’s appeal in full we need to understand how varying utility is experienced while using Facebook, and how it is judged and remembered subsequently."
    }, {
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 1"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 411.0592041015625,
        "y1": 292.6908874511719,
        "y2": 299.1170349121094
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7367858886719,
        "y1": 125.99715423583984,
        "y2": 204.2340087890625
      },
      "text": "Some of the earliest empirical research on Facebook (Lampe et al. [24]) focussed on elucidating its perceived usefulness. These authors noted a distinction between \"social searching\" (finding information about offline contacts) and \"social browsing\" which was targeted at developing new relations. In Lampe et al.’s sample of 2000 students, social searching was judged the more important of these functions."
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.74102783203125,
        "y1": 209.6831817626953,
        "y2": 347.6960144042969
      },
      "text": "Subsequently, many investigators have asked users about their reasons for using Facebook, and also about what gives them pleasure, and explored the statistical relation between their answers and their patterns of Facebook use. This approach derives from work on mass media, where it acquired the label of \"uses and gratifications\". In mass media research, the uses and gratifications approach has been defended by Ruggiero [40] for the way it allows individual users’ perspectives to enter the analysis of media effects. In other words, it is \"user-centred\", and for this reason it is perhaps unsurprising that it has been so influential in HCI studies of social media."
    }, {
      "page": 1,
      "region": {
        "x1": 53.000999450683594,
        "x2": 295.7382507324219,
        "y1": 353.1451721191406,
        "y2": 574.843994140625
      },
      "text": "Joinson [17] asked users of Facebook what they used Facebook for and why they enjoyed using it. Thematic analysis of their free-form, online responses was used to construct a questionnaire, in which 46 items were used to measure judged importance of seven types of use and gratification: Social connection; Shared identities; Photographs; Content (games and quizzes); Social investigation; Social network surfing; Status updates. Responses to these items were then combined with demographic data such as age and gender to predict aspects of Facebook use, in particular number of ’friends’, self-reported frequency and duration of use, and privacy settings. Subsequent work has used similar but different scales to measure uses and gratifications, and one path of development has been from relativelymonolithic treatment of the platform and self-report-based measures of Facebook use-patterns to a feature-by-feature approach, including parameters of use that can be computed via Facebook’s API, or comparison with other social media platforms."
    }, {
      "page": 1,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73760986328125,
        "y1": 580.2941284179688,
        "y2": 694.39599609375
      },
      "text": "Smock et al. [43] noted that Facebook could be considered as a toolkit of relatively independent features (such as messaging, groups, etc), They used the Papacharissi and Mendelson [32] scale to measure the gratifications of: Relaxing entertainment; Expressive information sharing (writing); Escapism; Cool and new trend; Companionship; Professional advancement; Social interaction; Habitual pastime; Meet new people. As predicted, different gratifications were associated with use of different Facebook features: to give just one, rather subtle example, the extent to which users agreed that"
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980712890625,
        "y1": 96.1091537475586,
        "y2": 114.57000732421875
      },
      "text": "Facebook could be used for \"professional advancement\" predicted how often they would \"write on friends’ walls\"."
    }, {
      "page": 1,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.7476806640625,
        "y1": 120.0201644897461,
        "y2": 198.25701904296875
      },
      "text": "Spiliotopoulos and Oakley [44] reported the associations between Joinson’s original gratifications and parameters of Facebook use that could be automatically computed through Facebook’s API. Again, to give a single example finding, they reported that number of links posted was associated with the rated importance of the Shared Identities gratification (whereas, surprisingly, number of groups or events was not)."
    }, {
      "page": 1,
      "region": {
        "x1": 317.95458984375,
        "x2": 559.6627807617188,
        "y1": 203.70619201660156,
        "y2": 305.8529968261719
      },
      "text": "Finally, in this brief and illustrative review we note Krause et al. [22] who reported the uses and gratifications that were associated withmusic listening on Facebook (in keeping with the trend of treating specific functions within the broader platform), and Quan-Haase and Young [37] who showed that the gratifications of \"having fun\" and \"knowing about the social activities occurring in one’s social network\" were more associated with Facebook use, whereas IM use was more limited to relationship development and maintenance."
    }, {
      "page": 1,
      "region": {
        "x1": 317.5865173339844,
        "x2": 559.8983764648438,
        "y1": 311.30218505859375,
        "y2": 544.9559936523438
      },
      "text": "Despite the differences in gratification scales and precise research questions, there are some common findings in this body of research with respect to what Facebook users find gratifying. For example, it is clear that one compelling affordance of social media is that they allow users to create, write and publish content (what Papacharissi and Mendelson [32] label \"Expressive Information Sharing\"). This is achieved by allowing people to update their personal profiles with any news or idea they wish to present [26], and is enhanced by the provision of a potentially large audience of one’s friends, family or even the public [3]. As with other gratifications it is possible, and we would argue important, to look beyond the label at the structure of the psychological experience. The reward of talking about oneself is well demonstrated by Tamir and Mitchell [45], who reported that participants will pay to self-disclose by answering about personal preferences rather than semantic facts and will pay more to make such disclosures to a friend or family member rather than privately; also, such personal disclosures activate neural regions associated with reward."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8959350585938,
        "y1": 550.4061279296875,
        "y2": 640.5980224609375
      },
      "text": "It is also clear that a major – probably the major – function and attraction of Facebook is that it affords development and maintenance of social relations. We know from longitudinal studies by Burke and Kraut [6] that connection with friends through Facebook will increase judgments of closeness. Indeed, these authors reported positive effects on judged friend closeness from simply reading a friend’s posts. It is this activity, browsing the news feed, that is studied in this article."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 158.85784912109375,
        "y1": 96.18885803222656,
        "y2": 117.5589599609375
      },
      "text": "2 RELATEDWORK Uses and Gratifications"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.5870056152344,
        "x2": 558.400634765625,
        "y1": 669.9571533203125,
        "y2": 712.3289794921875
      },
      "text": "As well as focusing on users browsing the news feed, our study takes a radically different approach to understanding why this is attractive to users, compared with the uses and gratifications literature. Instead of distinguishing between"
    }, {
      "page": 1,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 2"
    }, {
      "page": 2,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.7367858886719,
        "y1": 96.1091537475586,
        "y2": 222.1669921875
      },
      "text": "different types of reward, we adopt the construct of utility as a single, abstract dimension or currency that users experience and try to maximise. This approach is in keeping with certain general approaches to behaviour and interaction (e.g., in much of decision theory (since Edwards [9]), foraging theory [30] and in the Adaptive Interaction approach to HCI (Payne and Howes [33]). We argue that further insights into Facebook’s perceived usefulness can be gained from studying how information and its rewards are delivered, perceived and remembered, and in the contingencies and time-course of these processes."
    }, {
      "page": 2,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73779296875,
        "y1": 227.6161651611328,
        "y2": 413.45001220703125
      },
      "text": "It is worth noting that, of course, Facebook has been deliberately designed to structure rewards in a way that is likely to encourage use. The \"like\" feature allows readers very readily to make an approving response to a post, and these responses are found rewarding by the writer of that post (e.g. Meshi et al. [31]). Furthermore, Facebook’s reporting of Likes to the writer is temporally managed, so as to maximize the appeal of these rewards [13]. Another aspect of many social media, including Facebook, is that the content is inexhaustible, because new posts are always becoming available. Typically, access to new content is implemented by \"infinite scrolling\" [14] rather than paging, and sometimes with a pull-to-refresh interaction, deliberately modeled on one-armed bandits (according to Lewis [30]). In all these cases, the design’s effects can be understood or at least reasoned about in terms of established psychological theories."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7410583496094,
        "y1": 418.899169921875,
        "y2": 497.135986328125
      },
      "text": "The rewards of temporally distributed Likes, or simply of reading pleasing posts in the news feed, might be considered as a kind of partial reinforcement, because only some interactions are rewarded and the pattern of reward is not predictable. (The construct of partial reinforcement is very often used to describe all kinds of compulsive use, including \"addictions\" to information technology [2, 7, 15, 16, 28, 41])."
    }, {
      "page": 2,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.74102783203125,
        "y1": 502.5851745605469,
        "y2": 676.4630126953125
      },
      "text": "The current status of theoretical research in learning theory on partial reinforcement is complex [5] but the common and longstanding generalization is that partially reinforced learning schedules lead to behaviours that extinguish more slowly in the absence of reward, which might fit with the idea that people will continue to access an information resource such as the Facebook news feed, even if many posts fail to interest them. Gambling is similar in this sense, as well as in its engendering of problematic over-use. Gambling is often considered to be an example of a learned response to partial reinforcement [27]. Gamblers receives more losses than wins but they are still compelled to gamble, perhaps because of the power of partial reinforcement. As a result, the gambling behaviour often exhibits high rates of response and low rates of extinction [29]."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.056640625,
        "y1": 681.912109375,
        "y2": 700.3740234375
      },
      "text": "A second theoretical framework relevant to the appeal of only-occasional rewards is memory bias. The appeal of an"
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980712890625,
        "y1": 96.1091537475586,
        "y2": 293.89801025390625
      },
      "text": "activity in prospect is presumably moderated by the remembered utility of the activity. In this light, several memory bias accounts have been put forward (alongside partial reinforcement) in order to explain persistent gambling in the face of frequent losses and only occasional wins. It is sometimes suggested that wins will be better remembered than losses, so that the overall utility of gambling is overestimated [21, 38]; but Gilovich[12] found losses were better remembered than wins. Alternatively, Rachlin[38] suggested that gambling episodes might be encoded in memory as strings of gambles that end in a success, again leading (through recency effects) to exaggerated remembered utility. More generally, research on human memory shows that people better remember more valenced, as opposed to neutral, information [8]. This in turn might lead to distorted memories of the emotional utility of the news feed, which might contribute to its attractiveness."
    }, {
      "page": 2,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8980102539062,
        "y1": 299.34716796875,
        "y2": 712.3289794921875
      },
      "text": "The inexhaustible nature of Facebook \"news\" can be considered in the light of the theory of Information Foraging Theory[36]. One idea in foraging theory is that people will tend to abandon information sources when the rate of encounter with valuable information reduces (e.g., Payne and Reader [34]). If no reduction ever occurs, users will need some other reason to quit, and over-long browsing seems likely to occur. To contribute to this range of theoretical concerns, the study reported in this paper explores the issue of memory bias, with respect to the emotional utility of reading the news feed, and at the same time tests whether emotional utility might explain quit decisions within a foraging framework. Affective responses to the news feed are elicited on a single dimension of emotional utility, from highly negative to highly positive. This approach obviously reduces the multifaceted complexity of rewards from social media posts, and, in terms of foraging theory, assumes that the currency of valuable information can also be considered in terms of a simple construct of emotional utility. This simplifying approach is in keeping with conceptions of utility from Bentham and others [4, 18, 20, 39], and has been used successfully in many studies concerned with the retrospective evaluation of the subjective utility of extended episodes, particularly those associated with the \"peak-end rule\" [10, 19]. Fredrickson and Kahneman [10] asked participants to watch series of film clips, both pleasant and unpleasant. While watching, participants were requested to indicate their moment-by-moment affect by sliding a knob to illuminate one of 15 coloured lights with dark green on the right of a scale representing the most positive affect and dark red on the left representing the most negative; the yellow on the centre of the knob represented a neural/indifferent feeling. Participants were additionally asked for retrospective emotional judgments of the whole extended viewing episode."
    }, {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 3"
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.73370361328125,
        "y1": 96.1091537475586,
        "y2": 138.48101806640625
      },
      "text": "Fredrickson and Kahneman reported that retrospective judgments were relatively unaffected by duration, and better understood as deriving from snapshots during the episode, in particular the peak and end momentary evaluations."
    }, {
      "page": 3,
      "region": {
        "x1": 53.499141693115234,
        "x2": 295.5885925292969,
        "y1": 143.9301300048828,
        "y2": 341.718994140625
      },
      "text": "A different time scale of responses was considered in the first study reported by Geng et al. [11]. They asked people at the end of each day of a seven–day vacation to rate how happy they had been that day on a 7-point scale from \"very unhappy\" to \"very happy\". Later, at three occasions after the holiday, the same participants were asked to rate how happy they had been \"overall...during the past vacation\" on the same scale. Geng et al. [11] reported that the peak-end evaluations during the holiday (i.e. the day with the highest happiness, and the happiness of the last day of the holiday), predicted the retrospective response after one day and after three weeks, which is the signature peak-end rule finding. (The peak-end rule did not apply after seven weeks, and these authors suggest that the issue of time delay can explain inconsistencies in the literature. We are interested in short delays, because the typical delay between separate Facebook episodes is short.)"
    }, {
      "page": 3,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7423095703125,
        "y1": 347.1681823730469,
        "y2": 568.8670043945312
      },
      "text": "In these studies, and many others like them, the main research question is how retrospective summary judgments of emotional utility are affected by the real-time momentby-moment emotions. Our study asks a similar question but with some important differences. Rather than using momentby-moment, or time-window by time-window judgments, we collected judgments of individual news feed threads. Reading the news feed can be considered as reading a sequence of discrete threads. By asking for emotional responses to each thread (rather than after fixed periods of time), we respected this structuring of user experience and enabled analysis of the relation between emotional response and memorability of threads. This approach maintains an important aspect of the moment-by-moment approach in that it allows characterisation of the whole episode as a time-ordered sequence of emotional states. The earlier investigations that looked at, e.g. medical operations or films, had no obvious discrete structure to align emotional utility judgments with, so used time–windows of necessity."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7400207519531,
        "y1": 574.316162109375,
        "y2": 616.68701171875
      },
      "text": "Furthermore, we collected these judgments retrospectively, after the browsing episode, rather than in real time, so as to minimise the interruption to participants’ reading experience."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 405.5398254394531,
        "y1": 655.0928344726562,
        "y2": 661.5189819335938
      },
      "text": "Experienced Utility"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.05413818359375,
        "y1": 646.047119140625,
        "y2": 688.41796875
      },
      "text": "Our general research goal is to understand aspects of the emotional utility of reading the Facebook news feed, and the extent to which these might help explain why browsing Facebook is so compelling."
    }, {
      "page": 3,
      "region": {
        "x1": 317.5870056152344,
        "x2": 558.2066040039062,
        "y1": 96.18885803222656,
        "y2": 165.3800048828125
      },
      "text": "RQ1: What is the remembered emotional experience of a brief period of Facebook news feed reading, and how is it related to the emotional response to each encountered thread? In particular, we test the hypothesis that the peak-end rule will predict overall judgments of emotional experience"
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980712890625,
        "y1": 179.87489318847656,
        "y2": 284.9320068359375
      },
      "text": "RQ2: Does memory for threads on the news feed show classic serial order effects, despite the variety of thread content? If threads encountered at the beginning and end of a Facebook session are the best recalled (primacy and recency), then these threads will exert the most influence on the attractiveness of future use. But threads, although encountered in series, are more varied as memory-materials than typical memory-experiment stimuli."
    }, {
      "page": 3,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8976440429688,
        "y1": 299.4268493652344,
        "y2": 368.6180114746094
      },
      "text": "RQ3: Is memory for news feed threads predicted by their emotional valence? We consider the suggestion that a memory bias might underpin the judged attractiveness of the news feed, by testing the hypothesis that remembered threads will be more emotionally positive than forgotten threads."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2151489257812,
        "y1": 374.0671691894531,
        "y2": 404.4830017089844
      },
      "text": "We additionally test the hypothesis that highly emotional threads (whether positive or negative) are better remembered than more neutral threads."
    }, {
      "page": 3,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.7413330078125,
        "y1": 418.9788513183594,
        "y2": 464.2590026855469
      },
      "text": "RQ4: When do people give up reading the news feed? We consider whether the fluctuation of emotional responses to threads might explain the local decision to quit Facebook. Do people quit when there is a decline in emotional valence?"
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 180.4676055908203,
        "y1": 631.182861328125,
        "y2": 637.6090087890625
      },
      "text": "3 RESEARCH QUESTIONS"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 317.70599365234375,
        "x2": 559.304931640625,
        "y1": 508.5631408691406,
        "y2": 634.6199951171875
      },
      "text": "Participants were students and staff of the University of Bath, recruited by posters on the campus. Each participant was paid £5.00 for their participation. Participants were required to have a Facebook account, but were asked, when scheduled, not to access Facebook in the hour before the experiment. In total 53 volunteers participated, 39 women and 14 men. 37 volunteers were 21 -30 years, 9 volunteers were 31-35 years and 7 volunteers were over 36 years. (For comparison, in 2018 the population of global active Facebook users was 53% female and 47% male and the most frequent age group was 18 – 29 years old [48])."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8970336914062,
        "y1": 640.0691528320312,
        "y2": 706.3510131835938
      },
      "text": "Participants reported an average amount of time on Facebook of 83 minutes per day, with the number of visits per day varying from 3 to over 11. (For comparison, Zephoria [49] reported that across all Facebook users the average time per visit was 20 minutes. We don’t know how approximate this figure is.)"
    }, {
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 4"
    }, {
      "page": 4,
      "region": {
        "x1": 53.79764175415039,
        "x2": 294.75732421875,
        "y1": 96.1091537475586,
        "y2": 150.43597412109375
      },
      "text": "None of the participants’ self-estimates are likely to be accurate [1], but they broadly characterise our sample as active Facebook users. Nine participants reported having fewer than 50 Facebook friends, 16 reported having over 500; the remainder reported an intermediate number."
    }, {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.05841064453125,
        "y1": 155.88514709472656,
        "y2": 210.21197509765625
      },
      "text": "Participants reported using Facebook to keep in touchwith family and friends, to share pictures, music and videos and to find information. Participants reported reading information on the news feed much more often than posting their own status updates or comments."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 396.20440673828125,
        "y1": 478.7548522949219,
        "y2": 500.125
      },
      "text": "4 EXPERIMENT Participants"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.429779052734375,
        "x2": 295.74267578125,
        "y1": 239.57118225097656,
        "y2": 509.09100341796875
      },
      "text": "Each participant was invited individually into the laboratory. The procedure comprised five main phases in a fixed order: interacting with Facebook by reading the news feed; responding to a questionnaire; judging the overall emotional utility of the Facebook–browsing episode; recalling Facebook threads; judging the emotional utility of each encountered Facebook thread. Participants were not warned in advance about later phases. These phases are detailed below. After completing informed consent, participants were invited to access their Facebook account via the Chrome browser running on an Apple MacBook Pro. Participants were asked to browse Facebook for between 10 and 15 minutes; they were told to use the Macintosh digital desktop clock to note the time they started browsing and to ensure that they browsed for at least 10 minutes and to quit some time within the next 5 minutes. While browsing Facebook, participants were instructed that they could read, \"like\" and \"share\" only. While reading they were allowed to open links, but always to return directly to Facebook from this linked destination. They were asked not to enter status updates or comments.The screen was recorded throughout (and of course participants were informed that this was happening.)"
    }, {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.74114990234375,
        "y1": 514.5401611328125,
        "y2": 712.3289794921875
      },
      "text": "After the browsing period, participants were asked to complete the demographic and Facebook usage questionnaire, slightly reduced from the online questionnaire of University of California[46]. As well as providing the demographic and usage statistics summarized above, this phase separated reading from recall and prevented rehearsal. Participants took roughly 5–7 minutes to complete the questionnaire. Participants were then asked to rate how positive or negative was their overall emotional experience of the Facebook–browsing session. Participants made this judgment on a Likert–type scale with –10 as the most negative and +10 as the most positive emotional experience. Participants were informed that a positive response might include liking, enjoying, being interested in, finding funny, touching, etc., while a negative response would include disliking, being irritated, upset, bored, etc. (One might question whether \"bored\" is a label for negative as opposed to neutral emotion, but our choice"
    }, {
      "page": 4,
      "region": {
        "x1": 317.58642578125,
        "x2": 559.7442626953125,
        "y1": 96.1091537475586,
        "y2": 377.5840148925781
      },
      "text": "to include it is perhaps justified by Lapides et al. [25] who report that many of their participants expressed annoyance at uninteresting status updates.) Next, participants attempted to recall every thread that they had seen during the Facebook–browsing session. It was explained that a \"thread\" meant a status update and any responses. They were instructed to write a distinctive phrase in an Excel file for each thread they could recall. After they reported being unable to recall further threads, the recording of the session was opened for participants to view. The participants were required to complete their recalled list with the forgotten threads, using a distinctive phrase as before, and to note the order in which all the threads had been encountered (by numbering the threads in their completed list). Finally, participants were asked to rate how positive or negative was their emotional experience of each thread in the complete list, recalled as well as forgotten. They did this using the same response scale as for the overall evaluation and entered their responses in the Excel spreadsheet. This is a notable departure from the methodology of the typical peak– end study, as the experienced \"moment by moment\" utility of each thread is itself remembered (or perhaps repeated), rather than done at the time of the initial exposure."
    }, {
      "page": 4,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.893798828125,
        "y1": 383.0331726074219,
        "y2": 413.45001220703125
      },
      "text": "On completion of the thread-judgment task, participants were thanked and debriefed, and the recording of their browsing session was deleted."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 100.36505126953125,
        "y1": 224.7068634033203,
        "y2": 231.13299560546875
      },
      "text": "Procedure"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 317.72601318359375,
        "x2": 559.89794921875,
        "y1": 457.753173828125,
        "y2": 559.9000244140625
      },
      "text": "On average, participants spent 11 minutes 40 seconds browsing Facebook, which indicates that they typically quit relatively early during the 5–minute discretionary period. (Five participants signaled that they were stopping shortly before 10 minutes has elapsed, in which case they were told to continue, and told when 10 minutes had elapsed so that they could stop within the next 5 minutes.) On average, participants read 28 threads during this time (a thread comprises a status update and any responses)."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8908081054688,
        "y1": 565.3501586914062,
        "y2": 631.6309814453125
      },
      "text": "Table 1 displays these data, along with participants’ recall performance, and their responses to the emotion judgment tasks. Forty nine of the fifty three participants reported an overall positive retrospective emotional evaluation of their browsing episode; four participants reported a negative overall emotional experience."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8912963867188,
        "y1": 637.0811767578125,
        "y2": 691.406982421875
      },
      "text": "On average, participants recalled around one third of the threads they encountered. Around two thirds of threads were rated emotionally positive, and the average emotional judgment of all threads was moderately positive, marginally less positive than the single rating of the entire episode."
    }, {
      "page": 4,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 5"
    }, {
      "page": 5,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.74102783203125,
        "y1": 312.4868469238281,
        "y2": 441.4530029296875
      },
      "text": "RQ1: Using the peak-end rule to predict the overall emotional experience The overall emotional utility reported retrospectively by participants was, on average, 3.62 (Table 1) which was higher than the average of all threads’ emotional utility as subsequently rated when viewing the screen recording. The correlation between both variables was positive and significant (r(51) =.31, p<.05). The correlation between the end rating and the overall rating was similar (r(51) =.30, p<.05). The correlation between the peak emotional experience and the overall rating was higher (r(51) =.46, p<.05)."
    }, {
      "page": 5,
      "region": {
        "x1": 53.54899978637695,
        "x2": 295.7362976074219,
        "y1": 446.9031677246094,
        "y2": 525.1400146484375
      },
      "text": "To further test the peak-end rule we performed a multiple regression with peak and end as the predictor variables and overall rating as the dependent variable. This regression was significant (F (3,49) = 4.70, p < 05, r 2 = .22). Plausible alternative models were less successful predictors of overall emotional rating, as follows: averaged thread valence (r 2 = .10); recalled thread valence (r 2 = .05)."
    }, {
      "page": 5,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.73712158203125,
        "y1": 539.6348876953125,
        "y2": 680.5570068359375
      },
      "text": "RQ2: Serial position effects in recall of news feed threads Figure 1 shows the mean proportion of threads recalled by serial position of encounter, with separate averages across participants for the first three and last three encountered threads. The central value is an average of each participant’s proportion of intermediate threads recalled (which is the average over a varying number of threads). The shape of the curve shows classic primacy and recency effects. We conducted a single–factor, repeated measures ANOVA on proportion recalled of first three, intermediate and last three threads. This revealed a significant effect (F(2,104) = 5.3, p<.01)."
    }, {
      "page": 5,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.89794921875,
        "y1": 312.4868469238281,
        "y2": 561.0050048828125
      },
      "text": "RQ3: Emotional utility and recall We predicted that people would better recall emotionally more positive threads. The data in Table 1 show that, on average, the recalled threads were rated more positively than the forgotten threads. To test this hypothesis, we conducted a paired t – test comparing each participant’s average emotional response to recalled threads with their emotional response to forgotten threads. The effect was significant (t (52) = 5.858, p<.01, d = 0.805). Similarly, we compared the absolute emotional valences of recalled threads and forgotten threads for each participant, and this effect was significant (t(52) = 9.384, p<.01, d = 1.23). But we should note that this test is not independent of the positivity effect, given the relatively small number of negatively rated threads overall. Consequently, we tested recalled v. forgotten negative threads in those 15 participants that had at least one of each. The recalled threads were more negative, and this effect was marginally significant, despite very low power (t(14) = 2.44, p=.06, d=0.66)."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 393.5841979980469,
        "y1": 427.9448547363281,
        "y2": 449.31500244140625
      },
      "text": "5 RESULTS Descriptive Data"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.898681640625,
        "y1": 590.3651123046875,
        "y2": 692.5120239257812
      },
      "text": "Table 1 shows that the rated emotional utility of the end encountered single thread was higher than the average of all threads’ emotional experience. The final thread was not rated lower than previous threads, suggesting that people did not quit their sessions because their enjoyment had diminished. Paired t–test were computed to compare the average response to all threads with the last thread, and with the average of the last four threads. Neither of these t–tests revealed a significant effect."
    }, {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 6"
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 519.3074340820312,
        "y1": 575.5008544921875,
        "y2": 581.927001953125
      },
      "text": "RQ4: The effect of end emotional experience"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7337951660156,
        "y1": 313.4701843261719,
        "y2": 415.61700439453125
      },
      "text": "Our participants seemed readily able to rate the overall emotional utility of a brief period of Facebook browsing and, additionally, the emotional utility of each encountered thread on a single dimension. These ratings showed an overall positive emotional experience, and one that, in keeping with some earlier research on retrospective evaluation of episodes, can be predicted from the rated emotional utility of the thread with the highest emotional utility together with the utility of the end encountered thread (the peak–end rule)."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5908203125,
        "y1": 421.066162109375,
        "y2": 487.3479919433594
      },
      "text": "Recall of encountered threads revealed classic serial order effects, with the first three and last three encountered threads being better recalled, on average, than intermediate threads. Furthermore, emotional utility predicted recall, with recalled threads being more positive, and more emotionally valenced than forgotten threads [23, 47]."
    }, {
      "page": 6,
      "region": {
        "x1": 53.42951965332031,
        "x2": 295.7363586425781,
        "y1": 492.79718017578125,
        "y2": 571.0339965820312
      },
      "text": "Together, these results support our overall claim that the emotional utility of the news feed, and the way this interacts with memory, might contribute to the attractiveness of Facebook, and consequently to its extensive use. People respond positively to most of the news feed threads they encounter, and in their memory the overall experience is even more positive."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.73638916015625,
        "y1": 576.483154296875,
        "y2": 702.541015625
      },
      "text": "We found no evidence in this study that people quit after low–utility threads, which in turn (because of the peak–end rule) might contribute to positive evaluations of the overall episode. It seems quite possible, however, that quit decisions in a laboratory context are different from those that operate in the real world. This point raises a key limitation of our study, which is that the participants’ interaction with Facebook was in several ways a little unnatural. Firstly, it was in a laboratory, and approximately time limited. Secondly, participants were instructed to read (and like or share), but not to post, and"
    }, {
      "page": 6,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8999633789062,
        "y1": 96.1091537475586,
        "y2": 281.9429931640625
      },
      "text": "only to follow links over a single step. These constraints on user behaviour are striking in the context of a research literature (the uses and gratifications literature reviewed above), which has found a wide variety of user motivations linked to a wide variety of particular Facebook behaviours. Our approach cuts through the platform’s functions or features to consider an episode of Facebook use (actually, reading) as simply a period of varying emotional utility. We propose that future workmight expand our experimental paradigm to consider some aspects of the \"Facbook as a toolkit\" idea [43]. For example, we might consider how the type of news feed thread (e.g. text v photo v video) or the nature of the social relationship (e.g. online–only v offline friend) affect thread memorability alongside emotional utility. Such work might require more intrusive procedures, however, with some privacy implications to navigate."
    }, {
      "page": 6,
      "region": {
        "x1": 317.5867614746094,
        "x2": 559.8984985351562,
        "y1": 287.3921813964844,
        "y2": 568.8670043945312
      },
      "text": "Our most general defence of controlled experimental designs, despite the applied context of our research, is that they allow better tests of theories which have real-world consequences in less constrained situations (Payne and Reader [34] have called this the \"Broadbent approach\" to applied research, after the British psychologist). We would argue that the peak-end rule is such a theory. More specifically, this particular experiment has quite high ecological validity, especially in its use of participants’ own Facebook news feeds. We should also note again that our method for obtaining emotional responses to individual threads was unusual, compared with a typical peak-end rule study. We did not collect responses to threads as they were first encountered, because we worried that making such responses might itself affect memory for threads and so disrupt some of the main hypotheses we wished to test. This design decision also increased the naturalness of the participants’ reading experience. The cost of the decision is that the emotional utility of threads was rated retrospectively, when threads were re-encountered on a screen recording, so that these individual thread ratings might themselves be affected by some unknown memory bias. Further studies might instead use real–time ratings, accepting different empirical risks."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 128.84927368164062,
        "y1": 298.60589599609375,
        "y2": 305.03204345703125
      },
      "text": "6 DISCUSSION"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.89794921875,
        "y1": 598.2261352539062,
        "y2": 688.41796875
      },
      "text": "Our main, overarching aim in this study is to introduce the idea of emotional utility, and how this interacts with memory as part of the explanation for the attractiveness of the Facebook news feed. Our experiment has demonstrated the potential of using simple emotional utility ratings to throw light on aspects of Facebook use, and, in particular, on how memory for the experience of using Facebook might contribute to its attractiveness in prospect."
    }, {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 7"
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 405.04156494140625,
        "y1": 583.3618774414062,
        "y2": 589.7880249023438
      },
      "text": "7 CONCLUSIONS"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.31999969482422,
        "x2": 294.05120849609375,
        "y1": 111.05318450927734,
        "y2": 129.51397705078125
      },
      "text": "We would like to thank all participants for their enthusiasm for this study."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 161.5478515625,
        "y1": 96.18885803222656,
        "y2": 102.614990234375
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 57.50400161743164,
        "x2": 294.04180908203125,
        "y1": 157.98358154296875,
        "y2": 163.18798828125
      },
      "text": "[1] Adam L Alter. 2017. Irresistible: the rise of addictive technology and the"
    }, {
      "page": 7,
      "region": {
        "x1": 57.50400161743164,
        "x2": 295.38995361328125,
        "y1": 167.94659423828125,
        "y2": 183.11297607421875
      },
      "text": "business of keeping us hooked. New York : Penguin Press. [2] Abram Amsel. 1958. The role of frustrative nonreward in noncontinu-"
    }, {
      "page": 7,
      "region": {
        "x1": 57.50401306152344,
        "x2": 294.0402526855469,
        "y1": 187.87158203125,
        "y2": 203.03900146484375
      },
      "text": "ous reward situations. Psychological bulletin 55, 2 (1958), 102. [3] Mitja D Back, Juliane M Stopfer, Simine Vazire, Sam Gaddis, Stefan C"
    }, {
      "page": 7,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.38775634765625,
        "y1": 207.79656982421875,
        "y2": 711.1329956054688
      },
      "text": "Schmukle, Boris Egloff, and Samuel D Gosling. 2010. Facebook profiles reflect actual personality, not self-idealization. Psychological science 21, 3 (2010), 372–374. [4] Jeremy Bentham. 1996. The collected works of Jeremy Bentham: An introduction to the principles of morals and legislation. Clarendon Press (1996). [5] Joe M Bloom and EJ Capaldi. 1961. The behavior of rats in relation to complex patterns of partial reinforcement. Journal of Comparative and Physiological Psychology 54, 3 (1961), 261. [6] Moira Burke and Robert E Kraut. 2014. Growing closer on facebook: changes in tie strength through social network site use. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 4187—-4196. [7] EJ Capaldi. 1957. The effect of different amounts of alternating partial reinforcement on resistance to extinction. The American Journal of Psychology (1957). [8] Florin Dolcos, Kevin S LaBar, and Roberto Cabeza. 2006. The memory enhancing effect of emotion: Functional neuroimaging evidence. Memory and emotion: Interdisciplinary perspectives (2006), 105—-134. [9] Ward Edwards. 1954. The theory of decision making. Psychological bulletin 51, 4 (1954), 380. [10] Barbara L Fredrickson and Daniel Kahneman. 1993. Duration neglect in retrospective evaluations of affective episodes. Journal of personality and social psychology 65, 1 (1993), 45. [11] Xiaowei Geng, Ziguang Chen, Wing Lam, and Quanquan Zheng. 2013. Hedonic evaluation over short and long retention intervals: The mechanism of the peak–end rule. Journal of Behavioral Decision Making 26, 3 (2013), 225 —-236. [12] Thomas Gilovich. 1983. Biased Evaluation and Persistence in Gambling. Journal of Personality and Social Psychology 44, 56 (1983), 1110–1126. [13] Sam Harris. 2017. What is Technology Doing to Us? https://samharris. org/podcasts/what-is-technology-doing-to-us/ [14] Robert Hoekman Jr and Jared Spool. 2009. Web anatomy: interaction design frameworks that work. New Riders. [15] Lloyd G Humphreys. 1939. The effect of random alternation of reinforcement on the acquisition and extinction of conditioned eyelid reactions. Journal of Experimental Psychology 25, 2 (1939), 1939. [16] William O Jenkins and Julian C Stanley Jr. 1950. Partial reinforcement: a review and critique. Psychological bulletin 47, 3 (1950), 193. [17] Adam N. Joinson. 2008. Looking at, looking up or keeping up with people?: motives and use of facebook. In dlProceeding of the twentysixth annual CHI conference on Human factors in computing systems - CHI ’08. ACM Press, New York, New York, USA, 1027. https://dl.acm. org/citation.cfm?id=1357213 [18] Daniel Kahneman. 1999. Objective happiness. Well-being: The foundations of hedonic psychology 3 (1999), 25. [19] Daniel Kahneman, Barbara L Fredrickson, Charles A Schreiber, and Donald A Redelmeier. 1993. When more pain is preferred to less: Adding a better end. Psychological science 4, 6 (1993), 401–405. [20] Daniel Kahneman, Peter P Wakker, and Rakesh Sarin. 1997. Back to Bentham? Explorations of experienced utility. The quarterly journal of"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.1954956054688,
        "y1": 97.41058349609375,
        "y2": 112.5780029296875
      },
      "text": "economics 112, 2 (1997), 375—-406. [21] Gideon Keren and Willem A Wagenaar. 1988. Chance and skill in"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9550476074219,
        "x2": 558.2015380859375,
        "y1": 117.3355712890625,
        "y2": 132.50299072265625
      },
      "text": "gambling: A search for distinctive features. Social Behaviour (1988). [22] Amanda E. Krause, Adrian C. North, and Brody Heritage. 2014. The"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.544921875,
        "y1": 137.2615966796875,
        "y2": 710.3359985351562
      },
      "text": "uses and gratifications of using Facebook music listening applications. Computers in Human Behavior 39 (oct 2014), 71–77. https://doi.org/ 10.1016/J.CHB.2014.07.001 [23] Kevin S LaBar and Roberto Cabeza. 2006. Cognitive neuroscience of emotional memory. Nature Reviews Neuroscience 7, 1 (jan 2006), 54–64. https://doi.org/10.1038/nrn1825 [24] Cliff Lampe, Nicole Ellison, and Charles Steinfield. 2006. A Face(book) in the Crowd: Social Searching vs. Social Browsing. Technical Report. [25] Paul Lapides, Apoorve Chokshi, Sheelagh Carpendale, and Saul Greenberg. 2015. News Feed: What’s in it for Me?. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, New York, New York, USA, 163–172. https://doi.org/10.1145/2702123.2702554 [26] Woojin Lee, Lina Xiong, and Clark Hu. 2012. The effect of Facebook users’ arousal and valence on intention to go to the festival: Applying an extension of the technology acceptance model. International Journal of Hospitality Management 31, 3 (2012), 819–827. [27] Donald J Lewis. 1952. Partial reinforcement in a gambling situation. Journal of Experimental Psychology 43, 6 (1952), 447. [28] Donald J Lewis. 1960. Partial reinforcement: a selective review of the literature since 1950. Psychological bulletin 57, 1 (1960), 1. [29] Donald J Lewis and Carl P Duncan. 1956. Effect of different percentages of money reward on extinction of a lever-pulling response. Journal of Experimental Psychology 52, 1 (1956), 23. [30] P Lewis. 2017. Our minds can be hijacked: the tech insiders who fear a smartphone dystopia. The Guardian (2017). [31] Dar Meshi, Carmen Morawetz, and Hauke R Heekeren. 2013. Nucleus accumbens response to gains in reputation for the self relative to gains for others predicts social media use. Frontiers in human neuroscience 7 (2013), 439. [32] Zizi Papacharissi and Andrew Mendelson. 2010. 12 Toward a new (er) sociability: uses, gratifications and social capital on Facebook. Media perspectives for the 21st century 212 (2010). [33] Stephen J. Payne and Andrew Howes. 2013. Adaptive Interaction: A Utility Maximization Approach to Understanding Human Interaction with Technology. Synthesis Lectures on HumanCentered Informatics 6, 1 (mar 2013), 1–111. https://doi.org/10.2200/ S00479ED1V01Y201302HCI016 [34] Stephen J Payne and William R Reader. 2007. Allocating time across multiple texts: Sampling and satisficing. Human-Computer Interaction 22, 3 (2007), 263–298. [35] Tiffany A Pempek, Yevdokiya A Yermolayeva, and Sandra L Calvert. 2009. College students’ social networking experiences on Facebook. Journal of applied developmental psychology 30, 3 (2009), 227–238. [36] Peter Pirolli and Stuart Card. 1999. Information foraging. Psychological bulletin 106, 4 (1999), 643. [37] Anabel Quan-Haase andAlyson L. Young. 2010. Uses andGratifications of Social Media: A Comparison of Facebook and Instant Messaging. Bulletin of Science, Technology & Society 30, 5 (oct 2010), 350–361. https://doi.org/10.1177/0270467610380009 [38] Howard Rachlin. 1990. Why do people gamble and keep gambling despite heavy losses? Psychological Science 1, 5 (1990), 294–297. [39] Daniel Read. 2007. Experienced utility: utility theory from Jeremy Bentham to Daniel Kahneman. Thinking & Reasoning 13, 1 (2007), 45—-61. [40] Thomas E. Ruggiero. 2000. Uses and Gratifications Theory in the 21st Century. Mass Communication and Society 3, 1 (feb 2000), 3–37. https://doi.org/10.1207/S15327825MCS0301_02"
    }, {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 8"
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.26605224609375,
        "y1": 97.41058349609375,
        "y2": 232.1300048828125
      },
      "text": "[41] Burrhus Frederic Skinner. 1990. The behaviour of organisms: An experimental analy- sis. [42] Arron Smith and Monica Anderson. [n. d.]. Social Media Use 2018: A majority of Americans use Facebook and YouTube, but young adults are especially heavy users of Snapchat and Instagram. http://www. pewinternet.org/2018/03/01/social-media-use-in-2018/ [43] Andrew D. Smock, Nicole B. Ellison, Cliff Lampe, and Donghee Yvette Wohn. 2011. Facebook as a toolkit: A uses and gratification approach to unbundling feature use. Computers in Human Behavior 27, 6 (nov 2011), 2322–2329. https://doi.org/10.1016/J.CHB.2011.07.011 [44] Tasos Spiliotopoulos and Ian Oakley. 2013. Understanding Motivations for Facebook Use: Usage Metrics, Network Structure, and Privacy. [45] Diana I Tamir and Jason P Mitchell. 2012. Disclosing information about the self is intrinsically rewarding. Proceedings of the National"
    }, {
      "page": 8,
      "region": {
        "x1": 317.95501708984375,
        "x2": 559.4228515625,
        "y1": 97.41058349609375,
        "y2": 112.5780029296875
      },
      "text": "Academy of Sciences 109, 21 (2012), 8038—-8043. [46] University of California. [n. d.]. Facebook Survey. http://www.ece."
    }, {
      "page": 8,
      "region": {
        "x1": 317.95501708984375,
        "x2": 559.4230346679688,
        "y1": 117.3355712890625,
        "y2": 132.50299072265625
      },
      "text": "ucdavis.edu/~anayakpr/Facebook_Research/FB_S08.pdf [47] W. Richard Walker, John J. Skowronski, and Charles P. Thompson."
    }, {
      "page": 8,
      "region": {
        "x1": 334.843994140625,
        "x2": 558.7147216796875,
        "y1": 137.2615966796875,
        "y2": 162.3909912109375
      },
      "text": "2003. Life is pleasant–and memory helps to keep it that way! Review of General Psychology 7, 2 (2003), 203–210. https://doi.org/10.1037/ 1089-2680.7.2.203"
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 577.7723999023438,
        "y1": 167.14959716796875,
        "y2": 222.1669921875
      },
      "text": "[48] We Are Social and Hootsuite. 2018. Total number of Facebook users in the United Kingdom (UK) in January 2018, by age group and gender (in millions). https://www.statista.com/statistics/507417/ number-of-facebook-users-in-the-united-kingdom-uk-by-age-and-gender/ [49] Zephoria. 2018. The Top 20 Valuable Facebook Statistics – Updated July 2018. https://zephoria.com/top-15-valuable-facebook-statistics/"
    }, {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 22 Page 9"
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 116.56490325927734,
        "y1": 143.8108673095703,
        "y2": 150.23699951171875
      },
      "text": "REFERENCES"
    }
  }]
}