{"authors": "Kurtis Danyluk; Bernhard Jenny; Barrett Ens; Wesley Willett", "pub_date": "", "title": "A Design Space Exploration of Worlds in Miniature", "abstract": "Figure 1: The seven design dimensions we explore for Worlds-in-Miniature (WiMs) alongside sketches of two potential future WiMs. The left sketch shows a WiM that spans the viewer's body, while the right shows a WiM-based overview+detail navigation tool.", "sections": [{"heading": "INTRODUCTION", "text": "As extended reality (XR) devices become more portable and powerful there is an opportunity for applications that have been previously limited to static desktop and laboratory spaces to move out into the world. Worlds-in-Miniature (WiMs) are one such technique that have been used for decades in the context of virtual reality (VR) as a tool for navigation and object manipulation, but which also have many promising applications in systems across the spectrum of virtuality [28]. As XR devices become less tethered to desktop computers, so too do the potential uses for WiMs.\nThere is not only renewed interest, but there is also a great potential for WiMs given the appearance of AR-capable chip sets on ubiquitous handheld devices -already being used in applications like Google Maps 1 . Location-based games like Pokemon Go could also beneft from minimap WiMs, and outdoor hobbies like hiking can take advantage of the 3D nature of WiMs to improve viewer perception [25]. In architecture, VR walkthroughs are becoming more common [36] and WiMs have a long history as a tool for navigating virtual buildings. Now is a time to revisit prior work and learn from it, providing a more structured view of WiM design which can inform future systems.\nTo better understand the design and use of WiMs, we collected and analysed 25 examples of WiMs from the research literature to derive a design space based on seven design dimensions: size-scopescale, abstraction, geometry, reference frame, links, multiples, and virtuality. We explain these dimensions in detail, and discuss how changes to individual dimensions infuence the fnal uses of a WiM.\nUsing these design dimensions, we compare and contrast different approaches for creating WiMs and identify the importance of specifc design choices. Based on this comparison we identify opportunities not covered by prior systems and use these to propose novel WiM designs (Figure 1). For designers, our framework highlights alternatives to traditional WiM archetypes and surfaces a variety of design choices and trade-ofs. Meanwhile, for researchers, our collection of related work can help facilitate new discussions about the value of WiMs and stimulate new designs.\nThis paper makes several contributions. First, we propose an expanded defnition of WiMs that better captures their presence across the XR spectrum. Second, we identify a set of design dimensions that help describe and diferentiate the forms and features of a diverse range of WiMs. Third, we use our design space to identify gaps in the existing literature and propose example systems that illustrate potential future applications of WiMs.", "n_publication_ref": 4, "n_figure_ref": 1}, {"heading": "BACKGROUND", "text": "Scale models have served as visualisation tools in many contexts throughout history because they make it possible to view, inspect, and modify environments from perspectives and scales unattainable by human viewers. For example, the Musée des Plans-Reliefs 2 in Paris, houses dozens of scale relief models, built in the feld to give Louis XIV and his military planners a clearer perspective of French cities and fortifcations. In architecture there is a long history of using scale models to better explore, situate, and communicate about the forms of future buildings [20]. For example, the architect 1 https://arvr.google.com/ar/ 2 http://www.museedesplansreliefs.culture.fr/ Antoni Gaudí 3 famously made 1:25 and 1:10 scale plaster models of his designs to better understand their form 4 . As such, it comes as little surprise that scale models have also made their way into virtual environments, where their construction is signifcantly easier.\nWorlds-in-Miniature were frst introduced in the context of VR by Stoakley et al. [44] who defned them as:\nA user interface technique which augments an immersive head tracked display with a hand-held miniature copy of the virtual environment. In addition to the frst-person perspective ofered by a virtual reality system, a World in Miniature ofers a second dynamic viewport onto the virtual environment. Objects may be directly manipulated either through the immersive viewport or through the three-dimensional viewport ofered by the WIM.\nThis represents the intended use of the original system as an interaction metaphor designed for object manipulation, but it limits WiMs to VR and object manipulation. More recently Cofey et al. [11] defned WiMs as such:\nThe core WiM concept is to provide a small (e.g. handheld) model of the virtual environment that can act as both a map and an interaction space as the user explores the large-scale environment -essentially a world within a world. This defnition acknowledges that WiMs are used as a generic interaction space, and more than just an object manipulation tool, but fails to acknowledge that WiMs feature at a variety of sizes, and in mediums beyond just VR. To capture these systems we propose a more inclusive defnition:\nA World-in-Miniature is a scale replica of an environment that is linked to the original space via interaction or virtual feedback -an interactive world within a world. This defnition encompasses WiMs' use as a tool for object manipulation in VR [44] as well as examples that transcend object manipulation in VR and include interactions, such as navigation and IoT control. This includes example WiMs created by researchers like Kalkusch et al. [22], who created an augmented reality (AR) WiM that sat on the viewer's wrist, like a watch, and was used for indoor path fnding. Mulloni et al. [29], meanwhile, used AR miniatures to support indoor navigation by giving turn-by-turn navigation instructions at key \"info\" points. Seo et al. [40] combined both physical models and handheld AR to create WiMs that functioned as a smart home controller. In these cases the WiM is no longer just an object manipulation technique, the replica has instead been turned into an interaction space where operations on the replica are refected in the environment they represent, and changes to the outside environment are refected in the WiM. Some of this has made its way to commercial applications -in 2019 Google added AR support to their Maps application and featured many of the interactions explored by Mulloni et al. [29], using a WiM to support navigation between points of interest and placing AR navigation cues into the environment at these locations.\nBeyond creating WiMs for diferent applications and in new spaces, there has also been a broader efort to improving the replica component of WiMs. To name just a few examples, Wingrave et al. [49] created a WiM that could be dynamically scrolled and scaled to better support large scale environments. Trueba, Andujar, and Argelaguet [47] automatically reduced occlusion in WiMs by dynamically exploding buildings [1]. Bonsch, Freitag, and Kuhlen [6] explore the automatic generation of WiMs in realistic environments.\nAs WiMs often function as 3D maps themselves, their designs have also drawn considerable inspiration from the 3D mapping literature. For example, the interactive exploded views demonstrated by Niederauer et al. [31] were later used by Chittaro et al. [9] in their WiM to allow viewers to disassemble buildings by foors. Additionally, guidelines for generalisation like those written by Shea and McMaster [41] are just as relevant for designing WiMs as they are in the space of digital cartography. Further, more recent literature such as the fexible multi-scale deformations demonstrated by Pasewaldt et al. [33] allow viewers to bend and distort a 3D map and allow viewers to view a single WiM from multiple angles and resolutions.", "n_publication_ref": 17, "n_figure_ref": 0}, {"heading": "METHODOLOGY", "text": "We set out to derive a descriptive, comparative, and generative [2] design framework for WiMs -inspired by previous frameworks which have provided terminology for visualisation systems [37], helped organise existing systems [35], and envision new systems [16]. To best identify our fnal dimensions we frst collected papers that contained systems that the authors identifed as WiMs. We collected papers by performing a reverse citation search on the original WiM paper [44], followed by a tree search on collected papers that identifed themselves as containing a WiM. We chose to stop collecting new papers when this process saturated and stopped identifying new papers that contained a WiM, or a system like a WiM. These papers formed the core 25 papers that we based our design dimensions on. While this set is not exhaustive, we believe that it represents a broad representative sample of the space.\nFrom this set of papers we derived our framework through open coding. Initially, the frst author individually coded a small set of papers using a web-based whiteboard tool. All of the coauthors then reviewed these codes, which were adjusted based on group consensus to establish a basis for coding. The frst author then coded the remainder of the papers based on that standard. The other coauthors periodically verifed these groupings to ensure consistency throughout the process. Based on the coding results, we frst identifed 23 potential design dimensions, then refned the fnal set by combining orthogonal dimensions, consolidating similar ones, and scoping our dimensions to just those that describe the form of the replica. Based on this process we combined inter-dependant dimensions like size, scale, and scope. We also generalised overly specifc dimensions into a more general form. While we had originally considered some interactions with WiMs, we decided to remove them from our design dimensions after acknowledging that the set of possible interactions with WiMs is a broad enough topic to merit a design space of its own. Using our fnal set of dimensions we then re-coded the WiMs from each of the original papers. A summary of this coding can be seen in Figure 2. Finally, after categorising and comparing the papers, we performed a general morphological analysis [38] to identify gaps within our paper set that present opportunities for new WiM designs.", "n_publication_ref": 6, "n_figure_ref": 1}, {"heading": "DESIGN DIMENSIONS", "text": "We identifed eight dimensions (size, scope, abstraction, geometry, reference frame, links, multiples, and virtuality) which together characterise the design of WiMs (Figure 1, Figure 2). Because of the tight interrelation between size and scope we consider them together, along with the associated notion of scale. Although other possible design dimensions likely exist, we found that this set captured much of the diversity present in the current research literature.\nSize-Scope-Scale encompasses three interdependent properties of a WiM. Size describes the physical dimensions of the miniature replica itself. For example, a replica that can be held in a viewer's hands may be 30 cm in diameter (Figure 3). Scope describes how much of the world is represented by the replica. For example, the replica could show just a single object, or it could show an entire city (Figure 4). Scale describes the relationship between the size of the model and the space it represents. These relationships are connected -if one is changed, at least one other must also change. For example, if the size of the replica increases from 1 × 1 m to 3 × 3 m the scale would either need to be 3 times larger, the scope would need to encompass more objects, or some combination of the two.\nExamples of WiMs exist at a wide variety of sizes, scales, and scopes. One of the smallest is the WiM bounded by a phone made by Mulloni et al. [29] (Figure 3a) measuring only a couple of centimetres across. Most common is a small handheld size; this is the size of the original WiM [44] and is shared by many modern examples, including those developed by Cofey et al. [11] (Figure 3b). At the other end of the spectrum, the WiMs in Gazcón et al. 's ARGeo tool [18] (Figure 3f) exist as an overlay on top of the real visible environment, making the replica efectively hundreds of meters across. The scope of what is contained within a WiM is similarly broad; slice WiM [11,12] (Figure 4a) was designed for exploring single objects, and was used to navigate within a heart. On the other hand, Li et al.'s large-scale astrophysical environment [26] (Figure 4h) includes WiMs which operate at a galactic scope, and allow viewers to traverse between stars.\nAbstraction describes how the replica has been transformed compared to the space it references. There are many diferent abstraction operations that can be performed on a WiM. However, within the papers we surveyed we noted authors creating digital copies of the real world, cartographically generalising , geometrically simplifying, and reducing the scene to just areas or lines to render simplifed versions of the original space (Figure 5).\nWithin VR it was common for the WiM to be a perfect digital copy of the environment it represented, often relying on the exact same models (as with the miniature rooms used by Pausch et al. [34] (Figure 5a). In AR a digital copy of the real environment was often used instead. In these cases, real world features are typically recreated as a digital model either manually or via automated techniques like photogrammetry. An example of this is the models of famous (a) a very small hand-sized WiM [29], (b) a small handheld WiM [11], (c) a moderate desksized WiM [49], (d) a large meeting table-sized WiM [46], (e) a very large storage closet-sized WiM [24], (f) a huge park-sized WiM [18]. Images reused with permission. : WiMs increasing in Scope: (a) a WiM that shows a single object [11], (b) a WiM that shows a single room [34], (c) a WiM that shows one foor of a building [6], (d) a WiM that shows an entire building [21], (e) a WiM that shows a city block [49], (f) a WiM that shows a city-sized natural park [18], (g) a WiM that shows a country [30], (h) a WiM showing a star system [26].", "n_publication_ref": 22, "n_figure_ref": 11}, {"heading": "Object", "text": "Images reused with permission.\nbuildings used by Tatzgern et al. [45] (Figure 5b). A few examples, like the smart home controller made by Seo et al. [40] (Figure 5c) even involved small physical reproductions of the environment.\nTo reduce clutter and complexity, many systems have used geometric simplifcation for removing and simplifying details in the replica. For instance, the WiM used by Bell et al. [4] (Figure 5d) simplifes most large objects into cubes. In other cases, cartographic generalisation operations can be employed to make replicas more \"map-like\". Most commonly this involves simplifying elements of the replica into points, lines, and areas and adjusting their relative visual prominence [27]. Some systems, like Nam et al. 's World-in-Wedges [30] (Figure 5e) only lightly abstract the WiM. However, more extreme cases may remove almost all content, as in Chittaro et al. 's builing cross-sections [9] (Figure 5f), which excises almost all geometry except for open areas, and Höllerer et al. 's replicas [21] (Figure 5g) which represent spaces using minimalist wireframes.\nGeometry describes how the replica is shaped, and is particularly relevant for replicas of large spaces that need to be clipped in order to remain a manageable size, as well as those with many fne details. When the extent of the replica needs to be constrained to a given size, prior systems have employed a variety of approaches including clipping the replica using simple shapes like cylinders or spheres. More complex geometries, like clipping the replica to the boundaries of a building or a room in the model, or to the extent of the current workspace, are also possible. Additionally, non-Euclidean, or disjoint geometry can be used to create efects like exploded building views [31] and curved geometries can be used to create deformations like those demonstrated by Pasewaldt, Trapp, and Döllner [32].\nMost WiMs in the collected papers featured simple continuous geometry. Closely clipped WiMs like Nam et al.'s [30] (Figure 6a WiMs with increasing Abstraction: (a) a perfect recreation of the virtual room [34], (b) a digital recreation of a real building [45], (c) a physical copy of a real space [40], (d) geometric simplifcation of a room, objects are reduced to just cubes [4], (e) a satellite image that has undergone cartographic generalisation to look like a map [30], (f) a building that has been reduced to just areas [9], (g) a building that has been reduced to just lines in a wireframe [21]. Images reused with permission.", "n_publication_ref": 17, "n_figure_ref": 7}, {"heading": "Clipped to Focus", "text": "Clipped to Simple Shape", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Clipped to Workspace", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Disjoint", "text": "In nite Deformed\na b c d e f\nFigure 6: WiMs with various Geometries: (a) a WiM clipped to the object of interest [30], (b) a WiM clipped to a cylinder [46], (c) a WiM clipped to a work table [7], (d) a WiM with disjoint geometry, the roof of the building is separated to reduce occlusion [9], (e) a WiM that extends infnitely [26], (f) a 3D map that is deformable [32]. Images reused with permission.\nthe viewer -in this case their WiM is constrained to just show the was for authors to create WiMs with discontinuous, or irregular country, and not adjacent details like neighbouring countries. Other geometries. Chittaro et al. 's [9] (Figure 6d) BreakAway Map shows authors limited the WiM to a simple shape, for example the WiM how disjoint geometry can be used to separate a building into parts created by Drey [46] (Figure 6b) is rounded as though it is contained to reduce occlusions by automatically splitting the building apart within a cylinder or sphere. It was also common for authors to by foor. Li et al.'s [26] (Figure 6e) Scalable WIM is not bounded bound their WiM to the dimensions of their work space (either at all, expanding infnitely into the scene. While not actually a real or virtual). For example, Arch-Explore by Bruder et al. [7] WiM, Pasewaldt et al. [32] (Figure 6f) create a deformable map (Figure 6c) is constrained by the table it is placed on. Less common that can be bent like a continuous rubber sheet -illustrating how (a) a WiM that is placed on the viewers wrist [22], (b) a WiM that sits in the top right of the viewers view [48], (c) a WiM that sits on a handheld clipboard [44], (d) a WiM that sits on a hand held device [29], (e) a WiM that is embedded in a physical model [40], (f) a WiM that hovers above the object it represents [45], (g) a WiM that has no reference frame [26]. Images reused with permission.", "n_publication_ref": 18, "n_figure_ref": 6}, {"heading": "Pericutaneous", "text": "deforming WiMs could allow viewers to view spaces from multiple perspectives at once. Reference Frame describes where the replica is positioned and how it is oriented. For instance, it was common to align the WiM based on the physical work table or zone that the WiM was situated in. While we observed that in most cases the reference frame for position was also the reference frame for orientation, this wasn't always the case. For example, the WiM made by Bell et al. [4] based the horizontal rotation of the WiM on the surrounding room, but determined its position from the viewer. Additionally, some systems, like GeoGate [42], had several reference frames. GeoGate used a handheld token for position, but was oriented with respect to the tabletop environment.\nWhen coding our sample papers we organised them based on the viewer's proximal space [8]. WiMs in a viewers pericutaneous space are directly on their body, such as the WiM created by Kalkusch et al. [22] (Figure 7a) that showed a map of the foor on the viewer's wrist, like a watch. WiMs in the peripersonal space arrange themselves based on the viewer's position, but aren't directly attached to the viewer -for instance, the city map made by Veas et al. [48] (Figure 7b) always sat in the top right of the viewer's view in a heads-up display, the WiM made by Stoakley et al. [44] (Figure 7c) sat on a clipboard carried by the viewer, and the foor map made by Mulloni et al. [29] (Figure 7d) was shown on the face of a mobile phone. Finally, WiMs in the viewer's extrapersonal space are positioned without reference to the viewer -Seo et al. 's [40] (Figure 7e) smart home controller was positioned based on a physical model, Tatzgern et al.'s [45] (Figure 7f) building explorer aligned their WiM with the building the WiM is a replica of, and the solar system explorer by Li et al. [26] (Figure 7g) had no solid reference at all, letting the WiM foat freely.\nLinks describe approaches that explicitly connect the replica to the environment (Figure 8). An example of a link would be a building that is highlighted in both the replica and in the environment. The most common link we found was a view frustum in the replica showing the position and orientation of the viewer. Other forms of links we observed include leader lines, and labels.\nThe majority of WiMs we reviewed did not feature any links at all. Of those that did feature links there was a small variety (Figure 8). A few systems, including Pausch et al. 's 1995 work [34] (Figure 8a) superimposed view frustrums showing the position and orientation of the viewer in the replica. Several others used view planes -introduced in Cofey et al. 's Slice WIM [11] (Figure 8b) -to slice segments of the replica and control the visible area of the scene. Similarly, Staford et al. [43] (Figure 8c) used god hands (enlarged hands that appear in the environment to show where a viewer is pointing on the replica) as one of their god-like interactions. Leader lines that directly tether components of the replica to the corresponding location in the environment also appear in several systems, including Tatzgen et al.'s [45] (Figure 8d). Finally, WiMs can use text to directly identify components, as in Li et al. 's Scalable WIM [26] (Figure 8e) which labels stars in both the replica and space. While these aren't the only possible forms that links can take, they are the ones that we observed in our set of sample papers.\nMultiples characterize cases in which a WiM system includes multiple replicas instead of just one (Figure 9). This can be multiple", "n_publication_ref": 15, "n_figure_ref": 15}, {"heading": "View Frustums", "text": "View Planes God hands Leader Lines Labels a b c d e\nFigure 8: Several examples of Links on WiMs: (a) a view frustum showing the viewer's position and orientation in the scene [34], (b) a slicing plane controlling the viewable space [11], (c) a god hand indicating where a viewer is pointing in the environment [43], (d) leader lines connecting components of the replica to their real twin [45], (e) labels identifying components of the WiM [26]. Images reused with permission.", "n_publication_ref": 5, "n_figure_ref": 1}, {"heading": "Recursive Small Multiples a b", "text": "Figure 9: Examples WiMs with Multiples: (a) a recursive WiM, a smaller copy of the replica is embedded within the replica [5] (the red god hand and the grabbed building are replicated in the WiM), (b) a WiM with small multiples, each multiple shows the environment from a diferent angle [45]. Images reused with permission.  [12], (c) desktop VR [6], (d) headset AR [46], (e) projected AR [24], (f) handheld AR [29]. Images reused with permission.", "n_publication_ref": 7, "n_figure_ref": 1}, {"heading": "Headset VR", "text": "replicas all at the same scale, showing diferent states of the WiM, or it can involve one larger, main replica with several small replicas showing subsets of the environment. Only a small minority of papers showcased multiples, but they were used for a variety of applications. The main use was to show subsets of the scene at diferent orientations or positions. We observed two types of multiples. The frst was recursive multiples, where a smaller version of the replica was embedded within the replica. This was shown by Bluf and Johnston [5] (Figure 9a) who used a camera copy of the environment to create an efectively infnitely recursive WiM using the Droste efect. The other form of multiples we observed were small multiples, like those used by Tatzgern et al. [45] (Figure 9b) who placed replicas of the replica at diferent rotations to allow the viewer to see a building from many sides at once.\nVirtuality describes the WiM's position within the XR spectrum [28]. While WiMs originally started as a purely VR technique, they have since expanded to include examples across the XR spectrum, including cases in which the replica itself is a physical object.\nThe frst WiM by Stoakley et al. [44] was created using headset VR, and many afterwards have been as well -including recent implementations such as Bluf and Johnston's [5] (Figure 10a). However, examples exist for a variety of other platforms including Cave VR [12] (Figure 10b), desktop VR [6] (Figure 10c), headset AR [46] (Figure 10d), projected AR [24] (Figure 10e), and handheld AR [29] (Figure 10f) systems.", "n_publication_ref": 10, "n_figure_ref": 8}, {"heading": "TRENDS AND GAPS IN CURRENT WORLDS-IN-MINIATURE IMPLEMENTATIONS", "text": "We observed a number of relationships between the various dimensions, as well as gaps in the literature for both individual dimensions and combinations of dimensions. Here we identify some of these patterns and gaps, and we will later look more closely at potential applications that fll these gaps. Size vs. Scope. While we have identifed size, scale, and scope as a set of interdependent dimensions, there is a strong positive correlation between the size of a WiM, and its scope -with developers typically using larger WiMs to represent larger and more complex regions (Figure 11). By contrast, the set of systems we examined contain no examples of small or very small WiMs whose scope showed anything larger than a single building. Surprisingly we also saw no examples of large WiMs whose scope was smaller than the foor of a building, although the interactive virtual globes in tools like Google Earth VR [23] clearly demonstrate the value of this combination. While in most cases it is practical to pair large sizes with broad scopes there may be opportunities where straying from these pattern can be benefcial. As a temporary, or transitional state, having a large WiM with a small scope could be used to highlight an object of interest, such as greatly expanding the sign for a bus stop in the replica as the viewer gets within viewing distance of the actual sign. As another example, if many small multiples of individual small WiMs with broad scopes are used together, the size of each can be controlled with a focus + context operation like Size vs. Reference Frame. There is a common relationship between the size of a WiM, and the reference frame it has been given (Figure 12). A WiM with a reference frame that is close to, or a part of the body (pericutaneous, peripersonal) is more likely to also be small. While a WiM with a reference frame that is a part of the environment, or the environment itself (extrapersonal), is more likely to be large. Both of these can be explained from a practical standpoint, a WiM that is several meters in diameter would be unwieldy when placed on a viewers wrist. Further, if a WiM that was only a few centimetres in diameter was placed on a boardroom table many meters wide there would be a large amount of wasted space. However, these impracticalities can be overcome. For example, Tatzgern et al. [45] explore a small WiM that has an extrapersonal reference frame by physically distancing the replica from the reference frame -while the referent is large, its apparent size is comparable to the WiM. At the other end of the spectrum, a large WiM can be placed within a viewer's personal space by distributing it around their body -for instance, by projecting it in a torus around their torso, or distributing it across their limbs (which we explore in subsection 6.2).\nSize vs. Geometry. We observed that in most cases small WiMs are tightly bounded, often clipped to just the object of interest itself (Figure 13). In contrast, larger WiMs are often bounded by a feature of the environment (such as a work table ). Although WiMs at all sizes are bounded by simple shapes. At the extreme end, any unbounded WiM showing a large area or object will consume considerable space -as it has no solid boundary to constrain it. However, even when considering a large WiM it can be benefcial to restrict the geometry to just the object of interest. For example, for a team collaborating around a WiM of a to-be-built building, reducing the WiM to just the building of interest could help manage occlusion from multiple vantage points. Abstraction vs. Virtuality. WiMs made for VR tend to feature less abstraction than those made for AR (Figure 14). We suspect that this has more to do with the current capabilities of the respective technologies than a practical relationship between the dimensions. It is currently much easier to create a replica that is a perfect or near perfect copy of the environment in VR than it is in AR. However, as technologies like photogrammetry improve, and as AR headset technology matures and becomes more powerful this gap is likely to close. With the ability to easily create realistic views of real places, applications like third person bird's eye views [17] will likely become more realistic outside of VR. On the fip side, while VR instances of WiMs are currently able to feature replicas that are perfect recreations of the VR environment, simplifed or generalised replicas can still help viewers focus on the most important features of the replica [41].\nLinks. Links are a heavily underrepresented dimension, with 16 out of 25 of the WiMs we reviewed not featuring any explicit links between the replica and the space (Figure 16). Further, the variety of links that we did observe was not extensive -including only view frustums, view planes, god hands, leader lines, and labels. The sparsity of examples indicates that there remain many exciting opportunities in this space. One medium which already features a wide variety of links is video games [13] and many examples of linking and pointing techniques from this domain seem likely to work well with WiMs. These include approaches like diegetic cues, which are common in video games and could provide simple and semantically meaningful links between WiMs and environments. For example, a WiM of a city street could turn on the streetlamps along the viewer's path to unobtrusively show their progress in the real space.\nMultiples. Similarly, multiples are another heavily underrepresented dimension with only 4 out of the 25 papers we reviewed featuring them (Figure 17). These few examples we saw focused on showing either multiple views of the same building from diferent orientations [45] or location based subsets [14]. However, given the widespread and successful use of small multiples techniques in data visualization tools, there are likely many more exciting possibilities for WiMs that use multiples. For example, a large single replica combined with small multiples [15] of it could be used to show the history of a viewer's interaction with a WiM.\nReference Frame. While WiMs of all sorts featured extrapersonal reference frames, very few utilised peripersonal or pericutaneous reference frames (Figure 15). Those few that did tended to be used with small, tightly scoped, or tightly clipped WiMs. There exists ample space to explore WiMs that sit within the viewer's personal space, along many dimensions (as noted above in Size vs. Reference Frame).\nOther. Interestingly, several pairs of dimensions in our framework did not show any obvious relationship to one another. Abstraction and geometry were one such pair -during the process of abstraction the available geometry of the WiM may also be reduced. For example, if a WiM has been cartographically generalised to only include the roads of a scene, then the geometry will appear to be clipped to the focus (in this case the roads) even if the chosen geometry is actually less restrictive. Conversely, a WiM showing a building that is bounded to a short cylinder will appear as though the roof has been abstracted away.\nAnother pair that displayed only a loose connection was geometry and virtuality. The means used to create the virtual environment infuences the possible geometry of a WiM. For example, due to the limited projection space it is more difcult to create an infnite WiM by using projected AR then it would be to create an infnite WiM using headset VR. However, many of the examples of simplifed geometry we observe refected historical technical limitations of XR devices rather than contemporary ones.", "n_publication_ref": 8, "n_figure_ref": 7}, {"heading": "ENVISIONING FUTURE WORLDS-IN-MINIATURE", "text": "To help demonstrate the generative utility of our framework, in this section we illustrate several novel WiMs described as a function of our design dimensions. In section 5 we identifed a number of gaps present within the papers we reviewed. We ft our proposed WiMs within those gaps, addressing unique design challenges.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Example #1: Shared Spatial Highlights", "text": "When analysing the trends and gaps within current WiMs we noted that the majority of WiMs don't feature links. To help fll that gap, we propose a WiM that uses highlighting in a way that would Figure 18: Example #1: Shared Spatial Highlighting. In the fgure a viewer is pointing at the roof of a WiM of the completed building and it is highlighted. The roof is also highlighted in the construction site, despite not being built yet.\nbe difcult without a WiM (Table 1). In this example the WiM features an architectural model of a building that is still under construction. At the construction site the replica can be used to highlight components of the unfnished building. When a viewer selects a piece of the building on the replica, the corresponding component of the building in the environment is also highlighted.\nIn circumstances where a component is not shared between the two (such as a part of the building that is not built yet, or a detail of the building too small to be added to the model) the area where that component would be is instead highlighted. In Figure 18 a viewer is selecting the roof at the top of the replica, in the background they can see the roof being highlighted on a AR overlay of the building. By using these shared spatial highlights a viewer can get an idea of the footprint of a building on-site during construction. For example, when preparing marketing material for the new building, a Realtor could use the highlights to determine what pieces of the skyline will be visible once the building is complete. This example was inspired by the use of scale models in architecture [20]. As a result, our choices for many of the design dimensions (including size, scope, abstraction, and geometry) refect the conventions and properties of the physical models produced by architecture frms. For the reference frame, we chose free referent,  refecting the fact that scale building models can be used at a variety of locations both at a building site or (more frequently) at the design studio and don't require a specifc spatial relationship with the building. Finally, we imagined this example as a headset AR application, which would allow the viewer to use both hands to interact with the model and with other tools, and could support deployment in construction settings.", "n_publication_ref": 1, "n_figure_ref": 2}, {"heading": "Example #2: Body Based WiM", "text": "In the existing literature, we noted the absence WiMs that were both pericutaneous and had a large size (Table 1). To examine this unique combination, we propose a system that takes advantage of the viewer's entire body to host a large WiM (Figure 19). In this example the buildings of a college campus are spread across the viewer's body. Buildings that are close to the viewer are placed on parts of their body that are easy to reference (like their forearms) whereas buildings that are far away are placed on less reachable, but still visible parts of their body (like their shins). Buildings behind or otherwise outside the viewer's feld of vision are likewise shifted to less-visible locations on the body (such as their calves) where they can be seen peripherally. This approach cartographically generalises important landmarks including prominent buildings using an approach similar to the automatic tourist maps proposed by Grabler et al. [19], highlighting the most important features of the campus and de-emphasising the spaces in between them. By viewing the WiM with a headset AR device the viewer could easily reference buildings in their immediate vicinity, while maintaining a peripheral knowledge of the entire campus. This could be particularly useful while the viewer is walking, allowing them to use their body's sense of proprioception [8] to reference the replica. Such an approach could also be useful in crowded spaces, ftting tightly to the viewer's body when most large AR objects would be occluded or intersected by the surrounding environment. On the left side of the phone is a replica of the entire mountain region. On the Right side is another smaller replica that is showing just the trail segment the viewer is on. Blue pins show the viewers position, and the red pin shows their destination.", "n_publication_ref": 2, "n_figure_ref": 1}, {"heading": "Example #3: Overview + Detail Multiples", "text": "Our analysis also highlighted a shortage of WiMs that incorporated multiples (Table 1). To prompt the development of more systems that incorporate multiple simultaneous WiMS, we propose an interface that uses multiples to show a mountain hike at two levels of detail (Figure 20) in the style of a traditional overview+detail visualisation [10]. In this example, the system includes two multiples, each showing the same hiking route. The large multiple on the left side of the screen (Figure 20) shows the entire mountain that is being hiked, while the smaller multiple on the right side of the screen (Figure 20) is clipped to focus on just the current trail segment. This pairing would allow viewers to simultaneously see their progress up the mountain as well as a more detailed bird's eye view of the portion of the hike that they are immediately concerned with. Mobile AR might appropriate for this application as a phone or other device could be easily stowed by the viewer during more physically involved portions of their hike. Finally, this WiM uses the viewer as its reference frame so that it is available throughout the hike.", "n_publication_ref": 1, "n_figure_ref": 3}, {"heading": "WiM Opportunities by Application Area", "text": "In addition to our specifc example WiMs, we provide more general advice on choosing dimensions for a WiM based on application domain, based on our observations from prior work. We observed 5 distinct application domains amongst the WiMs we coded -wayfnding, collaboration, visualisation, navigation, and control space (Table 2) -and discuss two important dimensions to consider for each application domain.\nWayfnding: In a wayfnding application the WiM serves as an overview that viewers use to identify and follow paths between locations. Because wayfnding tools typically need to move through space along with the viewer, WiMs designed for this purpose are likely to lend themselves to pericutaneous or peripersonal reference frames. Similarly, they may beneft from small sizes and constrained scopes that reduce overlap with and occlusion of the environment.\nCollaboration: In applications that use collaborative WiMs, multiple viewers may examine or interact with the same replica simultaneously. As a result, we expect that larger replicas with extrapersonal reference frames will usually be preferable. Further, clipping the geometry to a focus area or simple shape can allow multiple viewers to more freely move and interact around the WiM.\nVisualisation: The visualization applications we observed cover a wide range of data types, visual encodings, and contexts of use, making general guidance for these systems difcult. However, the widespread use of techniques like small multiples [15] and brushingand-linking [39] in visualisation more broadly strongly suggests the value of incorporating multiples and links in WiM systems intended to support data exploration and analysis.\nNavigation: WiMs designed for navigation allow viewers to change their position in the full-sized (typically virtual) environment by using the miniature replica. A key concern is ensuring that the scale of the replica allows for precise pointing [49]. In addition, non-euclidean or distorted geometries that enable viewers to navigate to occluded areas, including building interiors [9], may be advantageous.\nControl Space: A WiM designed as a control space enables the viewer to control elements of their environment using the replica. If the replica and environment difer considerably in scale it can be useful to use abstraction to increase the size or visibility of interactive elements, or to simplify away non-interactive ones. As with navigation, geometries that reduce occlusion can increase viewers' ability to access and interact with more of the control space at once.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "CONCLUSION", "text": "Worlds-in-Miniature represent a promising and extremely relevant area for XR research, and one which is well-positioned to build on approaches from a variety of related felds. Not only are WiMs one of the earliest interaction metaphors introduced for virtual reality, they also share many properties with the kinds of overview+detail interfaces frequently used in data visualisation. Because they often take the forms of maps and terrain models, they also have the potential to draw on recent advances in digital cartography. At the same time, the vast space of diferent WiM designs suggests new uses in a wide variety of diferent application areas.\nOur framework for describing WiM systems showcases the diversity of past approaches, but also highlights just how much of the design space remains unexamined. Many of these unexplored points, including the examples in section 6 refect promising opportunities for near-term research and design. Others highlight challenges both in our current tools and technology. For example, varying the level of abstraction in WiMs still represents a challenge in both VR and AR, and most conceptual abstraction (and even much of the visual abstraction) used in current systems is still handled manually by designers. Meanwhile, creating truly realistic WiMs remains challenging because current platforms lack both the data and processing power necessary to create high-fdelity representations of most scenes. This is especially challenging for augmented-and mixed-reality applications, given the host of challenges associated with capturing, rendering, and updating visually accurate and up-to-date representations of physical environments. However, rapidly maturing photogrammetry and real-time scene reconstruction approaches mean that realistic live WiMs of real-world spaces will likely be possible in the near future. Parallel advances in XR headsets and related display technologies will also make using these WiMs in real-world environments increasingly practical. With that in mind, exploring new WiM designs, interactions, and application areas represents a rich area for research both now and for the foreseeable future.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "This research was undertaken, in part, thanks to funding from the Canada Research Chairs Program. Thank you to all of our colleagues who helped provide examples of WiMs in the research literature, in popular media, and around the world, and who granted permission to reproduce their fgures.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Way-Finder: guided tours through complex walkthrough models", "journal": "Computer Graphics Forum", "year": "2004", "authors": "C Andújar; P Vázquez; M Fairén"}, {"title": "Designing interaction, not interfaces", "journal": "Association for Computing Machinery", "year": "2004", "authors": "Michel Beaudouin-Lafon"}, {"title": "Fisheye Menus. Association for Computing Machinery", "journal": "", "year": "2000", "authors": "B Benjamin;  Bederson"}, {"title": "An annotated situationawareness aid for augmented reality", "journal": "ACM Press", "year": "2002", "authors": "Blaine Bell; Tobias Höllerer; Steven Feiner"}, {"title": "Don't Panic: Recursive Interactions in a Miniature Metaworld", "journal": "ACM", "year": "2019", "authors": "Andrew Bluf; Andrew Johnston"}, {"title": "Automatic generation of world in miniatures for realistic architectural immersive virtual environments", "journal": "IEEE Virtual Reality", "year": "2016", "authors": "Andrea Bonsch; Sebastian Freitag; Torsten W Kuhlen"}, {"title": "Arch-Explore: A natural user interface for immersive architectural walkthroughs", "journal": "IEEE", "year": "2009", "authors": "Gerd Bruder; Frank Steinicke; Klaus H Hinrichs"}, {"title": "Extending a mobile device's interaction space through body-centric interaction", "journal": "Association for Computing Machinery", "year": "2012", "authors": "Nicolai Xiang 'anthony' Chen; Anthony Marquardt; Sebastian Tang; Saul Boring;  Greenberg"}, {"title": "The Interactive 3D Break-Away Map: a navigation and examination aid for multi-foor 3D worlds", "journal": "IEEE", "year": "2005", "authors": "L Chittaro; V K Gatla; S Venkataraman"}, {"title": "A review of overview+detail, zooming, and focus+context interfaces", "journal": "Comput. Surveys", "year": "2008-12", "authors": "Andy Cockburn; Amy Karlson; Benjamin B Bederson"}, {"title": "Slice WIM: a multi-surface, multi-touch interface for overview+detail exploration of volume datasets in virtual reality", "journal": "", "year": "2011", "authors": "Dane Cofey; Nicholas Malbraaten; Trung Le; Iman Borazjani; Fotis Sotiropoulos; Daniel F Keefe"}, {"title": "Interactive Slice WIM: Navigating and Interrogating Volume Data Sets Using a Multisurface, Multitouch VR Interface", "journal": "IEEE Transactions on Visualization and Computer Graphics", "year": "2011-10", "authors": "Dane Cofey; Nicholas Malbraaten; Bao Trung; Iman Le; Fotis Borazjani; Arthur G Sotiropoulos; Daniel F Erdman;  Keefe"}, {"title": "A Visual Interaction Cue Framework from Video Game Environments for Augmented Reality", "journal": "Association for Computing Machinery", "year": "2018", "authors": "R Kody; Terrance Dillman;  Tin Hoi; Anthony Mok; Lora Tang; Alex Oehlberg;  Mitchell"}, {"title": "Worldlets: 3D thumbnails for 3D browsing", "journal": "Association for Computing Machinery", "year": "1998", "authors": "Todd Elvins; R David; Rina Nadeau; David Schul;  Kirsh"}, {"title": "Small Multiples, Large Singles: A New Approach for Visual Data Exploration", "journal": "Computer Graphics Forum", "year": "2013", "authors": "Jarke J Stef Van Den Elzen;  Van Wijk"}, {"title": "Ethereal planes: a design framework for 2D information space in 3D mixed reality environments", "journal": "Association for Computing Machinery", "year": "2014", "authors": "Barrett Ens; Juan David Hincapié-Ramos; Pourang Irani"}, {"title": "Intuitive Control of Bird's Eye Overview Images for Navigation in an Enormous Virtual Environment", "journal": "ACM", "year": "1998", "authors": "Shinji Fukatsu; Yoshifumi Kitamura; Toshihiro Masaki; Fumio Kishino"}, {"title": "Fieldwork in Geosciences assisted by ARGeo: A mobile Augmented Reality system", "journal": "Computers & Geosciences", "year": "2018-12", "authors": "F Nicolás; Juan M Gazcón; Ernesto A Nagel; Silvia M Bjerg;  Castro"}, {"title": "Automatic generation of tourist maps", "journal": "ACM Transactions on Graphics", "year": "2008-08", "authors": "Floraine Grabler; Maneesh Agrawala; Robert W Sumner; Mark Pauly"}, {"title": "Building with Data: Architectural Models as Inspiration for Data Physicalization", "journal": "Association for Computing Machinery", "year": "2017", "authors": "Carmen Hull; Wesley Willett"}, {"title": "User interface management techniques for collaborative mobile augmented reality", "journal": "", "year": "2001", "authors": "Tobias Höllerer; Steven Feiner; Drexel Hallaway; Blaine Bell; Marco Lanzagorta; Dennis Brown; Simon Julier; Yohan Baillot; Lawrence Rosenblum"}, {"title": "", "journal": "Computers & Graphics", "year": "2001-10", "authors": ""}, {"title": "Structured visual markers for indoor pathfnding", "journal": "IEEE", "year": "2002", "authors": "M Kalkusch; T Lidy; N Knapp; G Reitmayr; H Kaufmann; D Schmalstieg"}, {"title": "The Making of Google Earth VR", "journal": "Association for Computing Machinery", "year": "2017", "authors": "P Dominik; Evan Käser; Adam Parker; Mike Glazier; Matt Podwal; Chun-Po Seegmiller; Per Wang; Nadav Karlsson; Joanna Ashkenazi; Andre Kim; Matthias Le; Joshua Bühlmann;  Moshier"}, {"title": "Hands-free multi-scale navigation in virtual environments", "journal": "", "year": "2001", "authors": "Joseph J Laviola; Daniel Acevedo Feliz; Daniel F Keefe; Robert C Zeleznik"}, {"title": "Visibility perception and dynamic viewsheds for topographic maps and models", "journal": "ACM Press", "year": "2017", "authors": "Nico Li; Wesley Willett; Ehud Sharlin; Mario Costa Sousa"}, {"title": "Scalable WIM: Efective Exploration in Large-scale Astrophysical Environments", "journal": "", "year": "2006-09", "authors": "Yinggang Li; Chi-Wing Fu; Andrew Hanson"}, {"title": "Mapping, Society, and Technology", "journal": "University of Minnesota Libraries Publishing", "year": "2017", "authors": "Steve Manson"}, {"title": "A Taxonomy of Mixed Reality Visual Displays", "journal": "IEICE Trans. Information Systems", "year": "1994", "authors": "Paul Milgram; Fumio Kishino"}, {"title": "Indoor navigation with mixed reality world-in-miniature views and sparse localization on mobile devices", "journal": "Association for Computing Machinery", "year": "2012", "authors": "Alessandro Mulloni; Hartmut Seichter; Dieter Schmalstieg"}, {"title": "Worlds-in-Wedges: Combining Worlds-in-Miniature and Portals to Support Comparative Immersive Visualization of Forestry Data", "journal": "IEEE", "year": "2019", "authors": "Jung Who Nam; Krista Mccullough; Joshua Tveite; Maria Molina Espinosa; Charles H Perry; Barry T Wilson; Daniel F Keefe"}, {"title": "Non-invasive interactive visualization of dynamic architectural environments", "journal": "Association for Computing Machinery", "year": "2003", "authors": "Christopher Niederauer; Mike Houston; Maneesh Agrawala; Greg Humphreys"}, {"title": "Multi-perspective 3D panoramas", "journal": "International Journal of Geographical Information Science", "year": "2014", "authors": "Sebastian Pasewaldt; Amir Semmo; Matthias Trapp; Jürgen Döllner"}, {"title": "Multiscale visualization of 3D geovirtual environments using view-dependent multi-perspective views", "journal": "Journal of WSCG", "year": "2011", "authors": "Sebastian Pasewaldt; Matthias Trapp; Jürgen Döllner"}, {"title": "Navigation and Locomotion in Virtual Worlds via Flight into Hand-held Miniatures", "journal": "ACM", "year": "1995", "authors": "Randy Pausch; Tommy Burnette; Dan Brockway; Michael E Weiblen"}, {"title": "Image-browser taxonomy and guidelines for designers", "journal": "IEEE Software", "year": "1995-03", "authors": "C Plaisant; D Carr; B Shneiderman"}, {"title": "To go where no man has gone before: Virtual reality in architecture, landscape architecture and environmental planning", "journal": "Computers, Environment and Urban Systems", "year": "2015-11", "authors": "M E Portman; A Natapov; D Fisher-Gewirtzman"}, {"title": "A Principled Taxonomy of Software Visualization", "journal": "Journal of Visual Languages & Computing", "year": "1993-09", "authors": "Blaine A Price; Ronald M Baecker; Ian S Small"}, {"title": "General morphological analysis", "journal": "", "year": "1998", "authors": "Tom Ritchey"}, {"title": "State of the art: Coordinated & multiple views in exploratory visualization", "journal": "IEEE", "year": "2007", "authors": "C Jonathan;  Roberts"}, {"title": "Hybrid realitybased user experience and evaluation of a context-aware smart home", "journal": "Computers in Industry", "year": "2016-02", "authors": "Dong Woo Seo; Hyun Kim; Jae Sung Kim; Jae Yeol Lee"}, {"title": "Cartographic generalization in a digital environment: When and how to generalize", "journal": "Citeseer", "year": "1989", "authors": "Stuart Shea; Robert B Mcmaster"}, {"title": "GeoGate: Correlating Geo-Temporal Datasets Using an Augmented Reality Space-Time Cube and Tangible Interactions", "journal": "IEEE", "year": "2019", "authors": "James A Seung Youb Ssin; Ross T Walsh; Andrew Smith; Bruce H Cunningham;  Thomas"}, {"title": "Implementation of god-like interaction techniques for supporting collaboration between outdoor AR and indoor tabletop users", "journal": "IEEE/ACM International Symposium on Mixed and Augmented Reality. IEEE", "year": "2006", "authors": "Aaron Staford; Wayne Piekarski; Bruce H Thomas"}, {"title": "CHI '21", "journal": "", "year": "2021", "authors": ""}, {"title": "Virtual Reality on a WIM: Interactive Worlds in Miniature", "journal": "ACM Press/Addison-Wesley Publishing Co", "year": "1995", "authors": "Richard Stoakley; J Matthew; Randy Conway;  Pausch"}, {"title": "Exploring real world points of interest: Design and evaluation of object-centric exploration techniques for augmented reality", "journal": "Pervasive and Mobile Computing", "year": "2015-04", "authors": "Markus Tatzgern; Raphael Grasset; Eduardo Veas; Denis Kalkofen; Hartmut Seichter; Dieter Schmalstieg"}, {"title": "Data Visualisation using Augmented Reality with a Focus set on Head Mounted Displays and Collaborative Tasks", "journal": "International Symposium on NDT in Aerospace", "year": "2018", "authors": "Drey Tobias"}, {"title": "Complexity and Occlusion Management for the World-in-Miniature Metaphor", "journal": "Springer", "year": "2009", "authors": "Ramón Trueba; Carlos Andujar; Ferran Argelaguet"}, {"title": "Extended Overview Techniques for Outdoor Augmented Reality", "journal": "", "year": "2012-04", "authors": "Eduardo Veas; Raphael Grasset; Ernst Kruijf; Dieter Schmalstieg"}, {"title": "Overcoming World in Miniature Limitations by a Scaled and Scrolling WIM", "journal": "IEEE", "year": "2006", "authors": "Y C A Wingrave; D A Haciahmetoglu;  Bowman"}], "figures": [{"figure_label": "23", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 2 :Figure 3 :23Figure 2: A comparison of the 25 papers we coded. The top bar shows each paper we coded. The left column shows our design dimensions and their possible values. Bars at the right show the total number of papers with each value.", "figure_data": ""}, {"figure_label": "4", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 44Figure4: WiMs increasing in Scope: (a) a WiM that shows a single object[11], (b) a WiM that shows a single room[34], (c) a WiM that shows one foor of a building[6], (d) a WiM that shows an entire building[21], (e) a WiM that shows a city block[49], (f) a WiM that shows a city-sized natural park[18], (g) a WiM that shows a country[30], (h) a WiM showing a star system[26]. Images reused with permission.", "figure_data": ""}, {"figure_label": "5", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 5 :5Figure5: WiMs with increasing Abstraction: (a) a perfect recreation of the virtual room[34], (b) a digital recreation of a real building[45], (c) a physical copy of a real space[40], (d) geometric simplifcation of a room, objects are reduced to just cubes[4], (e) a satellite image that has undergone cartographic generalisation to look like a map[30], (f) a building that has been reduced to just areas[9], (g) a building that has been reduced to just lines in a wireframe[21]. Images reused with permission.", "figure_data": ""}, {"figure_label": "7", "figure_type": "", "figure_id": "fig_3", "figure_caption": "Figure 7 :7Figure7: WiMs with Reference frames ranging from very viewer-centric reference frames to world-centric reference frames: (a) a WiM that is placed on the viewers wrist[22], (b) a WiM that sits in the top right of the viewers view[48], (c) a WiM that sits on a handheld clipboard[44], (d) a WiM that sits on a hand held device[29], (e) a WiM that is embedded in a physical model[40], (f) a WiM that hovers above the object it represents[45], (g) a WiM that has no reference frame[26]. Images reused with permission.", "figure_data": ""}, {"figure_label": "10", "figure_type": "", "figure_id": "fig_4", "figure_caption": "Figure 10 :10Figure10: WiMs along various degrees of virtuality: (a) headset VR[5], (b) cave VR[12], (c) desktop VR[6], (d) headset AR[46], (e) projected AR[24], (f) handheld AR[29]. Images reused with permission.", "figure_data": ""}, {"figure_label": "11", "figure_type": "", "figure_id": "fig_5", "figure_caption": "Figure 11 :11Figure 11: Papers ordered by Size and Scope", "figure_data": ""}, {"figure_label": "12", "figure_type": "", "figure_id": "fig_6", "figure_caption": "Figure 12 :12Figure 12: Papers ordered by Size and Reference Frame", "figure_data": ""}, {"figure_label": "13141516", "figure_type": "", "figure_id": "fig_7", "figure_caption": "Figure 13 :Figure 14 :Figure 15 :Figure 16 :13141516Figure 13: Papers ordered by Size and Geometry", "figure_data": ""}, {"figure_label": "19", "figure_type": "", "figure_id": "fig_8", "figure_caption": "Figure 19 :19Figure 19: Example #2. Body Based WiM: In the fgure a viewer has a WiM spread across their body. Buildings that are close to them are on their arms, while distant ones are on their legs.", "figure_data": ""}, {"figure_label": "20", "figure_type": "", "figure_id": "fig_9", "figure_caption": "Figure 20 :20Figure 20: Example # 3: Overview Replica + Detail Replica.On the left side of the phone is a replica of the entire mountain region. On the Right side is another smaller replica that is showing just the trail segment the viewer is on. Blue pins show the viewers position, and the red pin shows their destination.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Dimensions used in our three example WiMs. Critical dimensions for each are indicated in bold.", "figure_data": "Dimension Example #1 (Shared Spatial Highlights) Example #2 (Body Based WiM) Example #3 (Overview + Detail)Size LargeLargeLarge & ModerateScope BuildingBlockCity & FloorAbstraction Physical CopyCartographic GeneralizationCarto. GeneralizationGeometry Clip to FocusDisjoint & Clip to FocusClip to Simple Shape/FocusRef. Frame Free ReferentViewer's BodyViewerLinks HighlightingNoneNoneMultiples NoneNoneSmall MultiplesVirtuality Headset ARHeadset ARHandheld AR"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Table of applications for each survey WiM. WiMs designed for more than one application are highlighted in both.", "figure_data": "WayfndingCollaboration VisualisationNavigationControl Space MetaSsin 2019Nam 2019Gazcon 2018Drey 2018Tatzgern 2015Veas 2012Cofey 2011Trueba 2009Bruder 2009Li 2006Muiloni 2012Bell 2002Wingrave 2006Bluf 2019Kalkusch 2002Bell 2003LaViola 2001Seo 2016Bonsch 2016Elvins 1998Staford 2006 Hollerer 2001Pausch 1995Chittaro 2005"}], "doi": "10.1145/3411764.3445098"}