{"authors": "Shunichi Kasahara; Jun Nishida; Pedro Lopes", "pub_date": "", "title": "Preemptive Action: Accelerating Human Reaction using Electrical Muscle Stimulation Without Compromising Agency", "abstract": "We enable preemptive force-feedback systems to speed up human reaction time without fully compromising the user's sense of agency. Typically these interfaces actuate by means of electrical muscle stimulation (EMS) or mechanical actuators; they preemptively move the user to perform a task, such as to improve movement performance (e.g., EMS-assisted drumming). Unfortunately, when using preemptive forcefeedback users do not feel in control and loose their sense of agency. We address this by actuating the user's body, using EMS, within a particular time window (160 ms after visual stimulus), which we found to speed up reaction time by 80 ms in our first study. With this preemptive timing, when the user and system move congruently, the user feels that they initiated the motion, yet their reaction time is faster than usual. As our second study demonstrated, this particular timing significantly increased agency when compared to the current practice in EMS-based devices. We conclude by illustrating, using examples from the HCI literature, how to leverage our findings to provide more agency to automated haptic interfaces.• Human-centered computing → Haptic devices; Gestural input.", "sections": [{"heading": "INTRODUCTION", "text": "While computer interfaces have excelled at supporting intellectual augmentation [16], only recently have these interfaces started to provide physical augmentations, such as assisting motion (e.g., learning drumming [14] or learning medical procedures [63]). This type of augmentation happens through the assistance of force feedback devices that are able to actuate the user's body, such as by means of electrical muscle stimulation (e.g., [14]) or mechanical actuators (e.g., [63]). These haptic actuated systems offer the potential to speed up the user's physical reaction time by means of preemptive actions-the system actuates the user faster than their normal speed to perform a task that the user also wants to perform. For instance, these systems have been used to preemptively steer the user into safety (e.g., Pedestrian Navigation [50]) or to correct the user in timing-sensitive tasks (e.g., keeping a steady rhythm [14]).\nHowever, an interactive system that acts automatically and preemptively (be it physical or cognitive) will reduce the user's sense of being in control [5,42]-the user loses their sense of \"I did this\". Speed et al. argued that automated interactions with objects (e.g., as in Affordance++ [38] where an object forces the user to act) cause a shift in agency, removing the user's agency [54] In this paper, we investigate how to enable preemptive haptic systems to actuate users in a way that accelerates their reaction time, yet, also maximizes their sense of agency.", "n_publication_ref": 11, "n_figure_ref": 0}, {"heading": "OUR APPROACH: PREEMPTIVE ACTION", "text": "At first glance our proposal might seem paradoxical: if a system actuates so the user moves faster than they do normally, how could the user still feel as if they initiated the movement?\nWe propose that the solution to this paradox lies in the fact that our conscious awareness of intention takes a moment to arise, around 200 ms [30,31,40,53]. These findings suggest a time window between a volitional action and our sense of agency for this action [40]. We exploit the fact that this time window offers flexibility to attribute agency to a preemptive action (Figure 1), i.e., one that was externally generated by a haptic device (e.g., electrical muscle stimulation) and is aligned with the user's intention. For this hypothesis to work, one needs find out exactly when a preemptive actuation should be delivered so that it maximizes the user's agency.", "n_publication_ref": 5, "n_figure_ref": 1}, {"heading": "preemptive action electrical muscle stimulation preemptive gain sense of agency", "text": "Figure 1: We reveal the relationship between a user's agency and the preemptive gain enabled by automated haptic interfaces (here, a system that speeds up the user's tapping using electrical muscle stimulation). This allows researchers to design preemptive actuation systems that now maximize the user's agency.\nAs depicted in Figure 1, we found and validated the key relationship between agency and the gain in preemption (i.e., how much a system speeds up a user). We did this by means of two user studies that we present in this paper. This agency-preemption relationship (depicted by the model on the right side of Figure 1) allows researchers to optimize their haptic actuated systems accordingly to their needs, i.e., maximize either for agency, reaction time or even both.", "n_publication_ref": 0, "n_figure_ref": 3}, {"heading": "RELATED WORK", "text": "Our approach builds on the areas of human augmentation, contemporary theories of agency in neuroscience and cognitive psychology, and electrical muscle stimulation.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Sense of agency", "text": "The sense of agency, or sense of control, is a neural mechanism that drives one's awareness of initiating, executing, and controlling our own voluntary actions in our surroundings [24]. The sense of agency allows us to recognize ourselves as the agent of a particular behavior, enabling us to build a self that is independent from the external world [24]; it is thus one of the most primal mechanisms.\nWegner proposed three principles that condition the sense of agency, which they demonstrated to affect agency in VR experiences [59]. These principles are: \"(1) priority: conscious intention to perform an act must immediately precede the action, which should precede the outcome; (2) consistency: \"the sensory outcome must fit the predicted outcome\"; and, (3) exclusivity: \"one's thoughts must be the only apparent cause of the outcome\". Jeunet et al. showed that a manipulation of any of these three principles changes the perceived causality of an event, which in turn affects agency [26].", "n_publication_ref": 5, "n_figure_ref": 0}, {"heading": "The neural origin of the sense of agency", "text": "In the field of neuroscience there are different views that suggest a neural mechanism that handles our sense of agency. One view, which is of relevance to our research, places the motor system (i.e., the neural apparatus that controls voluntary movements) at the center of the question of agency [18]. In their experiments, Frith et al. showed that participants with lesions on the motor cortex (but no lesions on the sensory organs or pathways that allow to feel touch, etc.) exhibited a decreased sense of agency [18]. This theory states that the agency is dependent on the comparison between the prediction of a movement and its outcome.\nWhile much is still not understood regarding the inner workings of our sense of agency, we do know it is not a static and immutable state as many experiments have shown, such as: the rubber hand illusion [7,32,62], randomly generated feedback [15,26], inversion of user's movements [26], distortion of the haptic feedback [60], deception [48], and delays or sped-ups in feedback [15,26]. The latter is especially important for our investigation of agency in preemptive interactive systems. We believe the time window in which the system provides its preemptive feedback offers the biggest design opportunity.", "n_publication_ref": 11, "n_figure_ref": 0}, {"heading": "Interaction between time and the sense of agency", "text": "A series of studies have shown that the perception of time is what binds together the degree of association we creating between a voluntary action (our intention) and outcome (the result of our intention); this has been shown to drive the sense of agency by Libet et al [31] and Haggard et al. [21]just to cite a few. These findings (e.g., Libet's clock experiment) found the existence of a time delay between a volitional action and our sense of agency for this action [40].\nOne key conclusion of all these studies in neuroscience is that \"temporal sensorimotor discrepancies reduce the sense of agency\" [12]. This has been shown countless times by offsetting the onset of the expected outcome in visual, tactile or auditory modalities [15]. Thus, time is a key in preserving the sense of agency. We argue that this is the parameter that preemptive interactive systems must tune in order to provide more agency to their users.", "n_publication_ref": 5, "n_figure_ref": 0}, {"heading": "Designing for the sense of agency (Agency in HCI)", "text": "While designing interactive systems, the sense of agency is key to achieve a user experience that grants a sense of control to the user. Unfortunately, achieving this becomes more challenging with assistive systems, i.e., those that automatically change the system to facilitate interactions [41,42]. For instance, Coyle et al., found that, when a user controls a mouse cursor, changing the amount of assistance the interactive system provides (e.g., predictive mouse acceleration) has a significant impact on the user's sense of agency [11].\nIn fact, understanding this relationship between time and agency is so crucial to designing interactive systems that the HCI community has deepened that understanding: McEneaney et al. found that machine-induced mouse clicks affect the user's perceived agency [41]; Coyle et al. found that the mouse cursor speed manipulations can affect agency [11]; and, Bergstrom-Lehtovirta et al. found that on-skin interaction improves the sense agency vs. a traditional button press [6].\nBesides investigations that probe how feedback timing affects the user's sense of agency, it has also been shown that the feedback modality has an impact as well. For instance, Martinez et al. found that the sense of agency varied during a mid-air touching task, across different feedback modalities, such as visual, audio or vibration [9]. They found that both auditory and haptic feedback modalities were superior to the visual-only baseline in terms of increased sense of agency. Likewise, Limerick et al. showed that, in speechbased interfaces, the voice input modality reduces agency when compared to keyboard input [33].\nUnfortunately, while these projects have investigated the role of timing and feedback in HCI systems (e.g., mousebased or mid-air interactions), nothing is known about the effect that timing has on the user's sense of agency in haptic systems capable of actuating the user.", "n_publication_ref": 8, "n_figure_ref": 0}, {"heading": "Haptic actuation systems", "text": "The type of haptics we discuss in this paper are strong force feedback systems that are capable of moving a user's body, even against their own volitional force (this effect is also often referred to as force feedback). There are two kinds of actuators that provide enough output force to actuate human limbs: mechanical actuators (e.g., large robotic arms or exoskeletons) or electrical muscle stimulation. The traditional type of mechanical force feedback devices consists of having users hold on to a handle, which is then actuated by a robotic arm or by pulley system (e.g., SPIDAR [44]). An alternative to stationary haptic devices are ungrounded haptic devices: these are mechanically actuated devices that provide forces by pulling the user's limbs against the mounting point on the user's body. Exoskeletons are the canonical example of wearable ungrounded haptic devices; they can actuate the user's arms [57] or fingers [19].", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Electrical Muscle Stimulation", "text": "Electrical Muscle Stimulation (EMS) originated in rehabilitation medicine as a means to restore lost motor functions, e.g., after spinal cord injuries [55]. Only more recently have researchers in HCI started to explore EMS, e.g. Kruijff et al. 's EMS desktop gaming [29] or the Possessed Hand [57].\nWhen surveying interactive systems based on EMS, we found a clustering around three research topics: (1) increasing realism in virtual experiences by creating involuntary force feedback [17,34,36,39]; (2) tutorial/training systems [14,38,46,50,57] and (3) information access [37,47].\nFrom these EMS-based devices, the area of training systems is of particular relevance to our case of preemptive actuation since most of these scenarios involve actuating the user quicker than their normal reaction time. For instance, in Stimulated Percussions, an EMS-based system actuates to user's hands, as they hold on drumsticks, to automatically make the user drum on the correct tempo [14]. Also, the aforementioned Affordance++ [38] actuated users to automatically perform certain tasks, such as to shake a spray can. Lastly, as an additional example, Wired Muscle [46] is a system that enables speeding up a user's reaction time with EMS so that they can pass the pen-drop test, a common fitness test also known as the ruler drop test, in which one must grab a falling ruler, reacting only to the visual stimuli of another user dropping the ruler.", "n_publication_ref": 17, "n_figure_ref": 0}, {"heading": "Loss of agency in actuated haptic systems", "text": "While researchers are excited about the prospects of EMS as a way to miniaturize haptics [35], it is not known what effects the electrically induced involuntary actions have on the user's agency. This shortcoming is where we draw inspiration for our research question. In fact, the studies conducted on these EMS-based interactive systems point to a loss in agency. For example, in Affordance++ participants attributed agency to the object they manipulated (e.g., a spray can that shakes) rather than to themselves [38]. Likewise, in Proprioceptive Interaction, participants often voiced not feeling in control, e.g., \"it was so remarkable to see my hand moving without my intention\" [37].", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "USER STUDY 1: MEASURING AGENCY IN PREEMPTIVE HAPTIC SYSTEMS", "text": "The objective of our first experiment was to understand how timing affects perceived agency in a preemptive haptic system. In the particular case of this experiment, we created a preemptive system that actuates the user using EMS. We designed a tapping study based a canonical psychophysics task to measure reaction time (e.g., [23,33,45]). We engineered the system to deliver the stimuli preemptively, i.e., before the user has time to react to it. Our first hypothesis (H1) is that any preemptive stimulation will result in a shorter reaction time, but will also decrease agency. Our second hypothesis (H2) is that there is a timing sweet spot that still offers preemption (i.e., faster than ordinary reaction time) without drastically decreasing agency.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Apparatus", "text": "Our experimental setup is depicted in Figure 2. To assist readers in replicating our experiment, we provide the necessary technical details and the complete source code 1 . Stimulation apparatus: Participants were actuated using a bioSync EMS stimulator (same as in [47], but removed of wireless communication to reduce latency). The stimulator's intensity was adjusted per participant to operate painfree, yet rapidly and robustly actuate their ring finger.\nElectrode placement: Two pairs of electrodes are used: One pair, which sits at the flexor digitorum profundus muscle, provides sufficient intensity for flexing the user's ring finger. We actuated the ring finger since we can found (via pilot testing) that we could robustly actuate it without any 1 https://github.com/shks/PreemptiveAction parasitical motion of neighboring muscles. The second electrode pair, attached to the flexor pollicis longus muscle (just a centimeter away from the first electrode pair), is used in the sham-condition, providing a typical tingling sensation without causing any finger flexion. During pilot testing we confirmed that this sensation mimics effectively the tingling effect of the first electrode pair.\nCalibrating the EMS stimulation: We iteratively adjust the stimulation parameters by adjusting the pulse width (from 30 -500 µsec), the pulse frequency (from 10 -100 Hz), and, lastly, the amplitude (from 1 mA to 10 mA) for each participant. The stimulation was one EMS pulse only. Thus, the stimulation duration was same as the selected pulse-width, i.e., 30 -500 µsec: we chose this since prior research suggests that short stimulations are less noticeable [36]. Prior to starting the trials, we guaranteed that participants' finger was actuated via the EMS to tap the surface and was always recognized by the touchscreen.\nMasking the \"tingling\": To allow our study to conclude precisely on what preemptive EMS actuation does to the user's sense of agency, we controlled for external confounding factors, such as the EMS' tingling sensation on the participant's skin [37,57]. Using the approach described in [37], we masked the tingling sensation by attaching two large vibration motors (with off-axis weights) to the participant's arm. We used the following procedure to confirm that this vibration effectively masks the EMS tingling sensation: (1) We calibrate EMS to tingle the skin but not strongly enough to actuate the arm, (2) We run the vibration motors which vibrate the participant's arm. (3) We ask the participant to say when they feel skin tingling among the vibrations. (4) We turn on the EMS at a random point in time. (5) If participants still feel the skin tingling, we lower the EMS (never below the point of tingling) and increase the intensity of the vibrations. (6) We ensured all participants' responses to this were below or around random (<=50%).\nTouchscreen: Below the participants' hands we placed a Razer Blade's touch screen (model from 2017, running at 120Hz).\nFinger support: We created a 3D printed finger base that supports participants' hands as they hover the touchscreen; the base leaves the ring finger free to flex and touch the screen. This approach is commonly used in psychophysics too, as means to ensure that only one particular muscle causes the observable result [2]. Furthermore, this prevents participants' muscles from getting tired quickly.\nSystem's latency: As with any computer-based system, our implementation has an intrinsic latency of less than 40 ms between the software generated stimulation command and the muscle activation (this accounts for the complete loop: USB, stimulator's microcontroller and human muscle contraction time). Also, our system has a latency of 60 ms in logging the touch events, which we will later subtract.", "n_publication_ref": 11, "n_figure_ref": 1}, {"heading": "Task", "text": "The task was a simple tap test, depicted in Figure 3; our task was modeled after the psychophysics task that measures reaction time [23,45]. We asked participants to tap a target that appears on screen as fast as possible.\nThe target location was stationary and the period between trials was randomized (between 1 and 4 s) to keep participants attentive. After each tap on the screen, participants were presented with a questionnaire regarding their perceived sense of agency for this screen tap. We follow the typical agency questionnaire, i.e., a Likert scale question with 1 = \"I did not do it\" and 7 = \"I did it\".\nThe time window of preemptive stimulation ranged from 200 ms (i.e., prior to the target showing up) to 400 ms after the target shows up. To sample this time interval as much as possible, we randomized the preemptive stimulation for every trial.", "n_publication_ref": 2, "n_figure_ref": 1}, {"heading": "Procedure", "text": "Before engaging in the study task, participants performed a training phase consisting of a maximum of 10 trials. After this, participants were asked to perform 10 trials to record their average reaction time. Then, we asked participants to perform the task, i.e., 50 taps on the target. Each trial was followed with the aforementioned agency questionnaire. After all trials were completed, we gave participants an opportunity to provide open-ended feedback.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Participants", "text": "We recruited 12 participants (1 female, avg = 26.5 years old; std.dev. = 5.4) from our local institution. With their prior written consent, we transcribed their comments. An additional 3 participants were recruited, but excluded since the placement of the EMS did not result in a precise tapping motion. Participants received 17 USD as compensation for their time.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Results", "text": "We collected 600 trials from all participants, with two data points per trial: reaction time and assessment of agency. Also, we found participants' average reaction time at the start of the study to be 267.3 ms (std.dev. = 32 ms), which is aligned with findings in psychophysics research that found a reaction time of 250 ms in response to visual stimuli [23]. Furthermore, we did not observed a decrease of EMS stimulation efficacy over time, since we found no correlation between the trial index and the time between EMS trigger and screen tap (R 2 = 0.0042). H1: preemption decreases agency. As Figure 4 depicts, we found that preemption impacts agency, i.e., as we spedup the reaction time by providing more preemption to the system (i.e., EMS acted earlier), participants perceived less agency. To illustrate this we can pick two time windows in Figure 4, such as [-10, 10] ms and [290, 310] ms. In the first case, between [-10, 10] ms (i.e., actuation in sync with visual target), the average perceived agency was barely none (avg = 1.25; std.dev = 0.43). Here, the participants' reaction time was shortened under the typical human reaction time (avg = 47.5 ms; std.dev. = 20.2 ms). On the second case, when the EMS was offset to act between [290, 310] ms after the visual stimulus (i.e., system stimulated close to the human reaction time), the perceived agency approached the maximum (avg= 6.81; std.dev. = 0.39). However, there was no preemptive gain (reaction time avg = 281.9 ms;std.dev. = 43.6 ms). This validates H1, which is in conformity with previous research in neuroscience for visual tasks, but had not been shown with haptic actuation. H2: there is a sweet spot that preserves agency. Now, what we are looking for is for a point in between \"maximumagency but no speed up\" and \"no agency due to too much speed up\". First, let us examine Figure 4, this time from the perspective of the vertical lines, which denote a participant's typical reaction time. For every participant there are many high scored points (e.g., maximum ratings of agency) before their usual reaction time; this implies there is a point in which EMS can speed their reaction time and provide more agency-this is the focus of our next analysis.\nLet us confirm that indeed this EMS actuation did result in an overall speed up in reaction time. Figure 5 depicts the relationship between EMS offset and total reaction time. We found this relationship to be clearly linear between -100 and 250 ms, i.e., the earlier the EMS acts, the faster the reaction time is; this implies that EMS is solely responsible for the speed up in reaction time. Later than 250 ms, as we approach the participants' usual reaction time, the data variance increases since it is not only the EMS that is responsible for the reaction time at these speeds. Note that all our measures of reaction time were obtained with the same experimental setup and thus contain approximately 60 ms of latency. Therefore, from here onward, we subtracted the aforementioned touch screen latency (60 ms) from the reaction time. These findings confirm our H2; they suggest that there is a point in which we can speed up reaction time without compromising the sense of agency. However, we can also observe that each participant's data points seem to fall on a slightly offset curve, which we decided to investigate further in order to establish more precisely how early is the ideal preemption that does not compromise agency relative to a participant's usual reaction time?\nInvestigating the precise curve per participant. We modeled each participant's perceived agency as a colored curve, depicted in Figure 7. To achieve this, (1) we normalized the data by subtracting each participant's baseline reaction time to each reaction time (with EMS actuation). This allows us to instead depict the time gained by means of preemption, which we denote as P д . Then, (2) we normalized the agency axis from 0 to 1 and the horizontal axis to depict -400 to 400 ms. Lastly, (3) the logistic regression computes the relationship between the perceived agency and the preemptive gain, per participant. Then, (4) from all the curve fits we computed a mean fit of R 2 = (with std=0.086, min=0.50, max=0.79) for our logistic model. This demonstrates that the curves are in cases very similar and relatively consistent among all users (as suggested by the low standard but with shifts in the preemptive gain (i.e., they start in a different timing).\nwe can observe, these curves afford a similar drop-off rate, which seems to cluster around a preemptive gain of 80 ms. This suggests that there is a dramatic drop in agency we set up the EMS stimulus in a way that the preemptive gain is larger than 80 ms. To demonstrate this, let us illustrate the average agency in a particular window before and after 80 ms: we found that the average agency found in window between 80-0 ms is 5.13 (std.dev. = 2.16) in [1][2][3][4][5][6][7] scale. On the other hand, the agency dramatically drops in the window after 80 ms of preemptive gain, for instance at 160 ms we recorded a perceived agency of 1.89 (std.dev. = 1.51) in [1][2][3][4][5][6][7] scale. This result reinforces our H2, pointing to the time window in which it is feasible for a preemptive system to offer faster-than-normal reaction time without dramatically compromising agency. Our model suggests that such a system should actuate 160 ms after visual target, resulting in 80 ms speed up of the user's reaction time.\nObtaining a model of agency under preemption. simple model to assist in explicating how the sense agency is affected by a preemptive stimulus is:\nA = 1/(1 + e −k (P д −t o ) )\nThe logistic regression allowed us to model the sense of (A) normalized from 0-1 as a sigmoid function depending on the parameters д (the preemptive gain), t 0 (timeshift of the curve's starting point) and k(models the flexibility of a participant's sense of agency, i.e., whether is it binary, such as agency vs. no-agency, or continuous).\nWe observed that the parameter k has an actual world cause: it models how participants opted for different strategies to evaluate their sense of agency. To illustrate we pick two extremes of the k parameter, depicted in Figure 7's callouts: P6'scurve (k=0.033, t 0 =128 ms) suggests a clear distinction between having agency or not and affords a longer preemption gain; during the post-task interview, P6 stated to \"have confidence with their agency judgment at all times\". On the other hand, P3's curve (k=0.012, t 0 =118 ms) depicts a more ambiguous sense of agency; during the interview, P3 noted: \"I was not always confident about my answers\".", "n_publication_ref": 16, "n_figure_ref": 6}, {"heading": "results", "text": "The most exciting of our findings is that many participants in control even when the action was triggered by EMS as voiced by the participants' comments at the end of the task. We summarize these: 8 participants voiced remarks at the of the study such as \"even I did not notice that I've got EMS\" or \"I rated 6 or 5 when I felt some EMS sensation but I believe I control my finger\", \"When I rated 7, I think there was not EMS and I solely touched the screen by my own\". In particular, P2 noted that, with an early-stimulation of -200 ms, \"it's too fast, it moves before I do\". This further emphasizes that, at this timing, participants are able to distinguish the order of these two events, i.e., they realized the EMS moved them before they wanted to move-aligned with Wegner's agency principles. Conversely, when stimulated in a timing around 160 ms after the target appeared, the same P2 stated \"I know I felt some tingling but I thought it was some weak feedback, now [in hindsight] I actually believe I moved my finger too\"; we observed analogous comments from other participants-this depicted a timing alignment that enabled participant's \"thought\" to first arise (preserved the priority principle) and to be consistent with the outcome, which was the on-screen feedback after tapping the screen (consistency principle). P5 even stated \"I know this [the EMS] moved my finger, at some point, but I feel this [EMS] and my movement to get integrated, rather than just moved by it\". Interestingly, two participants did not realize that, during the trials, the stimulus timing was being manipulated, as P6 puts it: \"I did not notice that timing was controlled. I just thought that only difference is the of this [EMS]\". P6 added \"When I answered 7, I did notice that I was moved by the EMS [although it was the EMS that responded faster than P6, in many of these trials]. When answered 6, I partially felt the sensation but I still bethat was the one who moved [although in many of these trials, the EMS moved faster than the participant]\".", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "MODELLING PREEMPTIVE ACTION WITH AGENCY", "text": "While in Study 1 we obtained one model per participant, the goal here is to inform future interactive systems with a more generalizable model. Ultimately, this will allow future preemptive actuation systems to maximize for agency based on how much they want to sacrifice in reaction time (or vice\nWe start by decomposing a user's reaction time it into its constituents (based on Card's Human Processor Model [8]), depicted in Figure 8. In a voluntary action our reaction time is comprised of perception, cognition, and motor action. However, if we are preempted to act (e.g., by means of EMS) we can gain a speed up in the final reaction time of, for instance, 80 ms (if we select our previously found preemptive gain). From this timeline key parameter that enables the preemption is P д (preemptive gain). In an ideal setting, as we did in Study 1, this parameter is dependent on the user's own reaction time. However, if we are looking for a more generalizable result to be applied to a broader set of applications, we must create one single model that generalizes all the data. To do this, we analyze data from all participants via the logistic regression to yield a single model function, which uses the preemptive gain and the perceived sense of agency as independent variables (x and y, respectively). Figure 9 shows the yielded sigmoid curve function that we will as our working model. Here, we found a model fit of R 2 = 0.56. This model is useful because it allows a designer to choose how to optimize for agency and/or reaction time. For instance, if we wanted to equally optimize for both agency reaction time we would select 80 ms of preemptive gain , offers a 50-50 ratio between agency gain (marked by the label (P * д ) in Figure 9). This preemptive gain of 80 ms means our actuation is 80 ms faster than the user's reaction time; this is the value we will verify in Study 2 in order to understand whether it outperforms the existing and baselines. Once we decided the preemptive gain P д = 80, we can determine the time of triggering EMS from the visual onset (T EM S ). For instance, assuming average of reaction time is 280 ms and the latency (d EM S ) from triggering EMS to touch is 40 ms, T EM is determined as:", "n_publication_ref": 1, "n_figure_ref": 3}, {"heading": "EMS", "text": "T b − P д − d EM S = 160ms", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "USER STUDY 2: USING OUR MODEL TO OPTIMIZE FOR BOTH AGENCY AND REACTION TIME", "text": "While our first study focused solely on understanding how the preemptive EMS timings affect agency, the objective of our second experiment was threefold: (1) to provide a comparison between our newly found optimal timing (from Study 1) and the approach used in the EMS state-of-the-art; (2) to isolate and explain the effect that preemptive actuation has on the user's own agency, independent of the skin-sensations caused by EMS; and, (3) to unveil how the user's agency is impacted by the usage of preemptive EMS stimuli, when compared to their own volition.\nFor this, we setup a similar experiment as in Study 1 by asking participants to tap on a screen as fast as possible. This time, we utilized only two timings for delivering the haptic stimuli: our previously found timing sweet spot against the traditional approach in preemptive interactive systems, which is to actuate the user as early as the interface needs it.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Hypotheses", "text": "In this experiment our main hypotheses were as follows: our approach, using optimal preemptive timing, speeds up standard reaction time by actuating the user. H2: our approach provides more agency than the common practice in EMS today, which is to actuate the user as early as the interface needs it. To gain a deeper understanding of the mechanisms that underlie the perception of agency under EMS, we added: H3: our EMS-based actuation was responsible for speeding up reaction time and not just merely cueing the user when to move. H4: our approach is able to maintain agency because the user's intention is also to move their", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Interface conditions", "text": "Participants touched the screen in four distinct conditions for the same simple button press task, which are depicted in Figure 10. The four conditions were parameterized as follows: A. Preemptive Action: Both the participant and the EMS stimulation contract the user's finger (System+User move). The EMS is triggered at T EM S = 160 ms, which should yield improvement of 80 ms in reaction time, according to our model.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "B. EMS-Only:", "text": "Only the system moved the finger and participants were asked to relax (System moves) using the same preemptive timing.\nC. Sham:The participant moves their finger voluntarily moves). They also felt an EMS impulse, triggered at the same preemptive timing, but this impulse was calibrated to only provide skin sensation (tingling) and was not enough to actuate-we use this as a condition [22]. Note that we utilized secondary pair of electrodes (1cm apart from the actuating pair) since our hardware does not allow to stimulate the same pair of electrodes with two different intensities after the calibration phase. We verified during pilot studies that the sensations from sham and actuation are perceived as equivalent.\nBaseline: Both the participant and the EMS stimulation contract the user's finger (System+User move). Howhere, EMS timing is triggered exactly when the application needs it, i.e., when the visual target shows up. This depicts the current approach in interactive systems based on EMS.\nIt is important to emphasize that participants were not aware of four distinct interface conditions; we simply informed participants that the stimulation would assist them in different ways to tap the target.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Experimental design", "text": "This study was a within-subject design with randomized order and 10 trials per condition. We recruited 12 new participants (2 female, avg = 24.6 years old, std.dev. = 4.85) from our local institution; none had partaken in Study 1. Participants received 17 USD as compensation for their time. Furthermore, we measured the participants nominal reaction time prior to the study by averaging 10 practice trials (M = 229 ms, std.dev. = 46.5 ms, max = ms, min = 180 ms); this value serves as a purely voluntary baseline.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Results", "text": "We analyzed the dependent variables reaction time and reported agency score in our 4 interface conditions. Regarding normality using the Shapiro-Wilk Test: all reaction time data was found to be normal, with the exception of the Baseline condition; and, only the agency scores of Preemptive were found to be normal. Therefore, we utilized a non-parametric test. A Friedman test revealed a significant effect of all conditions on the reaction time (χ 2 (3)= 32.8; p< 0.01) and on the reported agency score (χ 2 (3)= 32.3; p<0.01). All pairwise comparisons were Bonferroni-adjusted for all variables. As in the previous study, we found no correlation between trial index and reaction time in all EMS-related conditions (with R 2 < 0.005 for baseline and Preemptive Action R 2 < 0.01 for EMS-only); this suggests that EMS effiwas not decreased over the duration of the study. We investigate each of our hypotheses: H1: our approach improves human reaction time.\n11 shows the average reaction time per condition. A post-hoc test using Wilcoxon signed-rank showed the significant differences between all combination (p < 0.05), except between the reaction time of Preemptive Action EMS-Only (p > 0.05). As expected, the fastest condition was Baseline (Md = 19.1 ms; avg= 17.4 ms; std.dev. = 11.92 ms) since the EMS was triggered 160 ms earlier than in all others conditions. Also, we found that our Preemptive Action was significantly faster than participants' own reaction time, i.e., it outperformed the Sham condition (p = 0.01); this validates our H1.\nH2: our approach improves agency. Figure 12 depicts the average perceived agency per condition. A post-hoc test using Wilcoxon signed-rank found statistically significant differences between all combinations (p < 0.05), except between EMS-Only and our the Baseline (p > 0.05); this inthat current practice in HCI provides no more agency than asking the user to stand still and let the EMS act. As expected, our Preemptive Action scored significantly higher on agency than Baseline (p = 0.01); this validates our Also as expected, we found Preemptive Action to provide less agency than Sham (p < 0.05) because actions during the Sham condition were voluntary action. Additionally, the perceived agency in the Sham condition (Md = 6.95; avg= 6.4; std.dev. = 1.18) suggests that some users loss agency simply due to feeling the tingling sensation. the two hypotheses above were our main premise (i.e., our approach does speed up the user beyond their usual reaction time while providing more agency), we wanted to shed light into what drives the faster reaction (H3) and what the sense of agency (H4). H3: EMS-based actuation is responsible for speeding up: When comparing the reaction time in the Preemptive Action with the Sham, we found that Preemptive Action is significantly faster (p = 0.01): this demonstrates that the EMS tingling is not sufficient to cue a participant and speed up their reaction time. This further suggests that the reaction time is driven by the EMS actuation. In addition, it is notable that there is no significant difference in reaction time between Preemptive Action and EMS-only (p>0.05), suggesting that the user's voluntary action did not affect the reaction placing the EMS as the main driver to speeding up the action; these results validate our H3.\nRequirement of participant's congruent intention. We observed barely any perceived sense of agency in the EMS-only condition (Md = 1.0; avg= 1.1; std.dev. = 0.23); fact, EMS-only was significantly lower than Preemptive Action (p=0.01) and Sham (p = 0.01); this suggests the expected result: without the user's intention to do an action, there is no possibility for agency to arise.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "LIMITATIONS OF OUR STUDY DESIGNS", "text": "researchers apply our findings to new domains and applications, it is worth keeping in mind the inherent limitations of our study designs.\nAgency measurement: In our study we measured the user's perceived agency via a questionnaire, i.e., by inquiring the user regarding their experience. We opted for a direct measure instead of using other study paradigms that indirectly measure agency, such as Intentional Binding (IB) [9,10]. The IB paradigm uses a delay between the user's action and the feedback (usually a auditory feedback). If this delay is perceived shorter by user than it actually is, feels agency regarding this pair of action and outcome. However, our preemptive action includes a EMSinduced tap (involuntary) that might be followed by a later finger tap as users still press the screen after the EMS has tapped it. Even if IB paradigm does find a shift the perceived delay between action and outcome, there is an ambiguity in whether the binding was with the inmovement (EMS) or in the later voluntary movement (the extra screen push). This could present a severe confound to the study as the side effects are unknown at this point. Therefore we opted for a direct however, we believe it might interesting to explore whether can still be used during EMS preemption in the future. Lastly, it is worth noting that previous research has shown both indirect and direct measures are valid ways to assess agency [13,43].\nEMS-specific: Both our studies were focused on EMS as force feedback generator. We chose EMS since: (1) it allows us to actuate the user rapidly yet safely at speeds faster than human reaction time, and (2) this is a emergent area in HCI, which appears to most researchers as the most promising approach in miniaturization of haptic actuation [34,36,38,39].\nNo-choice experiment: Experiments that present subjects with a possible choice found that participants rationalize choices after they made their decision; this widely studied phenomenon is called postdiction [52,56,59]. While believe haptic actuation can be used as means of actuating a forced-choice that participants will later justify using postdiction, we designed our studies to not be confounded by these effects. Thus, in our experiments, we purposely removed any possibility of choice.", "n_publication_ref": 11, "n_figure_ref": 0}, {"heading": "DEMONSTRATING HOW TO APPLY OUR FINDINGS", "text": "We now illustrate the applicability of our findings to researchers working on haptic interfaces at the example of improving an existing interactive system based on EMS to provide more agency to its user. As an example, let us use the aforementioned Wired Muscle [46], depicted in Figure 13 with consent of the While the original system achieves the goal of speeding up reaction time so that an untrained user passes the pendrop test, it did not the loss in the user's sense of agency. The system uses an electromyography sensor (EMG) attached to the extensor muscle of the user holding the pen. The EMG records the extensor's electrical activity and thus measures the onset of movement that releases the pen. The system uses a fixed threshold to detect this peak in the extensor's EMG activity and immediately issues the command to stimulate the flexor muscle of the user trying to grab the pen. This results in an EMS preemptive actuation that is delayed only by 60 ms from the moment of peak detection of the EMG. This latency includes 10 ms of communication delay and 50 ms until the EMS-induced grasp is completed (data from [46]).\nour model, stimulating 60 ms after the stimuonset, results in a preemptive gain of 190 ms (i.e., that much faster than the standard reaction time of 250 ms). Unfortunately, as depicted in Figure 14, this is a point in the with very low perceived agency of 0.18 (0-1 normalized scale). Thus, this system in its original form does not their users with a sense of \"I grabbed this pen\". Now, if we re-implement the Wired Muscle system we could take our findings as a way to maximize agency without sacrificing functionality. Researchers found that 200 ms reaction time is required to successfully catch the pen. Thus, computing backwards from the maximum time needed to grab the pen, we obtain through our model a new 50 ms preemptive gain (P д that still allows the user to catch the pen while providing a sense of agency of 0.65 (normalized\nThe improved system actuates the user 150 ms after the pen was released, instead of the old 10 ms. Thus, using our model we tripled perceived agency without compromising the Wired Muscle system's functionality, as depicted in Figure 14. The same reasoning could be used to improve other systems from the prior art, such as Affordance++ [38] or Stimulated Percussions [14], just to mention a few. In the case of Affordance++, the original system is based on trigger actions (e.g., \"user grabs the spray can\"), detected via optical tracking, which in turn activate muscle stimulations (e.g., using EMS \"the spray can shakes itself\"). Again, this system the EMS when the user grabs the spray can, even if the user actually wants \"to shake it\". Authors found in their studies that these automated actions shifted agency from the user to the object (e.g., \"it [the spray can] wants to shake\" [38]. Now, if we re-implement such a system, we could tune its temporal behavior to trigger the muscle stimulation later in the preemption-agency curve. In fact, in the case of Affordance++, we could select a timing around the user's average reaction time (e.g., 300 ms), which would grant much more perceived agency for the case in which both the user and the system decide to perform the same action.", "n_publication_ref": 5, "n_figure_ref": 3}, {"heading": "GROUNDING OUR RESULTS IN THE LITERATURE", "text": "We now discuss how our can both find validity in existing research and shape current theories of agency.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "How can someone feel in control with EMS actuation?", "text": "The most intriguing and exciting of our findings is not that our approach provides more agency than the current practice, but that so many participants in control even when the action was triggered by EMS. These participants voiced remarks at the end of the study such as \"I did not notice that I've got EMS\", \"I felt EMS sensation but still I believe I control my finger\", and so forth. To this end, the cognitive neuroscience literature provides a plausible explanation: as by Libet et al., the \"desire to act\" can arise, in consciousness, after the motor commands have been issued, i.e., after starting to move [31]. Thus, by designing our preemptive timing to provide a stimulus 80 ms before the participants' average reaction time, we have purposely inserted the involuntary muscle motion Libet's range, i.e., around 200-300 ms before the conscious act manifests itself. Thus, the of the motion (EMS) gets obfuscated in this timeline.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "The role of causality in our sense of agency", "text": "We now analyze our findings in light of Wegner's three agency principles [59]. Regarding the consistency principle, Wen et al. challenge it with their findings [61], they found that formance (i.e., quality of the outcome) more important to participants' sense of agency than the action-feedback association. With regards to the priority principle, David et al. found that, in an AR experiment where both the outcome (system's auditory response to a movement) and the participant's own movement were temporally manipulated, \"participants were more to delays of outcome than to delays of movement execution\". This speaks in favor of our approach, which provides an active manipulation of the execution (by preempting it), but attempts to preserve an optimal time in outcome presentation (by not preempting it too much). Also, it is worth noting that fact that preemptive action improved agency but never provided a sense of complete agency for all participants in all trials; this suggests that our results are in line with Haggard et al. 's four stages of agency [21], postulates a stage in which brain can veto a motor response [20].\nSense of agency vs. sense of ownership contemporary theories argue that the sense of agency (\"I did that\") influences and is influenced by the sense of ownership (\"that is me\"). However, research suggests that these are distinct neural mechanisms [27,58,64]. Much like agency, the ownership can be modulated using virtual repof one's own body (e.g., avatars in VR [4] or objects such as a rubber hand [7,32,62]). This manipulation of the sense of ownership has been shown in some cases to also affect the sense of agency [3,4].\nIn our investigations, we explored how to actuate users while maximizing their sense of agency. In fact, our choice of using electrical muscle stimulation as a haptic actuator, granted that users always felt (via their proprioception) that was their own body moving-we did not received commentary typical of participants experiencing a loss in sense of ownership. Thus, the choice of EMS as our haptic actuator puts aside, in broad terms, the concern of compromising sense of ownership. However, if researchers would apply our ideas to other haptic actuators that might be decoufrom the user's own body (e.g., teleoperating a robotic arm [49]), the interaction effects between preemption and sense of ownership might be worth investigating.", "n_publication_ref": 13, "n_figure_ref": 0}, {"heading": "OUTLOOK AND FURTHER IMPLICATIONS", "text": "We believe our findings will inspire areas in which interfaces have not benefited from any possibility of haptic au-On the most immediate level, we strongly believe our findings will provide more agency to the status-quo of interactive systems based on EMS; this includes possible improvements of commercially available force-feedback devices based on EMS (e.g., UnlimitedHand 2 ).\nFurther along, we believe these findings will inspire research that will extend their impact to mechanically actuated haptics. Here, the potential is to enable exoskeletoninterfaces to provide agency to the user. For instance, in the automated haptic juggling system by Ruffaldi [51], our findings could be used to tune their loop to vide more agency to the user as the robotic actuator throws the balls for them. opens a broader scope of haptic systhat subject to improvement through our findings, especially those that deal with haptic training, such as sports (e.g., catch-ball [25], Ping-Pong [17,28], boxing [36], juggling [51], biking [1] or music [14,57].", "n_publication_ref": 9, "n_figure_ref": 0}, {"heading": "CONCLUSIONS", "text": "demonstrated that it is possible to tune preemptive forcefeedback systems to provide their users with more agency. In our first study, we uncovered a timing that is optimal to deliver the haptic actuation (by means of EMS) without drastically the user's sense of agency. With preemptive timing, when the user and system move the user feels that they initiated the motion, yet their time is faster than usual. Then, in our second experiment, we found that our preemptive timing sigincreased agency when compared to the current practice in EMS-based devices. We concluded by illustrating, using examples from the HCI literature, how to leverage our to provide more agency to automated interfaces.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "This work was partially supported by Grant-in-Aid for JSPS Research Fellow (JP16J03777).\nWe kindly thank our colleague Jas Brooks (University of Chicago) for helping us proofread work and Daisuke Tajima his advice with our experimental design.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Exploring Human: EBike Interaction to Support Rider Autonomy", "journal": "ACM", "year": "2016", "authors": "Josh Andres; Julian De Hoog; Julian Jürg Von Känel; Bach Berk;  Le; Marcus Wang; Florian 'floyd' Brazil;  Mueller"}, {"title": "Input-output relations in simple reaction time experiments", "journal": "The Quarterly Journal of Experimental Psychology", "year": "1973-05", "authors": "A Angel"}, {"title": "Agency elicits body-ownership: proprioceptive drift toward a synchronously acting external Experimental Brain", "journal": "", "year": "2016-05", "authors": "Tomohisa Asai"}, {"title": "Body ownership causes illusory self-attribution of speaking and influences subsequent real speaking", "journal": "Proceedings of the National Academy of Sciences", "year": "2014-12", "authors": "Domna Banakou; Mel Slater"}, {"title": "Automation Technology and Sense of Control: A Window on Human Agency", "journal": "", "year": "2012-03", "authors": "Bruno Berberian; Jean-Christophe Sarrazin; Patrick Le Blaye; Patrick Haggard"}, {"title": "I Really Did That: Sense of Agency with Touchpad, Keyboard, and On-skin Interaction", "journal": "", "year": "2018", "authors": "Joanna Bergstrom-Lehtovirta; David Coyle; Jarrod Knibbe; Kasper Hornb\\a Ek"}, {"title": "Rubber hands 'feel' touch that eyes", "journal": "Nature", "year": "1998-02", "authors": "M Botvinick; J Cohen"}, {"title": "psychology of human-computer interaction", "journal": "L. Erlbaum Associates", "year": "1983", "authors": "K Stuart;  Card; P Thomas; Allen Moran;  Newell"}, {"title": "Agency in Mid-air Interfaces", "journal": "ACM", "year": "2017", "authors": "Patricia Ivette Cornelio Martinez; Silvana De Pirro; Chi Thanh Vi; Sriram Subramanian"}, {"title": "Beyond the Libet Clock: Modality Variants for Agency Measurements", "journal": "ACM", "year": "2018", "authors": "Patricia I Cornelio Martinez; Emanuela Maggioni; Marianna Kasper Hornb\\a Ek; Sriram Obrist;  Subramanian"}, {"title": "2012. I Did That! Measuring Users' Experience of Agency in Their Own Actions", "journal": "ACM", "year": "", "authors": "David Coyle; James Moore; Ola Per; Paul Kristensson; Alan Fletcher;  Blackwell"}, {"title": "The Sense of Agency Is More Sensitive to Manipulations of Outcome than Movement-Related Feedback Irrespective of Sensory Modality", "journal": "ONE", "year": "2016-08", "authors": "Nicole David; Stefan Skoruppa; Alessandro Gulberti; Johannes K Engel"}, {"title": "Do Implicit and Explicit Measures of the Sense of Agency Measure the Same Thing?", "journal": "PLOS ONE", "year": "2014-10", "authors": "John A Dewey; Günther Knoblich"}, {"title": "Stimulated Percussions: Techniques for Controlling Human As Percussive Musical Instrument by Using Electrical Muscle Stimulation", "journal": "ACM", "year": "2016", "authors": "Ayaka Ebisu; Satoshi Hashizume; Kenta Suzuki; Akira Ishii; Mose Sakashita; Yoichi Ochiai"}, {"title": "Who causing what? The sense of agency is relational and efferenttriggered", "journal": "Cognition", "year": "2008-05", "authors": "Kai Engbert; Andreas Wohlschläger; Patrick Haggard"}, {"title": "A Research Center for Augmenting Human Intellect", "journal": "", "year": "1968", "authors": "C Douglas; William K Engelbart;  English"}, {"title": "", "journal": "ACM", "year": "", "authors": ""}, {"title": "An Electrical Muscle Stimulation Haptic Feedback for Mixed Tennis Game", "journal": "", "year": "2000-12", "authors": "Farzam Farbiz;  Zhou Hao; Corey Yu; Waqas Manders; ; / C D Ahmad; S J Frith; D M Blakemore;  Wolpert"}, {"title": "Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in", "journal": "ACM", "year": "1991", "authors": "Xiaochi Gu; Yifei Zhang; Weize Sun; Yuanzhe Bian; Dao Zhou; Per Ola Kristensson"}, {"title": "", "journal": "", "year": "", "authors": ""}, {"title": "Timing and awareness of movement decisions: does consciousness really come too late? Frontiers in", "journal": "Human Neuroscience", "year": "2013-07", "authors": "Adrian G Guggisberg; Anaïs Mottaz"}, {"title": "Voluntary acand conscious awareness", "journal": "Nature Neuroscience", "year": "2002-04", "authors": "Patrick Haggard; Sam Clark; Jeri Kalogeras"}, {"title": "Sham or real-Post hoc estimation of stimulation condition in a randomized transcranial magnetic stimulation trial", "journal": "Neuroscience Letters", "year": "2010-02", "authors": "Uwe Herwig; Lizbeth Cardenas-Morales; Bernhard J Connemann; Thomas Kammer; Carlos Schönfeldt-Lecuona"}, {"title": "Stimulus information as a determinant of reaction time", "journal": "Journal of Experimental Psychology", "year": "1953", "authors": "Ray Hyman"}, {"title": "The mechanism of self-recognition in humans", "journal": "Behavioural Brain Research", "year": "2003-01", "authors": "Marc Jeannerod"}, {"title": "A Novel Interaction System with Force Feedback Between Real -Virtual Human: An Entertainment System", "journal": "ACM", "year": "2004", "authors": "Seungzoo Jeong; Naoki Hashimoto; Makoto "}, {"title": "Do You Feel in Control?\": Towards Novel Approaches to Characterise, Manipulate and Measure the Sense of Agency in Virtual Environments", "journal": "IEEE Transactions Visualization and Computer Graphics", "year": "2018-04", "authors": "C Jeunet; L Albert; F Argelaguet; A Lécuyer"}, {"title": "Moving a Hand that Feels Like Your Own: Dissociation of Ownership and Agency", "journal": "Frontiers in Human Neuroscience", "year": "2012", "authors": "Andreas Kalckert; H Henrik Ehrsson"}, {"title": "Visuo-haptic Collaborative Augmented Reality Ping-pong", "journal": "ACM", "year": "2007", "authors": "Gábor Benjamin Knoerlein; Harders Székely"}, {"title": "", "journal": "", "year": "", "authors": ""}, {"title": "Using Neuromuscular Electrical Stimulation for Pseudo-haptic Feedback", "journal": "ACM", "year": "2006", "authors": "Ernst Kruijff; Dieter Schmalstieg; Steffi Beckhaus"}, {"title": "Unconscious cerebral initiative and the role of conscious will in voluntary action", "journal": "Behavioral and Brain Sciences", "year": "1985-12", "authors": "Benjamin Libet"}, {"title": "TIME OF CONSCIOUS INTENTION TO ACT IN RELATION TO ONSET OF CEREBRAL ACTIVITY (READINESS-POTENTIAL)", "journal": "", "year": "", "authors": "Curtis A Benjamin Libet; Elwood W Gleason;  Wright"}, {"title": "That's not quite me: limb ownership encoding in the brain", "journal": "Social Cognitive and Affective Neuroscience", "year": "2016-07", "authors": "Jakub Limanowski; Felix Blankenburg"}, {"title": "Empirical Evidence for a Diminished Sense of Agency in Speech Interfaces", "journal": "ACM", "year": "2015", "authors": "Hannah Limerick; James W Moore; David Coyle"}, {"title": "Muscle-propelled Force Feed-Bringing Force Feedback to Mobile Devices", "journal": "", "year": "2013", "authors": "Pedro Lopes; Patrick Baudisch"}, {"title": "Interactive Systems Based on Electrical Muscle Stimulation", "journal": "Computer", "year": "2017", "authors": "P Lopes; P Baudisch"}, {"title": "Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Elec-Muscle Stimulation", "journal": "ACM", "year": "2015", "authors": "Pedro Lopes; Alexandra Ion; Patrick Baudisch"}, {"title": "Proprioceptive Interaction", "journal": "ACM", "year": "2015", "authors": "Pedro Lopes; Alexandra Ion; Willi Mueller; Daniel Hoffmann; Patrik Jonell; Patrick Baudisch"}, {"title": "Affordance++: Allowing Objects to Communicate Dynamic Use", "journal": "ACM", "year": "2015", "authors": "Pedro Lopes; Patrik Jonell; Patrick Baudisch"}, {"title": "Providing Haptics to Walls &#38; Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation", "journal": "ACM", "year": "2017", "authors": "Pedro Lopes; Sijing You;  Lung-Pan; Sebastian Cheng; Patrick Marwecki;  Baudisch"}, {"title": "The timing of the conscious intention to move", "journal": "The European journal of neuroscience", "year": "2008-12", "authors": "Masao Matsuhashi; Mark Hallett"}, {"title": "Agency Effects in Human-Computer Interaction", "journal": "International Journal of Human-Computer Interaction", "year": "2013-09", "authors": "John Mceneaney"}, {"title": "Designing for Flexible Interaction Between Humans and Automation: Delegation Interfaces for Supervisory Control", "journal": "Human Factors", "year": "2007-02", "authors": "A Christopher; Raja Miller;  Parasuraman"}, {"title": "Intentional binding and the sense of agency: a review", "journal": "Consciousness and Cognition", "year": "2012-03", "authors": "James W Moore; Sukhvinder S Obhi"}, {"title": "G : A Two-Handed Haptic Interface for Bimanual VR Interaction", "journal": "", "year": "2004", "authors": "Jun Murayama; Laroussi Bougrila; Yanlin Luo; Katsuhito Akahane; Shoichi Hasegawa; Béat Hirsbrunner; Makoto Sato"}, {"title": "Foreperiod and simple reaction time", "journal": "Psychological Bulletin", "year": "1981", "authors": "Pekka Niemi; Risto Näätänen"}, {"title": "Wired Muscle: Generating Faster Kinesthetic Reaction by Inter-personally Connecting Muscles", "journal": "ACM", "year": "2017", "authors": "Jun Nishida; Shunichi Kasahara; Kenji Suzuki"}, {"title": "bioSync: A Paired Wearable for Blending Kinesthetic Experience", "journal": "", "year": "2017", "authors": "Jun Nishida; Kenji Suzuki"}, {"title": "Simulated thought insertion: Influencing the sense of agency usdeception and magic", "journal": "Consciousness and Cognition", "year": "2016-07", "authors": "Jay A Olson; Mathieu Landry; Krystèle Appourchaux; Amir Raz"}, {"title": "Immersive teleoperation of a robot arm using electro-tactile feedback", "journal": "", "year": "2015", "authors": "D Pamungkas; K Ward"}, {"title": "", "journal": "", "year": "", "authors": ""}, {"title": "Cruise Control for Pedestrians: Controlling Walking Direction Using Electrical Muscle Stimulation", "journal": "", "year": "2015", "authors": "Max Pfeiffer; Tim Dünte; Stefan Schneegass; Florian Alt; Michael Rohs"}, {"title": "Annual ACM Conference on Human Factors in Computing Systems (CHI '15)", "journal": "ACM", "year": "", "authors": ""}, {"title": "Haptic of Juggling with Encountered Type Interfaces", "journal": "Presence: Teleoperators and Virtual Environments", "year": "2011", "authors": "Emanuele Ruffaldi; Paolo Tripicchio; Carlo Alberto Avizzano; Massimo Bergamasco"}, {"title": "Postdiction: its implications on visual awareness, hindsight, and sense of agency", "journal": "Frontiers in Psychology", "year": "2014-03", "authors": "Shinsuke Shimojo"}, {"title": "Unconscious determinants of free decisions in the human brain", "journal": "Nature Neuroscience", "year": "2008-05", "authors": "Chun Siong; Marcel Brass; Hans-Jochen Heinze;  John-Dylan"}, {"title": "Take Me I'M Yours: Mimicking Object Agency", "journal": "ACM", "year": "2012", "authors": "Chris Speed; Duncan Shingleton"}, {"title": "Programmed Six-Channel Electrical Stimulator for Complex Stimulation of Leg Muscles During", "journal": "IEEE Transactions on Biomedical Engineering BME", "year": "1979-02", "authors": "P Strojnik; A Kralj; I Ursic"}, {"title": "The experience of agency: an interplay between prediction and postdiction", "journal": "Frontiers in Psychology", "year": "2013", "authors": "Matthis Synofzik; Gottfried Vosgerau; Martin Voss"}, {"title": "PossessedHand: for Controlling Human Hands Using Electrical Muscles Stimuli", "journal": "ACM", "year": "2011", "authors": "Emi Tamaki; Takashi Miyaki"}, {"title": "Having body versus moving your body: How agency structures body-Consciousness and Cognition", "journal": "", "year": "2006-06", "authors": "Manos Tsakiris; Gita Prabhu; Patrick Haggard"}, {"title": "", "journal": "", "year": "", "authors": ""}, {"title": "The mind's best trick: how we experience conscious will", "journal": "Trends in Cognitive Sciences", "year": "2003-02", "authors": "M Daniel;  Wegner"}, {"title": "Feeling of control of an action after supra and subliminal haptic distortions", "journal": "Consciousness and Cognition", "year": "2015-09", "authors": "Sébastien Weibel; Patrick Eric Poncelet; Yvonne Delevoye-Turrell; Antonio Capobianco; André Dufour; Renaud Brochard; Laurent Ott; Anne Giersch"}, {"title": "The Sense of Agency during Continuous Action: Performance Is More Important than Action-Feedback Association", "journal": "ONE", "year": "2015-04", "authors": "Wen Wen; Atsushi Yamashita; Hajime Asama"}, {"title": "Proprioceptive drift in the rubber hand illusion is intensified following 1 Hz TMS of the left EBA", "journal": "Human Neuroscience", "year": "2014", "authors": "Andrew Wold; Jakub Limanowski; Henrik Walter; Felix Blankenburg"}, {"title": "Hand-Skill Learning Using Outer-Covering Hap-Display", "journal": "Springer", "year": "2014", "authors": "Vibol Yem; Hideaki Kuzuoka; Naomi Yamashita; Shoichi Ohta; Yasuo Takeuchi"}, {"title": "Revisiting the link between body and agency: visual movement congruency enhances intentional binding but is not body-specific", "journal": "Reports", "year": "2018-01", "authors": "Regine Zopf; Vince Polito; James Moore"}], "figures": [{"figure_label": "2", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 2 :2Figure 2: Setup for our preemptive action experiment.", "figure_data": ""}, {"figure_label": "3", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 3 :3Figure 3: Our tapping task.", "figure_data": ""}, {"figure_label": "4", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 4 :4Figure 4: Perceived agency score vs. EMS preemptive time. 0 ms denotes the moment the visual stimulus appeared and the vertical lines represent a particular participant's typical reaction time. Colored data points represent the different participants.", "figure_data": ""}, {"figure_label": "56", "figure_type": "", "figure_id": "fig_3", "figure_caption": "Figure 5 :Figure 6 :56Figure 5: EMS offset time vs. reaction time. Due to the limitation of experimental system, measured reaction time of less than -60 ms (with the system latency already subtracted), then the data point was capped at -60 ms.", "figure_data": ""}, {"figure_label": "7", "figure_type": "", "figure_id": "fig_4", "figure_caption": "Figure 7 :7Figure 7: Normalized perceived sense of agency [0-1] vs. resulting preemptive gain. The solid lines represent regression curves derived from a logistic regression for each participant.", "figure_data": ""}, {"figure_label": "8", "figure_type": "", "figure_id": "fig_5", "figure_caption": "Figure 8 :8Figure 8: Decomposing the user's reaction time into its constituents: perception + cognition + motor action. Our approach speeds up total reaction time by advancing the motor reaction component ahead of time (i.e., by preempting it).", "figure_data": ""}, {"figure_label": "", "figure_type": "", "figure_id": "fig_6", "figure_caption": "FigureFigure Our model derived Study 1's data. We highlight a critical point where both agency and reaction time are maximized, allowing for an 80 ms gain in the user's retime.", "figure_data": ""}, {"figure_label": "10", "figure_type": "", "figure_id": "fig_7", "figure_caption": "Figure 10 :10Figure 10: Summary of procedure for Study 2.", "figure_data": ""}, {"figure_label": "", "figure_type": "", "figure_id": "fig_8", "figure_caption": "FigureFigure Resultsfor the user's reaction time (median) in each condition for our tapping task.", "figure_data": ""}, {"figure_label": "12", "figure_type": "", "figure_id": "fig_9", "figure_caption": "12 :12Results for the user's perceived agency (median), for each condition.", "figure_data": ""}, {"figure_label": "13", "figure_type": "", "figure_id": "fig_11", "figure_caption": "Figure 13 :13Figure 13: Wired an EMS-based interface for speeding up reaction time. While in its original form it did not consider the loss in sense of agency, using preemptive action, it can still retain functionality and boost the perceived agency.", "figure_data": ""}, {"figure_label": "14", "figure_type": "", "figure_id": "fig_12", "figure_caption": "Figure 14 :14Figure 14: A researcher can optimize their system's agency by choosing a new timing for their preemptive actuation;we illustrate this at the example of improving the agency in the Wired Muscle system.", "figure_data": ""}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Unlimited Hand, http://unlimitedhand.com/, last accessed in 17/09/2018", "figure_data": "CHI 2019 Paper2019, May 4-9, 2019, Glasgow, Scotland,Paper 643"}], "doi": "10.1145/3290605.3300873"}