{"authors": "Eric M Young; Katherine J Kuchenbecker", "pub_date": "", "title": "Ungrounded Vari-Dimensional Tactile Fingertip Feedback for Virtual Object Interaction", "abstract": "Figure 1: Examples of the visual scene (top) and corresponding tactile cues (bottom) during virtual shape discrimination (left) and mass discrimination (right) tasks. In these examples, the wearable device is rendering 6-DOF tactile feedback to the user's index fnger; the platform orients itself to be tangent to the surface, contacts the appropriate position on the fngertip with varying normal force, and simultaneously applies tangential and rotational shear caused by the interaction taking place.", "sections": [{"heading": "INTRODUCTION", "text": "Daily physical interactions, such as fipping a switch or inserting a key into a lock, often involve complex tactile cues at the fngertips (Fig. 2). These soft, distal parts of the human hand are densely enervated with mechanoreceptors that enable precise perception of diverse object properties as well as competent control of contact [16]. Yet the haptic feedback provided by mainstream handheld devices, such as smartphones or virtual reality controllers, is typically limited to vibration [6]; these common haptic rendering approaches can catch the user's attention and communicate the intensity of the event taking place, but they cannot apply the same contact conditions to the skin as most of the original interactions being simulated. Even within academic research, the importance of reducing the weight and encumbrance of wearable haptic interfaces means that cutting-edge devices are well-suited to render only particular haptic interactions, rather than a more general set that ideally approaches all haptic interactions. To the best of our knowledge, no existing wearable haptic device can authentically render all three of the common interactions portrayed in Fig. 2.\nWe are curious to discover whether six-degree-of-freedom (6-DOF) approximation of tactile contact ofers any benefts over the lower-dimensional tactile rendering approaches that have been previously explored, as well as how strongly various dimensions of tactile feedback afect human motions during virtual object interaction. Although compelling haptic rendering can be achieved by applying feedback at other parts of the user's hand or body, the goal of this paper is to examine the role of tactile dimensionality at the fngertip, as the fngertip plays an essential role in manipulation tasks and is commonly the focus of haptic device research. As shown in Fig. 1, we are purposefully focusing on rich tactile cues and omitting the grounded forces and torques that physically oppose fnger movements during real contact in order to achieve a large workspace while limiting system cost and user encumbrance; this popular strategy is sometimes called sensory subtraction [35]. Importantly, even our complex 6-DOF consideration of fnger-surface interactions completely disregards the local shape and material properties of the object being contacted, which would require infnite dimensions for proper portrayal. Instead, we aim to represent any physical contact with the surface's local tangent plane as a frst-order approximation, in much the same way that computer graphics models often represent surfaces as polygon meshes.\nAfter analyzing related work (Sec. 2), we present our approach to creating a novel integrated system that can render 6-DOF fngertip tactile cues to a user exploring an immersive virtual environment (Sec. 3). This setup is capable of recreating a wide range of dynamic tactile interactions that have previously been achieved by individual devices published in the wearable haptics literature. We utilize this single system to simulate systems with fewer degrees of freedom in order to examine how the number of degrees of freedom of a device afects the user (Sec. 4).\nThe results of our study (Sec. 5) show that the perceptual performance of users is boosted by more complex rendering when the additional DOFs are relevant to the task at hand, in some cases approaching performance associated with real physical interactions. However, even this sophisticated system with 6-DOF tactile cues falls short of imitating the perceived realism associated with physical object interactions. Furthermore, users did not seem to adjust their exploratory movements based on the available tactile feedback DOFs, raising questions about whether naive individuals can take advantage of richer contact-based cues with minimal training and interaction time. We discuss our results (Sec. 6), refect on the limitations of our approach (Sec. 7), and summarize our fndings (Sec. 8) to enable other researchers to learn from this investigation. Our contributions include:\n• Strategies for creating a system that allows a participant to explore virtual environments while feeling tactile fngertip feedback of variable dimensions.\nFigure 2: Examples of three real-world interactions (upper panels) in which diferent dimensions of tactile feedback are experienced at distinct locations on the index fngertip (lower panels). In the frst example of pushing a button, only normal force is felt, near the tip of the fnger. Holding a heavy cup brings in translational shear in addition to normal force, with contact happening on the fat area of the fngerpad. The third example consists of pinching a card between the thumb and the side of the index fnger while the card is being pulled away (black arrow); this scenario causes normal force, translational shear, and rotational shear all collocated on the radial side of the index fnger.\n• A framework for rendering 1-DOF, 3-DOF, and 6-DOF fngertip tactile cues during virtual interactions with stationary surfaces and mobile objects. • Quantitative evidence to demonstrate that users can complete representative virtual tasks (shape discrimination and mass discrimination) with cutaneous feedback alone. • An analysis of the efect of the dimensionality of tactile fngertip feedback on perceptual performance and exploratory motions in the two studied tasks.", "n_publication_ref": 4, "n_figure_ref": 4}, {"heading": "RELATED WORK 2.1 Object Manipulation", "text": "Detailed studies of grasping and manipulation demonstrate that common tasks elicit complex haptic sensations on the fngertips. Kamakura et al. [17] classifed grips that humans use to grasp common objects, fnding that diferent objects consistently elicited contact with diferent parts of the index fnger, including the volar, radial, and distal aspects.  2 illustrates a small sample of common interactions discussed in these references, also depicting the corresponding forces that act at diferent locations on the index fnger.", "n_publication_ref": 1, "n_figure_ref": 1}, {"heading": "Fingertip Haptic Devices", "text": "Wearable one-degree-of-freedom (1-DOF) haptic devices have been presented for rendering contact location [36], tangential skin stretch [40] and normal indentation into the fngerpad [44]. Researchers have combined multiple 1-DOF devices into one system to render more complex interactions, such as using one voice coil on each fnger to enhance object manipulation [24], using up to 12 asymmetric actuators to render 6D directional cues to the hand [7], or using a single motor to move an electrode array around the fnger to present both skin stretch and pressure distribution with high spatial resolution [48]. This idea has also been extended to the design of various haptic hand exoskeletons and gloves that apply 1D haptic feedback to each fngertip, e.g., [13,26,41].\nThe feld of wearable haptics has also fostered the development of devices with more degrees of freedom. Two-DOF fngertip devices have provided 1D kinesthetic force feedback with 1D vibrotactile feedback [5], 1D tangential shear with 1D normal displacement [27,43,46], and 2D tangential shear [12,21,42,45]. Two 2-DOF tangential shear devices have been worn on the index fnger and thumb to successfully communicate 5-DOF directional cues [14]. Three-DOF fngertip devices have demonstrated the ability to move a contact element along a spherical surface around the fngertip and translate in the direction normal to the sphere [10,38], tilt a contact surface in place with 2 DOF and then extend into the volar side of the fngertip [2,32], or provide 3-DOF feedback that couples orientation and position in a more complex manner [25,34]. At least one design has ofered 3-DOF translation of a contact element with a fxed orientation to render more precise shear cues [37], and another has presented 3-DOF translation via asymmetric vibrations from three orthogonal actuators [19].\nWe refer the reader to a review by Pacchierotti et al. [31] for more information on the breadth of wearable haptic systems for the fngertip and hand.", "n_publication_ref": 27, "n_figure_ref": 0}, {"heading": "Implementation of Tactile Fingertip Feedback", "text": "Several studies have demonstrated that providing cutaneous and kinesthetic force feedback to the fngertip can improve curvature discrimination [3,9,34] or the perception of edges and texture [10], compared to providing kinesthetic feedback alone. Cutaneous feedback alone has been shown to reduce grasping forces during manipulation tasks [25,30], or allow participants to fnd and follow a virtual surface [38], but the addition of kinesthetic feedback often further improves performance [30,38].\nPrevious studies have shown that augmenting kinesthetic feedback with cutaneous skin stretch or slip can enhance the perception of friction [40] or reduce the force applied during a manipulation task [45]. Even in the absence of kinesthetic force feedback, skin stretch can allow participants to distinguish weight [27,37] or directional cues [12,21,42].\nA few wearable devices have rendered kinesthetic feedback to the fnger itself, rather than the entire limb, by grounding the device on the base of the fnger or on the hand. Benko et al. showed that the combination of kinesthetic and cutaneous feedback in this manner allowed the realistic presentation of virtual haptic interactions such as localizing targets or tracing lines [2]. Chinello et al. found that cutaneous feedback alone yielded better performance than no haptic feedback during robotic palpation and VR exploration tasks, and that the addition of kinesthetic feedback further improved performance in these tasks [3].\nEven from this brief summary of selected previous studies, it is clear that the addition of cutaneous feedback can improve performance in many tasks. However, these past works considered cutaneous feedback as a binary variable that is either present or not present, rather than considering and comparing the diferent types of cutaneous feedback that can be provided. In this work, we look more closely at how diferent dimensions of cutaneous feedback afect user performance to inform the design of future devices and the creation of future fngertip tactile feedback systems.", "n_publication_ref": 19, "n_figure_ref": 0}, {"heading": "The Fingertip Puppeteer", "text": "A potential solution for a higher-dimensional wearable haptic device was recently demonstrated in the Fingertip Puppeteer, or Fuppeteer for short [50]. This unusual tactile display employs a parallel continuum manipulator to move a fat surface around the user's fngertip with six DOF (see Fig. 1 and this paper's supplementary video). As such, this device has the potential to render the entire 6-DOF set of possible interactions between a stationary index fnger and a fat surface: one DOF for how hard the fnger presses into the surface (making contact and normal force), two DOFs for rotating the fnger such that a diferent location on the fngertip contacts the surface, two DOFs for sliding the fnger along the surface (translational shear), and one DOF for twisting the fnger on the surface (rotational shear).\nThe Fuppeteer can advantageously also simulate any other fngertip device that contacts the fnger with a fat surface, since the ranges of motion for all such devices fall within its range of motion. We thus decided to use this unique device to explore how the dimensionality of cutaneous fngertip feedback afects user movements and virtual object recognition. Importantly, this device has never before been integrated into a haptic rendering system; it was previously only characterized from an engineering standpoint and used in a perceptual validation study where it remained stationary on a table and delivered tactile cues to the user's fngertip (passive touch) [50].\nDespite its novelty and appeal, a few important limitations of the Fuppeteer were previously identifed [50]. As mentioned in Sec. 1, the Fuppeteer is able to render the tangent plane of a surface; it is not designed to display edges or highly curved surfaces. We previously noted that end-efector pose error tends to accumulate over time, and we presented a quick calibration routine through which accumulated error could be eliminated. Due to the compliance of the parallel continuum manipulator design, some end-efector motions result in sustained oscillations. However, we previously demonstrated that trajectory constraints minimized these vibrations, resulting in no noticeable oscillatory forces once the platform contacts the user's fngertip; we implement the same trajectory constraints in this paper. Although the Fuppeteer is position controlled, the device's compliance also means that forces acting on the end-efector cause some amount of deformation, resulting in a complex relationship between confguration and stifness. However, it was shown that feed-forward pose commands could be used to  render recognizable contact and shear cues at all locations on the fngertip. We apply the same assumption in this paper. Although more work is needed to understand the complexities of 6-DOF tactile cues presented by the Fuppeteer, we can nonetheless use this device to render meaningful tactile feedback and answer our research questions.", "n_publication_ref": 3, "n_figure_ref": 1}, {"heading": "SYSTEM INTEGRATION", "text": "The working principle of the selected 6-DOF device was initially proposed and demonstrated through a manually actuated prototype [49] and later refned and validated in a motorized device [50] that we adapted for use in this project. As illustrated in Fig. 3, six fexible, superelastic rods pass through a hand-held base platform and connect to a rigid end-efector that makes contact with the user's fngertip. We independently control the length of each rod, which enables us to set the position and orientation of the end-efector in a 6D workspace. As described below, a few key improvements were necessary to adapt the original design for use in a virtual environment.", "n_publication_ref": 2, "n_figure_ref": 1}, {"heading": "Counterweight", "text": "For the study discussed in this paper, we ask users to hold the device while exploring a virtual environment for approximately 60 minutes. However, the mass of the entire device with its six motors is 0.45 kg. When developing the study, we observed user fatigue before all of the trials were complete. We reduce user fatigue via a 1.5 kg counterweight attached to the device's hand-held base platform via a three-pulley system that has a 4:1 reduction ratio. The pulley system reduces the acceleration of the counterweight itself, limiting the efect of the counterweight's inertia on the force applied to the device, and preventing slack in the counterweight line unless the device is accelerated upward at over about 39 m/s 2 (four times gravitational acceleration).\nThe device's entire workspace and a schematic of the pulley system are shown in Fig. 4. The counterweight force always includes Figure 4: The workspace for the human-subject study (not drawn to scale). The counterweight pulley system is located above the middle of the back wall of the box, and it pulls upward on the haptic device to reduce the weight that must be supported by the participant. a vertical component that reduces the efective weight of the device, but it also includes a horizontal component, since the device is not always located directly beneath the point where the cable exits the last pulley. The highest ratio of horizontal component to vertical component in the counterweight force occurs when the device is positioned in an upper, front corner of the workspace, where a static device feels a vertical force of 3.6 N and a horizontal force of 0.8 N. Although the non-vertical component of the counterweight force may afect the user's motion, we empirically found the beneft of reducing the efective weight to greatly exceed the drawback of slightly pulling the device in the horizontal direction.", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "Device Positioning", "text": "The calibration routine we devised [50] to eliminate accumulated error requires a designated calibration pose. To ensure that error is consistently minimized throughout our human-subject study, we calibrate the device before each trial. During the majority of our study, the user is wearing a headset and is thus unable to see the physical world. We provide virtual cues to aid the subject in reaching the calibration pose, but small errors in our tracking or in the subject's trajectory can make this task difcult. To facilitate reaching the calibration pose, we designed a holder that physically funnels the device to the correct position and orientation, as shown at the bottom of Fig. 3.", "n_publication_ref": 1, "n_figure_ref": 1}, {"heading": "Finger Positioning", "text": "Another important improvement to the mechanical design of the selected device was the inclusion of a two-degree-of-freedom mechanism to position the fngertip. In [50], one strap was approximately located at the distal interphalangeal (DIP) joint of the index fnger, and a second strap was located on the proximal phalanx. Although these two straps allowed the device to be quickly donned and dofed, the fngertips of diferent subjects were held in diferent positions, depending on the curvature and size of the individual fnger. We previously found that the size of the user's fngertip had a signifcant efect on their perception of tactile cues [50], which suggests that fngertip position would also have a signifcant efect on perception with this device. Our new design replaces the distal strap with two narrow straps, each of which can be shortened or lengthened via two independent screw mechanisms. This setup benefcially allows independent adjustment of the overall tightness and the lateral position of the fngertip, as shown in Fig. 5.", "n_publication_ref": 2, "n_figure_ref": 1}, {"heading": "Sensing and Communication", "text": "We use an NDI 3D Guidance trakSTAR electromagnetic tracking system to measure the position and orientation of the hand-held portion of the device, and we then apply a constant transform to estimate the fngertip pose. A MATLAB program, which maintains the virtual environment parameters, uses the fngertip pose to compute the desired tactile interaction and the six associated rod lengths that are required to render this cue to the user.\nWe created a visual representation of our virtual environment in Unity, which is displayed to the user via an Oculus Quest VR headset. We pair the Quest with a Bluetooth ESP32 module, allowing fngertip pose to be transmitted to the Quest such that a virtual hand is visually presented at the same position and orientation as the user's actual hand. This wireless communication channel also allows MATLAB to receive user inputs from the Oculus Touch controller.\nAs in [50], the Fuppeteer is tethered for power and communication purposes. The tethered setup yields a range of motion for the user's fngertip of over 1 m in any direction, which is suitable for our purposes of examining tactile dimensionality in a lab setting. Future work related to portable power, computation, and sensing would be required to adapt the Fuppeteer to a consumer product with no tethering requirements.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "HUMAN-SUBJECT STUDY", "text": "We designed a human-subject study in which a user wears the haptic device to perform two perceptual tasks: a hidden surface task related to shape discrimination and a slider task related to mass discrimination. The user completes several trials of each task while the device provides tactile feedback to the right index fnger using one of four rendering methods. Following a within-subjects ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Haptic Rendering Methods", "text": "Three rendering methods simulate tactile feedback that would be provided by an n-DOF fngertip device, where n ∈ {1, 3, 6}, and one rendering method allows the user to interact with real objects. Our specifc defnitions for the three n-DOF haptic rendering methods are depicted in Fig. 6 and shown in the supplementary video. Our ultimate goal is to compare the subjects' performance and motion when each of these rendering methods is implemented, to better motivate what types of fngertip devices are best suited to represent diverse haptic interactions. Our 1-DOF controller simulates a device that moves a fat surface with fxed orientation to make contact with a single location on the fngertip and then apply variable normal force, similar to the VRTouch by Go Touch VR [44]. In this study, the 1-DOF contact location is defned by rotating 30 degrees from the volar aspect, or bottom, of the fngertip toward the distal tip. In general, we expect this 1-DOF rendering method to provide a natural representation of contact and penetration depth, especially when the pose of the user's hand would cause virtual contact to occur near the selected tactile feedback point.\nOur 3-DOF controller simulates a device that rotates a fat surface around the fnger center and then translates the surface into the fnger to apply variable normal force. This 3-DOF rendering method can similarly be used to display contact and penetration depth, but at diferent orientations and locations on the fngertip. Given the sensitivity of the fngerpad, the contact location is relatively easy to perceive. We expect this method to allow better understanding of a surface's local slope compared to the 1-DOF method.\nOur 6-DOF controller builds upon the 3-DOF controller by including three-dimensional shear cues. Once contact is made with the fngertip, the fat surface can then translate up to 4 mm in any direction tangent to the fngertip surface, and it can rotate up to 20 degrees in either direction about the vector normal to the fngertip surface. The friction between the skin and the platform causes translational and rotation traction that are difcult to see by eye but are relatively easy to feel.\nFor the trials with real-world haptics, we remove the end-efector of the device such that no contact is made. We then have the participant interact with a physical model of the virtual environment to complete the trial. Whereas the 1-, 3-and 6-DOF rendering methods provide only tactile feedback, the real rendering method also provides kinesthetic feedback (grounded forces and torques) because the fnger contacts real objects.", "n_publication_ref": 1, "n_figure_ref": 1}, {"heading": "Hidden Surface Task", "text": "In the hidden surface task, participants explore and try to recognize smoothly curving shapes defned by the equation\nz = ax 2 + by 2 ,(1)\nwhere the positive z-direction is up and a and b are assigned diferent values for each of six predetermined surfaces. In each trial, the subject explores a randomly selected surface while receiving tactile feedback from one of the four rendering methods. Images of all six possible surfaces, as shown in Fig. 7, are visible on the back wall of the virtual environment. Once the participant believes they know which surface is present, they use an Oculus controller in their left hand to select the corresponding image.\n4.2.1 Hidden Surface Motivation. These shapes were inspired by Kappers et al. [18], who asked participants to identify a wide range of three-dimensional quadric surfaces. Kirkpatrick and Douglas [20] used fve of these surfaces to evaluate point force devices, and Kuchenbecker et al. [22] used a similar set of fve surfaces to evaluate how a passive tactile display device afected three-dimensional shape recognition.\nOur six surfaces and their corresponding a and b values are shown in Fig. 7. Using the defnition of curvedness in [18], our fve non-fat surfaces have a curvedness of 4 m −1 , which is within the range of curvedness for their presented shapes. Each of the quadric surfaces spans x ∈ [−200 mm, 200 mm] and y ∈ [−150 mm, 150 mm], making them similar in size to the 200 mm diameter surfaces presented in [18]. Furthermore, it was shown in [20] that size only accounted for modest changes in the time needed to recognize the surface.", "n_publication_ref": 6, "n_figure_ref": 2}, {"heading": "Hidden Surface Haptics.", "text": "For our 1-DOF, 3-DOF, and 6-DOF haptic rendering methods, we frst compute the distance between the virtual fngertip center and the nearest point on the virtual surface, d V . We defne d H as the haptic distance from the real fngertip center to the device's platform, and we set the pose of the end-efector such that d H equals d V . The value of d H is restricted to a range of 4 mm to 12 mm, which allowed contact to be made and broken for all fngertip sizes observed in this study. For the 3-DOF and 6-DOF rendering methods, we also assign the orientation of the end-efector such that the fat contact surface is tangent to the virtual surface at the nearest point.\nOur 6-DOF rendering method includes three-dimensional shear cues. When the fnger makes contact with and moves tangent to the surface, the end-efector moves up to 4 mm in the opposite direction so to render translational shear. When the fnger rotates about the surface's normal vector, the end-efector rotates up to 20 degrees about the same vector in the opposite direction, such that rotational shear is presented. We reduce end-efector translational shear by a factor of fve relative to fnger motion, in order to reduce the tactile sensation noise related to fnger drift, which can be relatively large when a user holds his or her fnger in free space. We also have the end-efector pose creep toward the current fnger pose through a discrete 1 Hz low-pass flter so that we can continue to present shear during longer motions.\nFor our real-world rendering method, we remove the end-efector and place a 3D-printed surface in the same position as the virtual surface, allowing the participant to receive natural haptic feedback as the environment is explored. In these tasks, the participant continues to wear the headset so that the physical surface is not visible. An additional face shield was used to prevent viewing of the surface or the device through gaps around the headset.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Hidden Surface", "text": "Hypotheses. We expect participants to implement diferent exploration techniques depending on the haptic rendering method. The 1-DOF controller provides no slope information; in this condition we thus expect participants to determine the shape of the surface by making and breaking contact multiple times, comparing the height of the surface at each location. With the 3-DOF and 6-DOF controllers, however, we expect the participant to immediately sense the slope of the surface during each contact, leading participants to move more horizontally along the surface. We also expect participants to complete the task more quickly and accurately with the 3-DOF and 6-DOF controllers than with the 1-DOF controller, as prior literature suggests that haptic curvature perception is dominated by local surface orientation [33,47].", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Slider Task", "text": "In the slider task, participants must determine whether the mass of a disk is less than or greater than the mass of a reference disk, which is provided for the subject to interact with at their own discretion. The light, reference, and heavy sliders have masses of 13 g, 18 g, and 23 g respectively, which pilot studies suggested are difcult, but possible, to discern. Each diskhas a diameter of 50 mm and a height of 10 mm. Subjects are not allowed to pick up the disks, but rather they must estimate the mass by pressing their index fnger into the disk and sliding it on the table anywhere in the workspace. To give a response, the participant must slide the disk to a region marked 'Light', or a region marked 'Heavy', both of which are approximately 300 mm from the starting location.\n4.3.1 Slider Motivation. Many previous studies have explored how efectively wearable fngertip devices can render the mass of an object [4,11,27,28,37,39]. In most of these studies, participants pinched virtual objects between their thumb and index fnger while haptic feedback was provided to both fngers. We present a similar scenario in which participants slide a disk on a fat table, such that we must provide haptic feedback to only the index fnger. Although this scenario does not present the weight of a held object, we still render the inertial forces associated with accelerating the object. Exploratory motions with acceleration peaks were required in [11] and were observed without prompting in [39] for conditions in which only skin deformation was rendered.", "n_publication_ref": 8, "n_figure_ref": 0}, {"heading": "Slider Haptics.", "text": "For our 1-DOF, 3-DOF, and 6-DOF haptic rendering methods, the virtual disk slides on the table only when the virtual fngertip presses into the top of the disk by a required penetration depth, p. This condition follows from the assumption that a real disk moves only when static friction between the fnger and the disk is greater than static friction between the disk and the table, as determined by the mass, fnger force, and coefcients of friction. For the three real disks, the required penetration depths are within 1 mm of each other. For the virtual disks, we scale p to account for measurement error and fnger drift associated with trying to keep a fnger stationary in free space. Moving our virtual disks requires a penetration depth, p, of 2 mm for the light disk, 4 mm for the reference disk, and 6 mm for the heavy disk. Once the required penetration depth is met, the virtual slider moves with the fnger.\nSimilar to the hidden surface task, we defne d V as the distance between the top surface of the slider and the virtual fngertip center, and we defne d H as the distance between the haptic contact surface and the real fngertip center. Fig. 8 shows the relationship between d H and d V for the slider task. This piecewise mapping ensures that no haptic feedback is given before the virtual fnger touches the disk and that every participant receives the same 2 mm range of normal displacement between frst contact and maximum required virtual penetration depth of 6 mm. For every rendering method, the participant has to press farther into heavier disks and feel larger normal forces in order to move the disk.\nOur 6-DOF controller also provides feedback related to the inertia of the disk. We pass the disk's acceleration through a discrete 5 Hz low-pass flter, to reduce noise associated with our fnger pose measurements, and we multiply by the disk's mass to estimate applied force. For the trials with real disks, participants receive some amount of kinesthetic force feedback in addition to tactile skin stretch feedback. Suchoski et al. reported that the Weber Fraction, or the just noticeable diference in proportion to the reference value, of virtual mass was approximately three times greater for skin deformation feedback than for kinestheticforce feedback [39]. To account for this ratio, we scaled the diference between the virtual masses and the reference mass by a factor of three. After implementing this scaling in a pilot study, we found that a shear displacement to force ratio of 40 mm/N resulted in the task being diffcult, but possible. This ratio of skin stretch to force is much higher than was reported in [39] and [37], but as was discussed in Sec. 2.4, the Fuppeteer's end-efector is not perfectly rigid. Our efective stifness accounts for fngertip stifness and end-efector stifness in series, resulting in a lower efective stifness (0.025 N/mm) than for the fngertip shear stifness alone, which Nakazawa et al. report as approximately 0.2 N/mm when contact force is 1 N [29].\nFor our natural haptic feedback controller, we provide physical disks for the participant to interact with. Similar to the hidden surface task, we have the subject wear the device, but we remove the end-efector. It is difcult to align a virtual slider with a real slider well enough that it can be efectively manipulated, so we do not have the participant wear the VR headset. We 3D-printed disks with diferent amounts of infll, such that they are externally identical but have the specifed masses of 13 g, 18 g, and 23 g for the light, reference, and heavy disks respectively. We also attached a layer of 0.3 mm Tefon to the base of each disk to reduce friction, since our virtual representation of this environment did not include friction.", "n_publication_ref": 4, "n_figure_ref": 1}, {"heading": "Slider Hypotheses.", "text": "For both the 1-DOF and 3-DOF rendering methods, we expect participants to be able to distinguish slider mass only from the penetration threshold, as these conditions provide no skin stretch feedback. Users can compare the diferent penetration distances by making slow and careful motions, pressing into the top surface of the slider while trying to move it laterally. We do not expect the slope information provided by the 3-DOF controller to substantially beneft the user in this task. In contrast, the 6-DOF controller provides tactile shear that is proportional to the disk's mass, which we anticipate will help with the task. Accordingly, we expect users to move the sliders horizontally with large accelerations to emphasize this cue.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Procedure", "text": "Each subject frst gave informed consent and flled out an initial survey. Twenty people participated in the study, which was approved by the Institutional Review Board of the University of Pennsylvania under protocol number 843647. Participation took between 60 and 90 minutes; individuals not employed by the Max Planck Society were paid 8 euros per hour for their time. Our participant pool included thirteen females and seven males, with ages between 25 and 56 (mean of 32, standard deviation of 8.6). Their experience with haptic devices included 'None' (3 users), 'Limited' (8), and 'Moderate' (9), and their experience with VR included 'None' (2), 'Limited' ( 9), 'Moderate' (8), and 'Extensive' (1).\nThe device was worn on the subject's right index fnger across all trials. A visual representation of the subject's hand was depicted in the virtual environment and followed the user's real motion. Both tasks took place in a virtual box with a width of 400 mm, depth of 300 mm, and height of 300 mm. We did not physically restrict the user's motion, but if the user moved beyond the boundaries, the penetrated wall turned red.\nThe study was broken into four blocks, each associated with one of the four rendering methods. Block order was assigned by a balanced Latin square for every four participants. We are interested in observing how participants naturally use these rendering methods to try to complete the tasks, rather than training participants to employ new exploratory techniques in order to succeed in each specifc task. As such, participants were told that each rendering method was unique, but they were not given specifc details as to how the methods difered.\nWithin each block, the participant frst donned the Fingertip Puppeteer on their right index fnger, and the experiment administrator adjusted the straps such that the fngertip was securely held in the proper location. The subject then put on the VR headset and began the hidden surface task, consisting of two training trials, which the surface was shown to the participant, and four test trials, in which the surface was invisible. After the hidden surface task, subjects completed the slider task, which again consisted of two training trials and four test trials. Surface types and slider masses were randomized, although the two training types were not allowed to be the same. Sample trials are shown in Fig. 9. Before each trial, the device was automatically calibrated using a trakSTAR sensor embedded in the end-efector, as is described in [50].\nWe recorded the duration, accuracy, and motion trajectory associated with each trial. Following completion of the slider task, the participant removed the headset and the fngertip device. They then completed a survey specifc to the most recent rendering method, with fve-point scales for the realism of each task and the overall comfort of the rendering method. Two free-response questions allowed participants to note any aspects of the rendering method that worked well or poorly. After all four blocks had been completed, subjects were able to provide additional comments in a closing free-response question.", "n_publication_ref": 5, "n_figure_ref": 1}, {"heading": "RESULTS", "text": "We focused our analysis of the study results on performance metrics, motion metrics, and qualitative feedback.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Performance Metrics", "text": "Success rates and completion times for each rendering method are shown in Table 1. We computed the accuracy for each of the twenty participants within each task and rendering method as an interval variable, and we performed one-tailed one-sample t-tests to compare the responses to chance, with Bonferroni correction. All four rendering methods signifcantly outperformed chance (16.7%) in the hidden surface task, whereas only the 6-DOF and real rendering methods signifcantly outperformed chance (50%) in the slider task, with p < 0.05.\nWe also compiled the participants' responses into confusion matrices for each rendering method during the hidden surface task (Fig. 10) and the slider task (Fig. 11). Perfect identifcation would yield a diagonal confusion matrix; the diagonal is almost perfect for real rendering on the surface identifcation task but not for any of the other confusion matrices. We note that 1-DOF tactile rendering resulted in 14 surfaces incorrectly labeled as the fat surface (20.9% of non-fat surfaces), whereas the 6-DOF method yielded the next highest number of fat surface false-positives at three (4.8% of non-fat surfaces).\nFor further analysis, we conducted a two-way ANOVA to examine the efect of task and rendering method on success rate. We found a statistically signifcant interaction between task and rendering method (F = 4.49, p < 0.01). We then conducted a oneway ANOVA within each task and found a signifcant efect of rendering method on success rate for both the hidden surface task (F = 14.55, p < 0.001) and the slider task (F = 2.78, p = 0.047). In the hidden surface task, Tukey's post-hoc analysis yielded signifcant diferences between the real rendering method and each of the other three methods (p < 0.001), but no statistically signifcant differences were found between the 1-and 3-DOF methods (p = 0.48), the 1-and 6-DOF methods (p = 0.89) or the 3-and 6-DOF methods (p = 0.89).\nIn the slider task, Tukey's post-hoc analysis yielded no statistically signifcant diferences between rendering methods. The 1and 3-DOF (p = 0.96), and the 6-DOF and real (p = 0.99) were the pairings least likely to be signifcantly diferent, followed by the 1-and 6-DOF (p = 0.39), 1-DOF and real (p = 0.22), 3-and 6-DOF (p = 0.17), and 3-DOF and real (p = 0.09).\nThe mean ratings from qualitative surveys administered after the completion of each rendering method are provided in Table 2. Using the Kruskal-Wallis test, we found that hidden surface task realism, slider task realism, and overall comfort were each signifcantly afected by rendering method (p < 0.01). Post-hoc analysis showed that the real rendering method yielded signifcantly higher hidden surface realism ratings than each of the other three rendering methods, and signifcantly higher slider realism and overall comfort ratings than the 1-DOF rendering method (p < 0.05). Other comparisons were not signifcant. Figure 10: Confusion matrices of the responses given in the hidden surface task for each rendering method. Each confusion matrix represents 80 trials, but because trial types were randomized, the number of trials within each row are not equal.", "n_publication_ref": 0, "n_figure_ref": 3}, {"heading": "Exploratory Motions", "text": "In general, distinct users implemented a wide variety of exploratory techniques during the human-subject study. In the hidden surface task, some participants implemented sweeping horizontal motions (Fig. 12(a)), whereas other participants instead favored vertical poking motions (Fig. 12(b)). Similarly, in the slider task some subjects vigorously shook the slider side-to-side (Fig. 12(c)), whereas others made more precise, slow motions (Fig. 12(d)).\nWe measured the total horizontal and vertical distances travelled by the user's fnger, which we normalized with respect to trial duration, resulting in average horizontal and vertical speeds for each trial. We also computed the horizontal and vertical accelerations by passing the cubic interpolation of the position data through a 5 Hz low-pass flter and taking the second derivative. The horizontal and vertical speeds and accelerations across all trials are shown in Fig. 13. Finally, to highlight the variation between participants, we show the vertical speeds and horizontal accelerations for each participant during the hidden surface and slider tasks, respectively, in Fig. 14.\nWe performed a one-way repeated measures ANOVA with Tukey post-hoc analysis on the motion measurements within each task.  2: Mean subjective ratings (± S.E.) for each rendering method. Realism for each task was rated on a numeric scale from very unrealistic (1) to very realistic (5), and overall comfort was rated from very uncomfortable (1) to very comfortable (5).\nIn the hidden surface task, we found a signifcant efect of rendering method on horizontal speeds (F = 11.21, p < 0.001); the real rendering method prompted larger horizontal speeds than each of the other three methods (p < 0.01). In the slider task, we found a signifcant efect of rendering method on vertical speeds (F = 11.35, p < 0.001) and that the real rendering method resulted in smaller vertical speeds than each of the other methods (p < 0.01). No other individual comparisons were statistically signifcant.\nWe also looked at the relationship between exploratory motions and performance, but we found no signifcant diferences between the speeds or accelerations implemented during successful trials versus unsuccessful trials. Across all trials for both tasks, we measured overall speeds (mean ± standard error) of 0.109 ± 0.003 m/s during successful trials and 0.110 ± 0.003 m/s during unsuccessful trials. Looking more closely at slider task trials with 6-DOF tactile feedback, during which horizontal acceleration directly afects the amount of tactile shear rendered to the user, we measured horizontal accelerations of 0.798 ± 0.073 m/s 2 during successful trials and 0.858 ± 0.094 m/s 2 during unsuccessful trials.", "n_publication_ref": 2, "n_figure_ref": 6}, {"heading": "Qualitative Feedback", "text": "Answers to the free-response questions largely upheld the quantitative results. Seventeen comments specifed that the hidden surface task was well-rendered by the 3-DOF and 6-DOF tactile methods, with fve comments directly mentioning the ability to feel the 'slope' or 'curvature' of the surfaces. Two positive comments for the 6-DOF method noted the 'continuous' feel of the surfaces (P2, P5), whereas three negative comments for the 1-DOF method noted the absence of a 'continuous' feeling (P2, P5, P6). For the 6-DOF rendering, fve participants stated that the slider task felt somewhat easier, with comments such as \"I had the feeling I was now able to better determine... what disc was heavier, but only slightly\" (P12). Overall, participants consistently noted that they struggled during the slider task, with every rendering method (including real haptic feedback) receiving from four to eight comments related to slider task difculty.\nFree-response answers also provide additional insight into components of the study that were not directly measured. Two subjects disliked the virtual fnger being able to penetrate the virtual surface: \"I didn't like that the virtual hand was able to go through the virtual hidden surface...\" (P1) and \"the fnger crossed the surface visually\" (P5). A third user noted a shortcoming of the system was that there was \"no modeling of infnite resistance like for real surfaces\" (P6).\nDespite our eforts to minimize weight supported by the user, some participants still commented on the device's mass. Two participants described discomfort caused by weight: \"The device is a bit heavy for me\" (P4) and \"the weight was a bit too high\" (P5). Three participants noted that the weight of the device may have afected performance (P2, P6, P19), and one attributed blame to the counterweight itself: \"I think that the foating counterweight made it harder for me to distinguish how hard I was pushing on the slider\" (P17).\nWhile administering the study, we observed multiple subjects who spent more time exploring the edges of the hidden surfaces when interacting with the real physical surfaces (real haptic rendering) than when the surfaces were virtually rendered by the 1-, 3-, or 6-DOF methods. A few participants lamented that edges were not rendered for virtual surfaces: \"The edges of the surfaces were not very clear. \" (P18), and \"I couldn't feel the edges of the surfaces for the hidden surface task\" (P13).\nAlthough these critical comments may be more interesting to the reader and better motivate design decisions for future tactile fngertip feedback systems, we also received many written and verbal comments expressing an overall pleasant experience with the tested system, some of which we highlight here: \"Good resolution of force. \" (P6, 1-DOF), \"I really enjoyed the hidden surface task\" (P4, 6-DOF), and \"I really like the detail where the device swivels around the tip of the fnger!\" (P17, closing).   ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "DISCUSSION", "text": "literature that suggests haptic curvature perception is dominated y local surface orientation [33,47]. Non-fat surfaces were also ncorrectly labeled fat over four times as frequently with the 1-DOF ethod than the other methods. However, all four of the rendering b In the hidden surface task, we recorded higher mean success rates, completion times, and realism ratings for the 3-and 6-DOF rendering methods than for the 1-DOF method, which fts with prior i m methods yielded surface identifcation rates better than chance, and none of the pairwise diferences between success rates of the three tactile-only rendering methods were statistically signifcant. These fndings suggest that there is minimal beneft from providing higher-dimensional tactile feedback in the absence of kinesthetic force feedback for this particular task. The large extent of the surfaces may have enabled reasonably accurate recognition simply through recognition of the spatial regions that cause fngertip contact, the cue that is provided even by the simplest 1-DOF rendering scheme. The real rendering method signifcantly outperformed the three tactile-only rendering methods, suggesting that kinesthetic force feedback, which was presented in each of the past works cited as motivation [18,20,22,33,47], is superior to tactile feedback alone for this shape discrimination task.\nIn the slider task, success rates for the 1-DOF and 3-DOF rendering methods were approximately equal to chance (50%), suggesting that participants did not notice any diference between the required penetration depths. The 6-DOF and real rendering methods resulted in success rates greater than chance, showing that the relationship between shear skin stretch and inertia was more easily perceived by users. The similarity of the success rates for the 6-DOF and real rendering methods in the slider task also suggests that our shear representation was reasonably realistic, despite the incomplete modelling of end-efector stifness as a function of confguration.\nInterestingly, exploration techniques were not heavily infuenced by rendering method but instead seem to depend more strongly on individual preference. For example, P13 consistently applied relatively large horizontal accelerations to the slider, even when no tactile representation of inertia was provided, whereas P11 consistently applied small horizontal accelerations to the slider, even when skin stretch proportional to acceleration was rendered. Although participants were only able to perform mass discrimination at rates above chance when inertia was presented through tactile shear, the presence of this shear did not elicit larger accelerations or any other change in exploratory motion. Naive users seemingly expected the tactile fngertip feedback to accommodate their exploratory tendencies, and as such, subjects did not adjust their motions to match the provided tactile sensations.\nSuccess rates were also independent of exploratory motion, as users implemented nearly identical overall fngertip speeds during successful and unsuccessful trials. If system latency hindered the haptic rendering, we would expect performance to degrade when users move more quickly. Instead, performance is consistent regardless of user speed, suggesting participants are able to intuitively understand and compensate for any delays between virtual interaction and tactile feedback. During the 6-DOF rendering of the slider task, when tactile shear is directly related to user acceleration, we still do not fnd a signifcant efect of acceleration on performance. It is possible that during these interactions in which we expect large accelerations to yield better results, latency has a more negative impact and thus ofsets the expected benefts of high-acceleration exploratory techniques.\nEven when real tactile and kinesthetic feedback was provided, we measured signifcant diferences in exploratory motion only with respect to horizontal speeds during the hidden surface task and vertical speeds during the slider task. The diference in vertical speeds during the slider task is expected, since the fnger is unable to penetrate the real disks, which remained at a constant height. A similar rationale may explain the increase in horizontal speed during the hidden surface task, as participants may focus on horizontal exploration when kinesthetic feedback limits vertical exploration. However, the increase in horizontal speed with real feedback may also be attributed to greater comfort or confdence while exploring the surface, or less concern regarding the bandwidth of the system. Multiple users commented that the weight of the device infuenced their perception, suggesting that higher velocities and accelerations might have been measured if the device was lighter.\nWe also note that some participants poked downward on the slider rather than moving it, suggesting either confusion between the physical properties of mass and stifness, or an expectation for virtual mass to be haptically rendered as virtual stifness. Interestingly, two participants poked the real sliders at least once. The perceptual confusion between mass and stifness provides additional insight to the fndings of Schorr et al. [37], who previously reported that a change in virtual mass was sometimes perceived as a change in stifness or friction.\nAnswers to the free-response questions provide deeper understanding of the strengths and shortcomings of the tactile rendering methods and our overall system. Free-responses that commented on discomfort caused by the virtual fnger passing through the virtual surface imply a desire for, at a minimum, visual kinesthetic feedback, which is also often called pseudo-haptics 23]. One comment noting the 'lack of infnite resistance' reafrmed the request for kinesthetic force feedback. Other featured comments suggested potential improvements related to reducing the mass of the device or enabling the system to render edges as well as faces.", "n_publication_ref": 8, "n_figure_ref": 0}, {"heading": "LIMITATIONS AND FUTURE WORK", "text": "This study was limited to four rendering methods and two tasks. We are interested in expanding our set of rendering methods, such as providing shear skin stretch at a single location on the fngertip, and continuing to explore how diferent dimensions of fngertip tactile rendering afect performance in additional tasks.\nImportantly, the study instructions provided no information as to how the rendering methods difered, or how each rendering method could be used to complete the tasks. This approach allowed us to observe naive performance, but it also proved challenging for some participants who never discovered exploration techniques that yielded positive results. If the tactile rendering methods were explained, or if suggested exploratory techniques were provided, users would most likely be better able to discern which techniques work best for a particular task and rendering method, rather than consistently trying the same technique. Alternatively, more exposure time and feedback about answer correctness would most likely have enabled users to discover better techniques on their own but would have increased study duration and fatigue.\nAdditionally, we want to explore how the relative scaling of different tactile cues afects exploratory procedures. For example, our required penetration depths did not enable participants to discern lighter and heavier disks at rates greater than chance, but we expect that penetration depth would allow efcient discrimination at some scaling value. Furthermore, if the disks could be easily identifed from penetration depth, users who are naturally inclined to vigorously shake the disk may instead implement slower, more precise vertical motions. It would be interesting to explore what type and scaling of feedback are required to convince users to adjust their natural exploratory techniques, and whether this adjustment can consequently improve performance.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "CONCLUSION", "text": "We integrated a recently invented 6-DOF fngertip tactile device into an immersive VR system with haptic feedback and programmed it to render feedback as would be provided by devices with varying degrees of freedom. We presented rendering algorithms for 1-, 3-, and 6-DOF tactile cues during a shape discrimination and a mass discrimination task. We found that only the 6-DOF tactile feedback allowed both tasks to be completed better than chance, but that the dimensionality of tactile feedback does not strongly afect the exploratory techniques implemented by the user. We hope our work will encourage future tactile device designs that can present a wide variety of virtual interactions and inspire additional research into how tactile dimensionality and individual preference infuence the utility of wearable haptic devices.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "We thank Bernard Javot for guidance in manufacturing various components and Seyhan Sitti for assistance in 3D-printing surfaces and components. This research is supported in part by the US National Science Foundation Graduate Research Fellowship Program under Grant No. DGE-1321851.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "The Ninapro Database: a Resource for sEMG Naturally Controlled Robotic Hand Prosthetics", "journal": "IEEE", "year": "2015", "authors": "Manfredo Atzori; Henning Müller"}, {"title": "NormalTouch and TextureTouch: High-Fidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers", "journal": "", "year": "2016", "authors": "Hrvoje Benko; Christian Holz; Mike Sinclair; Eyal Ofek"}, {"title": "A Modular Wearable Finger Interface for Cutaneous and Kinesthetic Interaction: Control and Evaluation", "journal": "IEEE Transactions on Industrial Electronics", "year": "2020-02", "authors": "Francesco Chinello; Monica Malvezzi; Domenico ; Claudio Pacchierotti"}, {"title": "Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality", "journal": "Association for Computing Machinery", "year": "2017", "authors": "Inrak Choi; Heather Culbertson; Mark R Miller; Alex Olwal; Sean Follmer"}, {"title": "CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality", "journal": "Association for Computing Machinery", "year": "2018", "authors": "Inrak Choi; Eyal Ofek; Hrvoje Benko; Mike Sinclair; Christian Holz"}, {"title": "Vibrotactile Display: Perception, Technology, and Applications", "journal": "", "year": "2013-09", "authors": "Seungmoon Choi; Katherine J Kuchenbecker"}, {"title": "WAVES: A Wearable Asymmetric Vibration Excitation System for Presenting Three-Dimensional Translation and Rotation Cues", "journal": "Association for Computing Machinery", "year": "2017", "authors": "Heather Culbertson; Julie M Walker; Michael Raitor; Allison M Okamura"}, {"title": "The GRASP Taxonomy of Human Grasp Types", "journal": "IEEE Transactions on Human-Machine Systems", "year": "2016-02", "authors": "Thomas Feix; Javier Romero; Heinz-Bodo Schmiedmayer; Aaron M Dollar; Danica Kragic"}, {"title": "A Fingertip Haptic Display for Improving Curvature Discrimination", "journal": "Presence: Teleoperators Virtual Environments", "year": "2008-12", "authors": "Antonio Frisoli; Massimiliano Solazzi; Fabio Salsedo; Massimo Bergamasco"}, {"title": "A New Wearable Fingertip Haptic Interface for the Rendering of Virtual Shapes and Surface Features", "journal": "IEEE", "year": "2016", "authors": "Massimiliano Gabardi; Massimiliano Solazzi; Daniele Leonardis; Antonio Frisoli"}, {"title": "HapTip: Displaying Haptic Shear Forces at the Fingertips for Multi-Finger Interaction in Virtual Environments", "journal": "Frontiers in Robotics and AI", "year": "2016-04", "authors": "Adrien Girard; Maud Marchal; Florian Gosselin; Anthony Chabrier; François Louveau; Anatole Lécuyer"}, {"title": "Design of a Fingertip-Mounted Tactile Display with Tangential Skin Displacement Feedback", "journal": "IEEE Transactions on Haptics", "year": "2010-11", "authors": "Brian T Gleeson; Scott K Horschel; William R Provancher"}, {"title": "Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in VR", "journal": "Association for Computing Machinery", "year": "1991", "authors": "Xiaochi Gu; Yifei Zhang; Weize Sun; Yuanzhe Bian; Dao Zhou; Per Ola Kristensson"}, {"title": "Back-to-back Skin Stretch Feedback for Communicating Five Degree-of-Freedom Direction Cues", "journal": "IEEE", "year": "2013", "authors": "Ashley L Guinan; Nicholas C Hornbaker; Markus N Montandon; Andrew J Doxon; William R Provancher"}, {"title": "On utilizing pseudo-haptics for cutaneous fngertip haptic device", "journal": "", "year": "2014", "authors": "Inyoung Jang; Dongjun Lee"}, {"title": "Coding and Use of Tactile Signals from the Fingertips in Object Manipulation Tasks", "journal": "Nature Reviews Neuroscience", "year": "2009-04", "authors": "Roland S Johansson; J Randall Flanagan"}, {"title": "Patterns of Static Prehension in Normal Hands", "journal": "American Journal of Occupational Therapy", "year": "1980-07", "authors": "Noriko Kamakura; Michiko Matsuo; Harumi Ishii; Fumiko Mitsuboshi; Yoriko Miura"}, {"title": "Haptic Identifcation of Curved Surfaces", "journal": "Perception and Psychophysics", "year": "1994-01", "authors": "M L Astrid; Jan J Kappers; Inge Koenderink;  Lichtenegger"}, {"title": "HapCube: A Wearable Tactile Device to Provide Tangential and Normal Pseudo-Force Feedback on a Fingertip", "journal": "Association for Computing Machinery", "year": "2018", "authors": "Hwan Kim; Hyeonbeom Yi; Hyein Lee; Woohun Lee"}, {"title": "Application-based Evaluation of Haptic Interfaces", "journal": "", "year": "2002", "authors": "Arthur E Kirkpatrick; Sarah A Douglas"}, {"title": "", "journal": "IEEE", "year": "", "authors": ""}, {"title": "Mobile Navigation Using Haptic, Audio, and Visual Direction Cues with a Handheld Test Platform", "journal": "IEEE Transactions on Haptics", "year": "2012-10", "authors": "Rebecca L Koslover; Brian T Gleeson; Joshua T De Bever; William R Provancher"}, {"title": "The Touch Thimble: Providing Fingertip Contact Feedback During Point-Force Haptic Interaction", "journal": "IEEE", "year": "2008", "authors": "Katherine J Kuchenbecker; David Ferguson; Michael Kutzer; Matthew Moses; Allison M Okamura"}, {"title": "Simulating Haptic Feedback Using Vision: A Survey of Research and Applications of Pseudo-Haptic Feedback", "journal": "Presence: Teleoperators and Virtual Environments", "year": "2009", "authors": "Anatole Lécuyer"}, {"title": "TORC: A Virtual Reality Controller for In-Hand High-Dexterity Finger Interaction", "journal": "Association for Computing Machinery", "year": "2019", "authors": "Jaeyeon Lee; Mike Sinclair; Mar Gonzalez-Franco; Eyal Ofek; Christian Holz"}, {"title": "A Wearable Fingertip Haptic Device with 3 DoF Asymmetric 3-RSR Kinematics", "journal": "IEEE", "year": "2015", "authors": "Daniele Leonardis; Massimiliano Solazzi; Ilaria Bortone; Antonio Frisoli"}, {"title": "RML Glove -An Exoskeleton Glove Mechanism with Haptics Feedback", "journal": "IEEE/ASME Transactions on Mechatronics", "year": "2015-02", "authors": "M A Zhou; Pinhas Ben-Tzvi"}, {"title": "Gravity Grabber: Wearable Haptic Display to Present Virtual Mass Sensation", "journal": "Association for Computing Machinery", "year": "2007", "authors": "Kouta Minamizawa; Souichiro Fukamachi; Hiroyuki Kajimoto; Naoki Kawakami; Susumu Tachi"}, {"title": "Simplifed Design of Haptic Display by Extending One-point Kinesthetic Feedback to Multipoint Tactile Feedback", "journal": "IEEE", "year": "2010", "authors": "Kouta Minamizawa; Domenico Prattichizzo; Susumu Tachi"}, {"title": "Characteristics of Human Fingertips in the Shearing Direction", "journal": "Biological Cybernetics", "year": "2000-02", "authors": "Nobuaki Nakazawa; Ryojun Ikeura; Hikaru Inooka"}, {"title": "Two Finger Grasping Simulation with Cutaneous and Kinesthetic Force Feedback", "journal": "", "year": "2012", "authors": "Claudio Pacchierotti; Francesco Chinello; Monica Malvezzi; Leonardo Meli; Domenico Prattichizzo"}, {"title": "", "journal": "", "year": "", "authors": " Springer"}, {"title": "Wearable Haptic Systems for the Fingertip and the Hand: Taxonomy, Review, and Perspectives", "journal": "IEEE Transactions on Haptics", "year": "2017-05", "authors": "Claudio Pacchierotti; Stephen Sinclair; Massimiliano Solazzi; Antonio Frisoli; Vincent Hayward; Domenico Prattichizzo"}, {"title": "Soft Finger Tactile Rendering for Wearable Haptics", "journal": "IEEE", "year": "2015", "authors": "Alvaro G Perez; Daniel Lobo; Francesco Chinello; Gabriel Cirio; Monica Malvezzi; José San Martín; Domenico Prattichizzo; Miguel A Otaduy"}, {"title": "Similar Mechanisms Underlie Curvature Comparison by Static and Dynamic Touch", "journal": "Perception and Psychophysics", "year": "1999-07", "authors": "Sylvia C Pont; Astrid M L Kappers; Jan J Koenderink"}, {"title": "Towards Wearability in Fingertip Haptics: A 3-DoF Wearable Device for Cutaneous Force Feedback", "journal": "IEEE Transactions on Haptics", "year": "2013-10", "authors": "Domenico Prattichizzo; Francesco Chinello; Claudio Pacchierotti; Monica Malvezzi"}, {"title": "Cutaneous Force Feedback as a Sensory Subtraction Technique in Haptics", "journal": "IEEE Transactions on Haptics", "year": "2012-04", "authors": "Domenico Prattichizzo; Claudio Pacchierotti; Giulio Rosati"}, {"title": "Contact Location Display for Haptic Perception of Curvature and Object Motion", "journal": "International Journal of Robotics Research", "year": "2005-09", "authors": "William R Provancher; Mark R Cutkosky; Katherine J Kuchenbecker; Günter Niemeyer"}, {"title": "Fingertip Tactile Devices for Virtual Object Manipulation and Exploration", "journal": "Association for Computing Machinery", "year": "2017", "authors": "B Samuel; Allison M Schorr;  Okamura"}, {"title": "Design of a Novel Finger Haptic Interface for Contact and Orientation Display", "journal": "IEEE", "year": "2010", "authors": "Massimiliano Solazzi; Antonio Frisoli; Massimo Bergamasco"}, {"title": "", "journal": "", "year": "", "authors": "Eric M Young; Katherine J Kuchenbecker"}, {"title": "Comparison of Kinesthetic and Skin Deformation Feedback for Mass Rendering", "journal": "IEEE", "year": "", "authors": "Jacob M Suchoski; Aaron Barron; Connie Wu; Zhan Fan Quek; Sean Keller; Allison M Okamura"}, {"title": "Efects of Longitudinal Skin Stretch on the Perception of Friction", "journal": "", "year": "2007", "authors": "D Nicholas; William R Sylvester;  Provancher"}, {"title": "Cyber Glove Systems. 2020. CyberGrasp. Retrieved", "journal": "", "year": "2020-07-21", "authors": ""}, {"title": "SLIP AESTHEASIS: A Portable 2D Slip/Skin Stretch Display for the Fingertip", "journal": "IEEE", "year": "2005", "authors": "Nikos G Tsagarakis; T Horne; Darwin G Caldwell"}, {"title": "Link-Touch: A Wearable Haptic Device with Five-Bar Linkage Mechanism for Presentation of Two-DOF Force Feedback at the Fingerpad", "journal": "IEEE", "year": "2014", "authors": "Dzmitry Tsetserukou; Shotaro Hosokawa; Kazuhiko Terashima"}, {"title": "A Novel Two-Dimensional Tactile Slip Display: Design, Kinematics and Perceptual Experiments", "journal": "ACM Transactions on Applied Perception", "year": "2005-04", "authors": "Robert J Webster; Todd E Murphy; Lawton N Verner; Allison M Okamura"}, {"title": "Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfgurable Virtual Reality Controller", "journal": "Association for Computing Machinery", "year": "2018", "authors": "Eric Whitmire; Hrvoje Benko; Christian Holz; Eyal Ofek; Mike Sinclair"}, {"title": "Local Surface Orientation Dominates Haptic Curvature Discrimination", "journal": "IEEE Transactions on Haptics", "year": "2009-01", "authors": "W A Maarten; Akihiro Wijntjes; Vincent Sato; Astrid M L Hayward;  Kappers"}, {"title": "Wearable Tactile Device Using Mechanical and Electrical Stimulation for Fingertip Interaction with Virtual World", "journal": "IEEE", "year": "2017", "authors": "Vibol Yem; Hiroyuki Kajimoto"}, {"title": "Design of a Parallel Continuum Manipulator for 6-DOF Fingertip Haptic Display", "journal": "", "year": "2017", "authors": "Eric M Young; Katherine J Kuchenbecker"}, {"title": "", "journal": "IEEE", "year": "", "authors": ""}, {"title": "Implementation of a 6-DOF Parallel Continuum Manipulator for Delivering Fingertip Tactile Cues", "journal": "IEEE Transactions on Haptics", "year": "2019-06", "authors": "Eric M Young; Katherine J Kuchenbecker"}], "figures": [{"figure_label": "3", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 3 :3Figure 3: A labeled diagram of the 6-DOF tactile fngertip feedback device [50] that we adapted for use in this project.", "figure_data": ""}, {"figure_label": "5", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 5 :5Figure5: Using two adjustable straps to secure the fngertip gives us independent control of the fngertip's left/right position and the strap's tightness. Fingers of diferent sizes and curvatures can be positioned such that the fngertip is in a consistent location.", "figure_data": ""}, {"figure_label": "7", "figure_type": "", "figure_id": "fig_3", "figure_caption": "Figure 7 :7Figure7: The six quadric surfaces presented in the hidden surface task and the corresponding coefcients that are substituted into Eq. (1). The shorthand names for each surface are given in parenthesis and represent the curvatures in the front/back and left/right directions. Identical shapes were 3D-printed for the real-world haptic rendering method. All virtual and real surfaces are positioned such that the point at (x, y, z) = (0 mm, 0 mm, 0 mm) is located at the same position.", "figure_data": ""}, {"figure_label": "9", "figure_type": "", "figure_id": "fig_4", "figure_caption": "Figure 9 :9Figure 9: Side-by-side images of the VR and real-world setups during the human-subject study. The hidden surface task is depicted in (a) and (b), and the slider task is shown in (c) and (d). Subfgures (a) and (c) both show training scenarios in VR and physical setups for the 1-DOF, 3-DOF, or 6-DOF tactile rendering methods, whereas (b) and (d) show non-training trials and physical setups for real-world rendering. Note that the real-world haptic rendering of the slider task in (d) has no VR environment.", "figure_data": ""}, {"figure_label": "12", "figure_type": "", "figure_id": "fig_5", "figure_caption": "Figure 12 :12Figure 12: Example trajectories observed during the two tasks. On the left, we show examples of (a) horizontal exploration and (b) poking of surface three with the 3-DOF method. On the we show examples of (c) more vigorous shaking and (d) precise, gentle pushing of the light slider with the 6-DOF method. Each depicted trajectory comes from a distinct user.", "figure_data": ""}, {"figure_label": "13", "figure_type": "", "figure_id": "fig_6", "figure_caption": "Figure 13 :13Figure 13: Horizontal and vertical speeds and accelerations during the two tasks, organized by rendering method.", "figure_data": ""}, {"figure_label": "14", "figure_type": "", "figure_id": "fig_7", "figure_caption": "Figure 14 :14Figure 14: Vertical speeds for each participant during the hidden surface task (left) and horizontal accelerations for each participant during the slider task (right) across all trials.", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "†  48.9 ± 0.4 63.8% ± 5.0 † 30.8 ± 0.3 Real 98.8% ± 1.3 † 25.0 ± 0.2 66.3% ± 5.6 † 22.2 ± 0.2 Overall success rates and completion times (mean ± S.E.) for each combination of rendering method and task. A total of 80 trials was completed for each combination. A † indicates performance signifcantly better than chance (p < 0.05), as computed via a one-tailed one-sample t-test with Bonferroni correction.Figure11: Confusion matrices of the responses given in the slider task for each rendering method. Each confusion matrix represents 80 trials, but because trial types were randomized, the number of trials within each row are not equal.", "figure_data": "RenderingSurfaceSliderMethodAccuracyTime (s)AccuracyTime (s)1-DOF52.5% ± 5.4  † 51.8 ± 0.551.3% ± 6.126.0 ± 0.23-DOF63.8% ± 7.6  † 48.3 ± 0.447.5% ± 5.428.8 ± 0.26-DOF60.0% ± 5.3"}], "doi": "10.1145/3411764.3445369"}