{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.43000030517578,
      "x2": 295.7314147949219,
      "y1": 368.1410827636719,
      "y2": 580.79296875
    },
    "text": "ABSTRACT The availability of digital devices operated by voice is expanding rapidly. However, the applications of voice interfaces are still restricted. For example, speaking in public places becomes an annoyance to the surrounding people, and secret information should not be uttered. Environmental noise may reduce the accuracy of speech recognition. To address these limitations, a system to detect a user’s unvoiced utterance is proposed. From internal information observed by an ultrasonic imaging sensor attached to the underside of the jaw, our proposed system recognizes the utterance contents without the user’s uttering voice. Our proposed deep neural network model is used to obtain acoustic features from a sequence of ultrasound images. We confirmed that audio signals generated by our system can control the existing smart speakers. We also observed that a user can adjust their oral movement to learn and improve the accuracy of their voice recognition."
  },
  "figures": [{
    "caption": "Figure 8: Apparatus used for training and evaluating.",
    "captionBoundary": {
      "x1": 66.45500183105469,
      "x2": 281.3885803222656,
      "y1": 212.43814086914062,
      "y2": 218.0780029296875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "8",
    "page": 5,
    "regionBoundary": {
      "x1": 60.0,
      "x2": 288.0,
      "y1": 92.0,
      "y2": 199.0
    }
  }, {
    "caption": "Table 1: Speech-recognition success ratio in tests with an unchanged existing smart speaker (“GT” means Mel-scale encoded/decoded from the original voice data, regarded as the ground truth of the training).",
    "captionBoundary": {
      "x1": 317.6260070800781,
      "x2": 558.2030639648438,
      "y1": 653.820556640625,
      "y2": 695.9520263671875
    },
    "figType": "Table",
    "imageText": ["User", "A", "User", "B", "ave.", "Network", "1", "60.0%", "25.0%", "42.5%", "Network", "1", "+", "Network", "2", "65.0%", "65.0%", "65.0%", "GT", "90.0%", "90.0%", "90.0%"],
    "name": "1",
    "page": 6,
    "regionBoundary": {
      "x1": 331.0,
      "x2": 545.0,
      "y1": 602.0,
      "y2": 651.0
    }
  }, {
    "caption": "Figure 9: Results of the training (shown as waves andMel-scale spectrogram): Net1: Network 1 results; Net2: Network 2 results; original: original voice encoded by Mel-scale spectrogram and decoded to an audio signal. This is the “ground-truth” of this training.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.8934326171875,
      "y1": 308.4051513671875,
      "y2": 335.9620361328125
    },
    "figType": "Figure",
    "imageText": ["(sec)", "(sec)(sec)", "(Hz)", "4000", "-", "5000", "-", "6000", "-", "3000", "-", "2000", "-", "1000", "-", "(Hz)", "4000", "-", "5000", "-", "6000", "-", "3000", "-", "2000", "-", "1000", "-", "(Hz)", "4000", "-", "5000", "-", "6000", "-", "3000", "-", "2000", "-", "1000", "-"],
    "name": "9",
    "page": 6,
    "regionBoundary": {
      "x1": 85.0,
      "x2": 524.3704833984375,
      "y1": 99.0,
      "y2": 292.0
    }
  }, {
    "caption": "Figure 10: Comparison of Generated Sounds. Left: Network 2 results from ultrasonic images while a user is emitting a voice; Middle: Network 2 results from ultrasonic images without emitting a voice; Right: the original (Mel-scale spectrogram encoded/decoded) voice",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 559.8080444335938,
      "y1": 561.984130859375,
      "y2": 589.5419921875
    },
    "figType": "Figure",
    "imageText": ["(sec)", "(sec)", "(sec)", "(Hz)", "4000", "-", "5000", "-", "6000", "-", "3000", "-", "2000", "-", "1000", "-", "(Hz)", "4000", "-", "5000", "-", "6000", "-", "3000", "-", "2000", "-", "1000", "-", "(Hz)", "4000", "-", "5000", "-", "6000", "-", "3000", "-", "2000", "-", "1000", "-"],
    "name": "10",
    "page": 6,
    "regionBoundary": {
      "x1": 85.0,
      "x2": 525.2014770507812,
      "y1": 352.0,
      "y2": 546.0
    }
  }, {
    "caption": "Figure 11: Future Image: possible configuration of an ultrasonic probe and an open earphone",
    "captionBoundary": {
      "x1": 317.9549865722656,
      "x2": 559.8057861328125,
      "y1": 259.2961120605469,
      "y2": 275.89495849609375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "11",
    "page": 7,
    "regionBoundary": {
      "x1": 337.0,
      "x2": 539.0,
      "y1": 92.0,
      "y2": 246.0
    }
  }, {
    "caption": "Figure 4: Obtained ultrasonic image from probes attached to the jaw from underneath.",
    "captionBoundary": {
      "x1": 317.9549865722656,
      "x2": 558.2008056640625,
      "y1": 474.0451354980469,
      "y2": 490.64398193359375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "4",
    "page": 3,
    "regionBoundary": {
      "x1": 362.0,
      "x2": 514.0,
      "y1": 308.0,
      "y2": 461.0
    }
  }, {
    "caption": "Figure 2: SottoVoce system overview",
    "captionBoundary": {
      "x1": 232.80299377441406,
      "x2": 379.1974792480469,
      "y1": 284.8641357421875,
      "y2": 290.5039978027344
    },
    "figType": "Figure",
    "imageText": ["time", "6464", "184", "(3.68sec)", "184", "64", "128", "128", "time", "time", "time", "Audio", "Feature", "Vectors", "(Mel-scale", "spectrum)", "Audio", "Feature", "Vector", "(Mel-scale", "spectrum)", "Training", "data", "set", "(ultrasonic", "image", "movie", "with", "audio)", "Image", "sequence", "Neural", "Network", "2", "Input:", "Audio", "Feature", "Vectors", "Output:", "Audio", "Feature", "Vectors", "etc.)", "Neural", "Network", "1", "Input:", "Image", "sequence", "Output:", "Audio", "Feature", "Vector", "devices", "(Smart", "Speakers", "Voice", "controllable", "Wave", "signal", "Ultrasonic", "imaging", "probe"],
    "name": "2",
    "page": 3,
    "regionBoundary": {
      "x1": 82.65101623535156,
      "x2": 533.0,
      "y1": 96.0,
      "y2": 266.31573486328125
    }
  }, {
    "caption": "Figure 3: Ultrasonic imaging probes",
    "captionBoundary": {
      "x1": 101.656982421875,
      "x2": 246.18638610839844,
      "y1": 396.7381286621094,
      "y2": 402.37799072265625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "3",
    "page": 3,
    "regionBoundary": {
      "x1": 61.0,
      "x2": 287.0,
      "y1": 308.0,
      "y2": 383.0
    }
  }, {
    "caption": "Figure 12: Human–AI integration: artificial neural networks and organic neural networks form a feedback loop for obtaining better results.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 295.6486511230469,
      "y1": 300.0031433105469,
      "y2": 327.56097412109375
    },
    "figType": "Figure",
    "imageText": ["(Organic)", "Neural", "Networks", "(Organic)", "Neural", "Networks", "(b)", "(a)", "(Artificial)", "Neural", "Networks", "Ultrasonic", "imaging", "sound", "Oral", "cavity", "Tongue", "Motor", "cortex", "Auditory", "cortex", "sound", "Vocal", "folds", "Larynx", "tension", "Motor", "cortex", "Auditory", "cortex"],
    "name": "12",
    "page": 8,
    "regionBoundary": {
      "x1": 77.09856414794922,
      "x2": 270.7206726074219,
      "y1": 93.0,
      "y2": 286.0
    }
  }, {
    "caption": "Figure 5: A series of ultrasonic images of the throat of a subject about to pronounce “Alexa.”",
    "captionBoundary": {
      "x1": 120.11799621582031,
      "x2": 491.8830261230469,
      "y1": 195.75814819335938,
      "y2": 201.39801025390625
    },
    "figType": "Figure",
    "imageText": ["0", "100", "200", "250", "time(ms)"],
    "name": "5",
    "page": 4,
    "regionBoundary": {
      "x1": 73.07891082763672,
      "x2": 541.0,
      "y1": 92.0,
      "y2": 172.78546142578125
    }
  }, {
    "caption": "Figure 6: Representation of training data. K-sized ultrasonic images are pairedwith the corresponding sounds (Melscaled sound vectors).",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 295.6487121582031,
      "y1": 356.59814453125,
      "y2": 384.156005859375
    },
    "figType": "Figure",
    "imageText": ["1", "64", "1/30", "sec", "time20ms", "Audio", "feature", "vectors", "Ultrasonic", "images"],
    "name": "6",
    "page": 4,
    "regionBoundary": {
      "x1": 76.0,
      "x2": 273.0,
      "y1": 223.47543334960938,
      "y2": 338.4403076171875
    }
  }, {
    "caption": "Figure 7: Network 2 improves the quality of generated Melscaled spectrum sequences. (Note: for the consistency with the illustration of the neural networks, the time axis of the audio-feature vector is shown as the vertical axis.)",
    "captionBoundary": {
      "x1": 317.9549865722656,
      "x2": 559.8057861328125,
      "y1": 339.7591247558594,
      "y2": 378.27593994140625
    },
    "figType": "Figure",
    "imageText": ["time", "time", "U-Net", "Architecture", "copy", "copy", "Audio-feature", "Vectors", "(Mel-Spectrum", "Sequence)", "Audio-feature", "vectors", "(Mel-Spectrum", "sequence)", "1D-Deconvolution", "Networks", "1D-Convolution", "Networks", "64", "184", "64", "184", "184", "128128", "256", "512", "23", "512", "46", "96", "184", "(M", "=", "1-8)", "1D-Convolution", "Bank"],
    "name": "7",
    "page": 4,
    "regionBoundary": {
      "x1": 321.81964111328125,
      "x2": 555.0284423828125,
      "y1": 222.86033630371094,
      "y2": 323.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.24800109863281,
        "x2": 294.1955871582031,
        "y1": 595.20654296875,
        "y2": 712.0009765625
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACMmust be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. CHI 2019, May 4–9, 2019, Glasgow, Scotland Uk © 2019 Association for Computing Machinery. ACM ISBN 978-1-4503-5970-2/19/05. . . $15.00 https://doi.org/10.1145/3290605.3300376"
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 578.9888916015625,
        "y1": 368.1411437988281,
        "y2": 425.3759765625
      },
      "text": "CCS CONCEPTS •Computingmethodologies→Neural networks; •Humancentered computing→ Interface design prototyping; Mobile devices; Sound-based input / output; • Social and professional topics→ People with disabilities;"
    }]
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.2991333007812,
        "y1": 456.69647216796875,
        "y2": 475.1669921875
      },
      "text": "silent speech, ultrasonic imaging, deep neural networks, human-AI integration"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.95501708984375,
        "x2": 375.548828125,
        "y1": 441.84210205078125,
        "y2": 448.2679748535156
      },
      "text": "KEYWORDS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.6409912109375,
        "x2": 559.2569580078125,
        "y1": 499.5439758300781,
        "y2": 560.2020263671875
      },
      "text": "Naoki Kimura, Michinari Kono, and Jun Rekimoto. 2019. SottoVoce: An Ultrasound Imaging-Based Silent Speech Interaction Using Deep Neural Networks. InCHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), May 4–9, 2019, Glasgow, Scotland Uk. ACM, New York, NY, USA, 11 pages. https://doi.org/10.1145/ 3290605.3300376"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.62298583984375,
        "x2": 415.4913330078125,
        "y1": 488.80914306640625,
        "y2": 494.4490051269531
      },
      "text": "ACM Reference Format:"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.888671875,
        "y1": 597.2314453125,
        "y2": 711.343017578125
      },
      "text": "Smart devices that are controllable by speech (i.e., speech interaction) are being used in many situations. Smartphones, smart speakers, car-navigation systems, and various home appliances can be controlled by speech and have presented many interactive potentials [47]. Speech interaction does not require visual attention, and it can be used in a dark environment such as a bedroom. Owing to the recent progress of speech-recognition technology and the naturalness of speech synthesis, speech interaction is becoming an irreplaceable process in human–computer interaction. Speech can also"
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.72796630859375,
        "y1": 96.09944915771484,
        "y2": 162.3909912109375
      },
      "text": "be used while the user of a speech-interaction device is performing other tasks, such as driving, cooking, homeworking, or using a traditional personal computer. For example, while the user is concentrating on a computer-screen and interaction devices such as a keyboard and a mouse, they can still operate other devices with voice interaction."
    }, {
      "page": 1,
      "region": {
        "x1": 53.43000030517578,
        "x2": 298.614013671875,
        "y1": 167.83047485351562,
        "y2": 712.3289794921875
      },
      "text": "However, as for the speech interface, two challenges must be overcome. First, using the interface in public places presents limitations. In addition to being an annoyance to the surrounding people, disclosing personal information or secret information by uttering it in public is risky in terms of information security. Next, it cannot be used in a noisy environment, because the accuracy of speech recognition may be declined. These issues are particularly acute when trying to use a speech interface to interact with wearables or mobile computers. To overcome these challenges, research on “silent-speech recognition” has been conducted [8]. For example, by applying a method known as lip reading, images of the mouth of the speaker or the entire face are captured by a camera, and the content of the utterance is estimated from those images [52]. If the user could simply mouth the utterance without actually voicing it, it would be possible to use such a voice interaction in public places. However, with the camera method, it is necessary to install a camera in front of the face, and its form factor renders it unsuitable for wearables or mobile applications. Other approaches of the studies on “non-audible murmur” (NAM) [22, 42] attempts to recognize utterances with a microphone or an accelerometer worn on the skin or throat of the user. In this case, the user speaks with articulated respiratory sound without vocal-fold vibration (namely, whispering). However, to be recognized accurately by the system, a user’s whispering voice tends to be noticeable by other people nearby. Furthermore, some studies attempt to estimate speech by estimating the movement of muscles near the oral cavity by electromyography (EMG) [33, 49]. However, the estimation of free utterances with EMG is still difficult; instead, it is a type of gesture recognition using the movement of the oral cavity. Thus, the number of detectable commands is limited, and the user has to learn new gesture skills instead of using their existing speaking skills. Instead of using the above-described approaches, we focus on using ultrasonic imaging [11]. Ultrasonic-imaging technology recognizes the internal status in the body by measuring the reflection time of ultrasonic waves radiated into the body. This technology is widely used to grasp the condition of the internal organs for medical purposes. In recent years, small and lightweight systems that can be directly connected to smartphones (e.g., Vscan Extend, General Electronic Company) have appeared. If it were possible to attach a small ultrasonic imaging head around the neck to sense"
    }, {
      "page": 1,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8884887695312,
        "y1": 96.09944915771484,
        "y2": 246.0770263671875
      },
      "text": "the situation in the oral cavity and convert it to acoustic information, it would be a useful device for communicating with speech-capable devices without actually speaking aloud; namely, “silent voice interaction” would be possible. Silent voice interaction by ultrasonic imaging demonstrates two potential advantages over other approaches. First, the ultrasonic-imaging head can be miniaturized, and it can constitute a device with an inconspicuous shape such as a collar. It would be an important feature for designing wearable silent-voice systems. Next, by recognizing the situation in the oral cavity, it would be possible to measure themovement of the tongue, which cannot be observed from the outside. It would thus be possible to reproduce sound more accurately."
    }, {
      "page": 1,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8869018554688,
        "y1": 251.51644897460938,
        "y2": 413.45001220703125
      },
      "text": "Studies have been conducted on silent speech using ultrasound imaging, but many of them are used in combinations with lip or face images; therefore, a camera must be placed in front of the user [26]. This configuration presents a limitation when it is used as a wearable interface device. Recent researchers have challenged to use deep neural networks with ultrasound imaging for silent speech [7, 51]; however, they are not based on convolutional neural networks and are not validated with data retrieved from a mouth movement without speaking. They are only validated with mouth movement when a user is actually emitting a voice. We present a significant step forward using convolutional neural networks and proof-of-concept validations via actual silent speech, interacting with an unchanged smart speaker (Amazon Alexa)."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 560.4028930664062,
        "y1": 418.88946533203125,
        "y2": 485.1809997558594
      },
      "text": "Herein, a silent-voice interaction system-called “SottoVoce” based only on ultrasonic images is described (Figure 1). By combining two types of deep neural networks, this system can be trained to generate voice signals from a sequence of images captured from an ultrasonic-imaging device. Our contributions can be summarized as the following two topics:"
    }, {
      "page": 1,
      "region": {
        "x1": 333.427001953125,
        "x2": 559.8888549804688,
        "y1": 494.7454528808594,
        "y2": 573.7890014648438
      },
      "text": "• A two-level model of deep convolutional neural networks to convert ultrasonic images to actual sounds is proposed. • As a proof of concept, a silent-voice system was developed, and it was shown that the system could control a voice-controlled device (in this case, Amazon Echo) without modifications."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 411.0555114746094,
        "y1": 582.3770751953125,
        "y2": 588.802978515625
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8900146484375,
        "y1": 620.7794189453125,
        "y2": 710.9810180664062
      },
      "text": "Silent-speech interfaces have been studied using various technologies and methods [8, 31]. Lip reading [52] or facial images [12] can be used to estimate speech uttered by a subject without using audio information. SilentVoice [17] is an ingressive speech approach that captures extremely soft speech. Electromagnetic articulography (EMA) has been used to develop brain–computer interfaces [5] and other interactive applications [53]. Magnets"
    }, {
      "page": 2,
      "region": {
        "x1": 53.569000244140625,
        "x2": 295.73077392578125,
        "y1": 96.09944915771484,
        "y2": 329.76300048828125
      },
      "text": "can be attached to the subject to detect silent speech [14, 19, 23]. Electroencephalogram (EEG) [44] and Electromyography (EMG) [37, 49] are also typical methods for silentspeech recognition. Particularly, EMG has been applied for interactive purposes and applications concerning human– computer interaction (HCI) [38]; for example, controlling a web browser [32]. A recent example proposed by Kapur et al. [33] used multiple electrodes to sense neuromuscular signals of a subject in an internal speech. In addition to the methods introduced above, other human–facial electrical potentials have been combined and measured [22, 48]. Ultrasound imaging has also been used for silent-speech recognition in the field of speech processing [9, 27]. In one study, which focused on singing, sung vowels could be synthesized based on the ultrasound and video of the lips [30]. In a similar study, a silent-speech interface using ultrasound and optical images of the tongue and lips was developed [26, 28]. In another study, a mapping technique for automatically generating animations of the tongue movement from raw ultrasound images was created [13]."
    }, {
      "page": 2,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7313232421875,
        "y1": 335.2034606933594,
        "y2": 616.68701171875
      },
      "text": "Other approaches combine the techniques described above with deep neural networks, such as BCI applications [4], myoelectric signals [10], and lip reading with long shorttermmemory (LSTM) [52]. Combining deep neural networks and ultrasound imaging for silent-speech interfaces has also been considered. For example, ultrasound imaging was used to capture the tongue movement with such a combination with deep neural networks [7]. Moreover, the fundamental frequency (F0) curve, which had been considered unpredictable, was estimated using a deep neural network [21]. In addition, it has been suggested that a global and visuo– acoustic modeling approach called “Eigentongues” performs better than tongue-contour modeling when using neural networks [25]. A new benchmark for silent-speech research based on deep neural networks has also been proposed [31]. These approaches are still at the basic proof-of-concept level, and none have been evaluated in terms of controlling the existing speech-interaction appliances such as smart speakers. Following the prior approaches described above, we aim to develop a system that allows silent speech to interact with voice-controlled devices and interactive purposes in a HCI context. Furthermore, to improve the performance of the developed system, we aim for the interaction between human and artificial neural networks for performance improvement."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.01019287109375,
        "y1": 639.153076171875,
        "y2": 708.343994140625
      },
      "text": "Non-Auditory Inputs and Interaction EarFieldSensing [39] is a gesture-recognition technology based on electric-field sensing. CanalSense [3] senses changes in air pressure in the ear canals that occur when the face is moved. Tongue-in-Cheek [18] senses the movement of the tongue using the X-band Doppler radar for facial–gesture"
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8884887695312,
        "y1": 96.09944915771484,
        "y2": 234.12200927734375
      },
      "text": "recognition. Other methods that use EMG [55] or combinations of brain and muscle signal sensing [43] are also notable. The techniques above have been utilized for arm-gesture recognition; however, an approach using ultrasound imaging for that purpose has been demonstrated, i.e., EchoFlex [40]. It is an interaction sensor that recognizes movements of the forearm muscle using ultrasound imaging. The results of that study indicated that the sensor performed well and can potentially be supplanted to other prior approaches. They also inspired the authors to consider using ultrasound imaging for silent-voice interaction using the inner part of the mouth."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 411.9521484375,
        "y1": 590.9810791015625,
        "y2": 612.3510131835938
      },
      "text": "2 RELATEDWORK Silent Speech"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8858032226562,
        "y1": 268.2544860839844,
        "y2": 573.6489868164062
      },
      "text": "Owing to the development of mobile and smart devices, we can now interact with them frequently through variousmethods [35]. We may use our voice as an input method [47], and studies to overcome issues concerning such voice-controlled user interfaces have been presented [41]. One typical interface (a personal “agent” hereafter) is Amazon Echo, typically known as “Alexa,” with which people can communicate and chat. The effect of this agent on people has been researched extensively, and the results show that it is an effective agent for satisfying or influencing our lives [36, 45, 50]. The role of artificial intelligence (AI) has become more important for tasks other than personal agents like Alexa, and we now interact and collaborate with AIs; for example, when sending text messages [24] and designing objects [16]. The hybrid existence and interaction of humans and AI is an impressive topic, which can overcome social issues and improve the quality of our lives. Glove Talk II [15], which was presented in 1995, is a gesture-to-speech system that translates hand gestures into 10 control parameters of a speech synthesizer using neural networks. However, to use the system, the user requires a long-term training of approximately 100 hours. In the present study, referring to this work, we apply the recently improved technologies of deep-neural networks to create the hybrid interaction of humans and AI, where the user (a human) learns to adapt and utilize the AI system to achieve a better interaction."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 458.51739501953125,
        "y1": 253.40011596679688,
        "y2": 259.82598876953125
      },
      "text": "Interacting with Smart Devices"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.888916015625,
        "y1": 607.7804565429688,
        "y2": 709.93798828125
      },
      "text": "The architecture of the proposed system for generating sound from ultrasonic images is shown in Figure 2. In general, the goal of the system is to transfer certain sequence representations (in this case, ultrasonic images) into other sequence representations (in this case, speech). This goal is similar to that of text-to-speech systems [54], voice-transfer systems [2], and lip reading or face-to-voice systems [12]. Inspired by these systems, the proposed system uses two neural networks."
    }, {
      "page": 3,
      "region": {
        "x1": 53.42998504638672,
        "x2": 295.7314453125,
        "y1": 417.2064514160156,
        "y2": 626.9600219726562
      },
      "text": "The first neural network (‘Network 1’ in Figure 2) transfers a time series of ultrasonic images to a sound-representation vector. We used a 64-dimensional Mel-scale spectrum with the frequency range of 300 Hz to 8, 000 Hz, sampled every 20ms , as a sound-representation vector. Subsequently, the translated sound representations constitute a series of soundrepresentation vectors (i.e., a spectrogram). This sound spectrogram can be converted to an audio signal. In addition, to refine the quality of those vectors, they are also transferred by the next neural network (“Network 2” in Figure 2), which generates a series of sound-representation vectors of the same length as that of the input sound-representation vectors. Finally, the output vectors are converted to an actual audio signal. These two networks are speaker dependent; accordingly, to train them, the system requires a set of ultrasonic-imaging videos captured while the user speaks various speech commands."
    }, {
      "page": 3,
      "region": {
        "x1": 53.498985290527344,
        "x2": 295.73138427734375,
        "y1": 642.5770874023438,
        "y2": 711.7680053710938
      },
      "text": "Ultrasonic Imaging Device The CONTEC CMS600P2 Full Digital B-Ultrasound Diagnostic System was used as the ultrasonic-imaging device. A user attaches a 3.5-MHz convex-type ultrasonic imaging probe under the jaw (Figure 3). This system provides a screen output port to be connected to the display monitor. In addition,"
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8886108398438,
        "y1": 502.1414794921875,
        "y2": 592.343017578125
      },
      "text": "a display-digitizing unit was used for converting the signal sent to the display to an MPEG-4 movie file. Figure 4 shows the obtained ultrasonic image. We found a delay of ultrasonic images and sound capturing. To compensate for this delay, we examined the corresponding utterance and tongue movement in the video and estimated a delay of 300ms . We subsequently adjusted to this delay in the training data."
    }, {
      "page": 3,
      "region": {
        "x1": 317.72601318359375,
        "x2": 559.8856811523438,
        "y1": 607.1281127929688,
        "y2": 712.1840209960938
      },
      "text": "Network 1 Network 1 uses a series of K ultrasonic images (size of 128 × 128, monochrome) as the input and generates an ndimensional sound representation (Mel-scale spectrum) as the output. Currently, K of 13 and n of 64 are used. Because the frame rate of the ultrasonic images is 30 frames per second, the duration of K ultrasonic images is thus 400 ms. This time duration covers the static and motion features of the utterance. Samples of the ultrasonic images are shown in"
    }, {
      "page": 4,
      "region": {
        "x1": 52.801998138427734,
        "x2": 298.1924743652344,
        "y1": 406.63446044921875,
        "y2": 592.4769897460938
      },
      "text": "Figure 5. The K-size image sequence is prepared repeatedly such that one Mel-scale spectrum is created every 20 ms (i.e., the hop size is 20 ms) (Figure 6). A sound-representation vector corresponding to the time position at the center of each ultrasonic-image sequence is extracted from the audio signal data, and Network 1 is trained to generate it. Network 1 is based on a convolutional neural network (CNN). It comprises four layers:Conv2D - LeakyReLU - Dropout - BatchNormalization, followed by six layers: Flatten - Dense - LeakyReLU - Dropout - Dense - LeakyReLU. The output size of Network 1 is the same as the length of the soundrepresentation vector (i.e., 64). Both input images and output vectors are normalized to 0 to one, respectively. The loss function is the mean-squared error, and the optimizer is Adam [34]."
    }, {
      "page": 4,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.0418701171875,
        "y1": 607.173095703125,
        "y2": 712.22900390625
      },
      "text": "Network 2 To improve the sound quality, Network 2 uses a sequence of sound-representation vectors and generates a sequence of sound-representation vectors with the same length as the input. This model comprises a bank of one-dimensional (1-D) convolutional filters (Conv1D), with a kernel size from 1 to M (M = 8 is currently used), followed by the U-Network [46] with the three layers of Conv1D - MaxPooling (strides=2) - LeakyReLU - Dropout, and thrice of DeConv1D - Concatenate"
    }, {
      "page": 4,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8826293945312,
        "y1": 405.03045654296875,
        "y2": 543.052978515625
      },
      "text": "(Figure 7). The 1-D convolutional bank explicitly models the local and contextual information of the input sequence. The following U-Network also improves the quality of the audio sequencewith precise localization. Finally, the network generates Mel-scale spectrum vectors. To train Network 2, Network 1 was used to create Melscale spectrum vectors from the images of a training ultrasonic video clip as the input, and the same length Mel-scale spectrum vectors from the audio of the same training video clip as the output. Similarly, in the case of Network 1, the mean-squared error was used as a loss function, and Adam was used as an optimizer."
    }, {
      "page": 4,
      "region": {
        "x1": 317.5870056152344,
        "x2": 558.2041015625,
        "y1": 548.492431640625,
        "y2": 578.9190063476562
      },
      "text": "For simplicity, the time durations of the input and output were fixed to the same value (currently, 3.68 s is used). This duration encompasses many typical speech commands."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 530.7861328125,
        "y1": 592.9260864257812,
        "y2": 599.3519897460938
      },
      "text": "3 SYSTEM ARCHITECTURE OF SOTTOVOCE"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 563.0929565429688,
        "y1": 609.5374145507812,
        "y2": 711.6939697265625
      },
      "text": "Following the neural-networks processing, a sequence of Mel-scale-spectrum sound-representation vectors is converted to an audio signal using the Griffin Lim algorithm [20]. This conversion is possible from the output of Network 1 or the output of Network 2. For testing, the generated audio signals are transmitted from an audio speaker, and they can be used to control nearby sound-controlled devices such as a smart speaker. We are also considering taking the audio-waveform signal directly"
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0445251464844,
        "y1": 246.99343872070312,
        "y2": 265.46502685546875
      },
      "text": "as the audio input information of the speech-controllable device without actually reproducing it as a sound wave."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 398.5126037597656,
        "y1": 594.68310546875,
        "y2": 601.1090087890625
      },
      "text": "Sound generation"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7279357910156,
        "y1": 296.62347412109375,
        "y2": 506.3769836425781
      },
      "text": "As for preparing the training data, two collaborators, (28-year old male and 24-year old male) were attached with an ultrasonic imaging probe under their jaws, and were instructed to utter various speech commands. Approximately 500 speech commands were collected from each collaborator (Table ??). For each command, as well as the voice utterance, a video of the ultrasonic images was recorded. The training session was approved by the research ethics committee of the author’s institution. The recorded video was used to train Network 1. The ultrasonic images were rescaled to 128 × 128 and used as inputs. The corresponding utterance voice was converted to a Mel-scale spectrum and used as outputs. The number of test sets for Network 2 was the same as the number of trained video files (approximately 500). To increase the number of test sets, data augmentation by applying Gaussian noise to the input Mel-scale spectrum vectors was used."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04473876953125,
        "y1": 511.8164978027344,
        "y2": 554.197998046875
      },
      "text": "As our model is speaker dependent, both Network 1 and Network 2 are trained for each speaker. Network 1 is trained first and subsequently used to create the dataset for training Network 2."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 92.6919937133789,
        "y1": 281.7691650390625,
        "y2": 288.1950378417969
      },
      "text": "Training"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.72979736328125,
        "y1": 585.357421875,
        "y2": 711.4240112304688
      },
      "text": "The above-described network models were implemented based on the Keras [6] deep-learning platform with Tensorflow [1] as the backend, and an NVIDIAGeForce 1080ti as the GPU board. Training Network 1 with 500 speech commands (which creates 35,000 training data pairs for Network 1) required approximately 4 h. Training Network 2 required less than an hour. As the ultrasonic-imaging device cannot be connected directly to the Ubuntu machine that runs the neural networks, a simple server–client program was developed. It connects the computer that controls the ultrasonic imaging device to"
    }, {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8885498046875,
        "y1": 96.09944915771484,
        "y2": 186.301025390625
      },
      "text": "the computer that operates the neural networks. The generated audio signals are sent back to the computer with the ultrasonic-imaging device. To process ultrasonic images at/with duration/intervals of 3.68 s , 2.36 s is required for the neural networks to process the images. The total processing time (including video processing, neural networks processing, and conversion of the Mel-scale spectrum to an audio wave) was 2.61 s ."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 160.84616088867188,
        "y1": 570.5031127929688,
        "y2": 576.9290161132812
      },
      "text": "Implementation Details"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8853149414062,
        "y1": 215.65145874023438,
        "y2": 437.3599853515625
      },
      "text": "The results of converting the ultrasonic images to sound are shown in Figure 9. In the figure, the top-row graphs show the sound-representation vectors (a Mel-scale spectrogram), and the bottom-row graphs are the corresponding waveforms. The graph labeled Net1 is the result of Network 1, that labeled Net2 is the result of Network 1 + Network 2, and that labeled “original” is the wave data encoded as a Mel-scale spectrogram and decoded back to the waveform. Thus, the last one is regarded as the ground-truth of the training. Although the difference between the outputs of Network 1 and Network 2 was unclear, we observed that the sound generated by Network 2 was better than that generated by Network 1 (Examples of the output audio signals are given in the supplemental video.) It is noteworthy that both Network 1 and Network 2 generate natural intonation, which is typically considered to be caused by vocal-fold vibration, not by the internal situation. This result might suggest that the neural networks learn the context of the speech."
    }, {
      "page": 5,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.9144897460938,
        "y1": 442.7994689941406,
        "y2": 640.5980224609375
      },
      "text": "The generated sounds emitted from the computer’s speaker were subsequently tested with an existing (unchanged) smart speaker (Amazon Echo and Amazon Echo Show), and this test confirmed that the generated sounds can control smart speakers. The speech commands used for training and testing were typical Amazon Alexa commands. For this test, the participants spoke the following four commands, five times each (20 utterances in total): “Alexa, play music,” “Alexa, what’s the weather like,” “Alexa, what time is it,” and “Alexa, play jazz.” Table 1 lists the recognition success ratio of Network 1, Network 1 + Network 2, and the original (Mel-scale encoded and decoded) as a ground truth.We confirmed that the combination of Network 1 and Network 2 improves the recognition rate.We also noticed that the trigger word (“Alexa”) is always regenerated clearly. This may because that word is simply the most pronounced word in the training set."
    }, {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.2972412109375,
        "y1": 646.0374145507812,
        "y2": 712.3289794921875
      },
      "text": "We also performed the word error rate (WER) measure test using Google’s cloud speech-to-text engine [29] and the same environment used for the recognition measurement of smart speakers. The WER was 20.61%, 41.03%, and 33.56% for GT, Network 1, and Network 2, respectively (mean of a total of 40 speech commands from two users from Table 1). We believe"
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04730224609375,
        "y1": 605.5514526367188,
        "y2": 683.7979736328125
      },
      "text": "that this will also serve as evidence for the effectiveness of Network 2. Through these studies, we found that commands such as “what’s the weather like?” had a high recognition rate for all conditions, while commands with shorter terms such as “play jazz” performed much worse. This may suggest that the longer commands are easier for Network 2 to obtain the contexts."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549560546875,
        "x2": 375.61846923828125,
        "y1": 200.79714965820312,
        "y2": 207.2230224609375
      },
      "text": "4 RESULTS"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73138427734375,
        "y1": 122.9984359741211,
        "y2": 344.7070007324219
      },
      "text": "The real end-to-end silent voice to audio conversion was examined. In this case, a user is asked to mouth a speech command without actually emitting a sound, and the oral cavity movement is record by an ultrasonic imaging probe. The obtained image sequence is subsequently translated to a voice by the proposed system. We asked the participants to speak as silently as possible (not to vibrate their vocal cords) and to try to speak as similar as possible when they speak with sound. However, we did not ask them to hold their breaths. Consequently, a case occurred where a small leaked sound was audible. To clarify this situation, we measured the level of the emitted sound level from the participant by following the evaluation method of SilentVoice [17]. We used a noise meter that has the same specifications (min range 30 dB, 1.5 dB error) placed 30 cm away, in a room with a background noise level of 31.0 dB(A). The mean of the peak sound level of 20 measurements (typical Alexa speech commands) was 37.14dB(A), which is lower than that of soft whispering."
    }, {
      "page": 7,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7301330566406,
        "y1": 350.1474609375,
        "y2": 559.9000244140625
      },
      "text": "Figure 10 shows the comparison of the generated sound when a user is emitting a voice and when a user is not emitting a voice (please refer to the supplemental video for the actual generated sounds). Initially, the result was unsatisfactory. We first expected that the movement in the oral cavity without emitting a voice (Figure 10 (middle)) is the same as that when the user actually emits a voice (Figure 10 (left)); however, a subtle difference was found between them, and the sound quality generated by the image-without-voice was not as good as that generated by the image-with-voice. However, the following interesting phenomenon was observed. As the user can also listen to the generated sound generated by the image-without-voice, the user attempted to change the mouth movement to obtain a slightly better result. After several trials, the quality of generated sound improved. In this case, it is considered that the users improved their own skills in silent voicing."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 220.02394104003906,
        "y1": 96.18911743164062,
        "y2": 114.57000732421875
      },
      "text": "5 END-TO-END EVALUATION AND OBSERVATIONS"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73138427734375,
        "y1": 601.2951049804688,
        "y2": 706.3510131835938
      },
      "text": "Incremental Voice Generation In our current design, the obtained ultrasonic-image sequences were converted to a voice at the granularity of the speech command (approximately 3.6 s). This is because Network 2 uses a fixed-length voice-representation sequence. However, based on the observation of the users’ practice, it should be better to generate sounds incrementally, such that the user can have a tighter feedback loop for learning oral movements for generating a better voice."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 134.24598693847656,
        "y1": 586.35107421875,
        "y2": 592.7769775390625
      },
      "text": "6 DISCUSSIONS"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.884521484375,
        "y1": 306.5734558105469,
        "y2": 384.82000732421875
      },
      "text": "The effect on human organs when ultrasonic waves are emitted continuously into the body is unknown. However, we may be able to combine a simple triggering mechanism to start and stop the emission of ultrasonic waves. For example, the combination of an accelerometer and a microphone in the device can detect jaw movements for starting the (silent) voice command without actually emitting a voice."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 555.8021240234375,
        "y1": 291.7190856933594,
        "y2": 298.14495849609375
      },
      "text": "Continuous Ultrasonic-Wave Emission into the Body"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.2952270507812,
        "y1": 415.5184631347656,
        "y2": 469.85400390625
      },
      "text": "We also expect people with damaged vocal cords to use our research. As described in the Human–AI integration section, people will be able to learn how to correctly control their mouth and tongue to generate sound, even though their vocal cords do not work."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 461.605712890625,
        "y1": 400.66412353515625,
        "y2": 407.0899963378906
      },
      "text": "Cure for Vocal Cord Disabilities"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8885498046875,
        "y1": 500.5524597167969,
        "y2": 554.8890380859375
      },
      "text": "Finally, it should be mentioned that this research is not intended to exclude other modalities. Combining the information of EMG, accelerometers, and NAM microphones may improve the quality of speech recognition. Investigating the combination of these modalities is subject of future research."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 472.03662109375,
        "y1": 485.6981201171875,
        "y2": 492.1239929199219
      },
      "text": "Combining with Other Modalities"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.7405395507812,
        "y1": 585.5874633789062,
        "y2": 711.655029296875
      },
      "text": "The above-described observation suggests that an interesting relationship exists between humans and AI. Rather than considering AI as an autonomous or separated entity, wemay be able to regard AI as a part of humans. Hence, even when the initial performance of the (artificial) neural networks is not perfect, a user can gradually learn and improve their performance. This is similar to how people learn fundamental skills. When we learn utterance, the coordination of the motor cortex that drives the oral cavity, tongue, and vocal folds, and the auditory cortex forms a tight loop to obtain better"
    }, {
      "page": 8,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.5788879394531,
        "y1": 333.93646240234375,
        "y2": 471.9590148925781
      },
      "text": "speech performance (Figure 12 (a)). By extending this loop, organic neural networks (e.g., our brain) and artificial neural networks may also form a tight feedback loop (Figure 12 (b)). We name this formation, “human–AI integration” rather than human–AI interaction. In this regard, we refer to the research of Glove Talk II from 1995 a pioneering work on human–AI integration [15]. In this work, the user learned to control a voice synthesizer with hand gestures. Three simple neural networks were used, and the user (who was a pianist) required more than 100 h to generate an audible voice. A combination of better neural networks and a learner could reduce this learning time."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 420.1613464355469,
        "y1": 570.7330932617188,
        "y2": 577.1589965820312
      },
      "text": "Human–AI integration"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7312927246094,
        "y1": 501.15045166015625,
        "y2": 639.1719970703125
      },
      "text": "A method of silent-voice interaction with ultrasonic imaging was proposed. Two neural networks were used in sequence to convert a mouthed “utterance” of a user without a voice to a sound (voice), and could be used to operate the existing voice-controllable devices such as smart speakers. Following this result, we envision that the future formfactor for the wearable computer would be a combination of an attachable ultrasonic imaging probe to the underside of the jaw, with a bone conductive earphone or an openair earphone (Figure 11). With this configuration, a user can always invoke a voice-controllable assistantwithout emitting a voice and obtain responses."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 135.48135375976562,
        "y1": 486.296142578125,
        "y2": 492.7220153808594
      },
      "text": "7 CONCLUSION"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 57.50400161743164,
        "x2": 294.04608154296875,
        "y1": 667.6744995117188,
        "y2": 672.8870239257812
      },
      "text": "[1] Martín Abadi, Ashish Agarwal, Paul Barham, Eugene Brevdo, Zhifeng"
    }, {
      "page": 8,
      "region": {
        "x1": 70.87000274658203,
        "x2": 294.9190979003906,
        "y1": 677.6375122070312,
        "y2": 710.8560180664062
      },
      "text": "Chen, Craig Citro, Greg S. Corrado, AndyDavis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Ian Goodfellow, Andrew Harp, Geoffrey Irving, Michael Isard, Yangqing Jia, Rafal Jozefowicz, Lukasz Kaiser, Manjunath Kudlur, Josh Levenberg, Dandelion Mané, Rajat Monga,"
    }, {
      "page": 8,
      "region": {
        "x1": 321.6610107421875,
        "x2": 559.5513305664062,
        "y1": 97.40254211425781,
        "y2": 341.7190246582031
      },
      "text": "Sherry Moore, Derek Murray, Chris Olah, Mike Schuster, Jonathon Shlens, Benoit Steiner, Ilya Sutskever, Kunal Talwar, Paul Tucker, Vincent Vanhoucke, Vijay Vasudevan, Fernanda Viégas, Oriol Vinyals, Pete Warden, Martin Wattenberg, Martin Wicke, Yuan Yu, and Xiaoqiang Zheng. 2015. TensorFlow: Large-Scale Machine Learning on Heterogeneous Systems. https://www.tensorflow.org/ Software available from tensorflow.org. [2] Dabi Ahn. 2017. Voice Conversion with Non-Parallel Data. https: //github.com/andabi/deep-voice-conversion. [3] Toshiyuki Ando, Yuki Kubo, Buntarou Shizuki, and Shin Takahashi. 2017. CanalSense: Face-Related Movement Recognition System Based on Sensing Air Pressure in Ear Canals. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST ’17). ACM, New York, NY, USA, 679–689. https://doi.org/10.1145/3126594. 3126649 [4] F Bocquelet, Thomas Hueber, Laurent Girin, Pierre Badin, and B Yvert. 2014. Robust articulatory speech synthesis using deep neural networks for BCI applications. , 2288-2292 pages. [5] Florent Bocquelet, Thomas Hueber, Laurent Girin, Christophe Savariaux, and Blaise Yvert. 2016. Real-TimeControl of anArticulatory-Based Speech Synthesizer for Brain Computer Interfaces. PLOS Computational Biology 12, 11 (11 2016), 1–28. https://doi.org/10.1371/journal. pcbi.1005119 [6] François Chollet et al. 2015. Keras. https://keras.io. [7] Tamás Gábor Csapó, Tamás Grósz, Gábor Gosztolya, László Tóth, and"
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.5516357421875,
        "y1": 346.46856689453125,
        "y2": 710.3359985351562
      },
      "text": "AlexandraMarkó. 2017. DNN-Based Ultrasound-to-Speech Conversion for a Silent Speech Interface. In INTERSPEECH. [8] B. Denby, T. Schultz, K. Honda, T. Hueber, J. M. Gilbert, and J. S. Brumberg. 2010. Silent Speech Interfaces. Speech Commun. 52, 4 (April 2010), 270–287. https://doi.org/10.1016/j.specom.2009.08.002 [9] B. Denby and M. Stone. 2004. Speech synthesis from real time ultrasound images of the tongue. In 2004 IEEE International Conference on Acoustics, Speech, and Signal Processing, Vol. 1. I–685. https: //doi.org/10.1109/ICASSP.2004.1326078 [10] L. Diener, M. Janke, and T. Schultz. 2015. Direct conversion from facial myoelectric signals to speech using Deep Neural Networks. In 2015 International Joint Conference on Neural Networks (IJCNN). 1–7. https://doi.org/10.1109/IJCNN.2015.7280404 [11] Roman Gr. Maev (ed.). 2013. Advances in Acoustic Microscopy and High Resolution Imaging: From Principles to Applications. Wiley-VCH. [12] Ariel Ephrat, Tavi Halperin, and Shmuel Peleg. 2017. Improved Speech Reconstruction from Silent Video. ICCV 2017 Workshop on Computer Vision for Audio-Visual Media (2017). [13] Diandra Fabre, Thomas Hueber, Laurent Girin, Xavier Alameda-Pineda, and Pierre Badin. 2017. Automatic animation of an articulatory tongue model from ultrasound images of the vocal tract. Speech Communication 93 (2017), 63 – 75. https://doi.org/10.1016/j.specom.2017.08.002 [14] M.J. Fagan, S.R. Ell, J.M. Gilbert, E. Sarrazin, and P.M. Chapman. 2008. Development of a (silent) speech recognition system for patients following laryngectomy. Medical Engineering & Physics 30, 4 (2008), 419 – 425. https://doi.org/10.1016/j.medengphy.2007.05.003 [15] Sidney Fels and Geoffrey Hinton. 1995. Glove-TalkII: An Adaptive Gesture-to-formant Interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’95). ACM Press/AddisonWesley Publishing Co., New York, NY, USA, 456–463. https://doi.org/ 10.1145/223904.223966 [16] Rebecca Fiebrink. 2017. Machine Learning as Meta-Instrument: Human-Machine Partnerships Shaping Expressive Instrumental Creation. Springer Singapore, Singapore, 137–151. https://doi.org/10. 1007/978-981-10-2951-6_10 [17] Masaaki Fukumoto. 2018. SilentVoice: Unnoticeable Voice Input by Ingressive Speech. In Proceedings of the 31st Annual ACM Symposium"
    }, {
      "page": 9,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.3952941894531,
        "y1": 97.40254211425781,
        "y2": 700.3740234375
      },
      "text": "on User Interface Software and Technology (UIST ’18). ACM, New York, NY, USA, 237–246. https://doi.org/10.1145/3242587.3242603 [18] Mayank Goel, Chen Zhao, Ruth Vinisha, and Shwetak N. Patel. 2015. Tongue-in-Cheek: Using Wireless Signals to Enable Non-Intrusive and Flexible Facial Gestures Detection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15). ACM, New York, NY, USA, 255–258. https://doi.org/10.1145/2702123. 2702591 [19] Jose A. Gonzalez, Lam A. Cheah, James M. Gilbert, Jie Bai, Stephen R. Ell, Phil D. Green, and Roger K. Moore. 2016. A Silent Speech System Based on Permanent Magnet Articulography and Direct Synthesis. Comput. Speech Lang. 39, C (Sept. 2016), 67–87. https://doi.org/10. 1016/j.csl.2016.02.002 [20] D. Griffin and Jae Lim. 1984. Signal estimation from modified shorttime Fourier transform. IEEE Transactions on Acoustics, Speech, and Signal Processing 32, 2 (April 1984), 236–243. https://doi.org/10.1109/ TASSP.1984.1164317 [21] Tamás Grósz, Gábor Gosztolya, László Tóth, Tamás Csapó, and Alexandra Markó. 2018. F0 Estimation for DNN-Based Ultrasound Silent Speech Interfaces. [22] Tatsuya Hirahara, Makoto Otani, Shota Shimizu, Tomoki Toda, Keigo Nakamura, Yoshitaka Nakajima, and Kiyohiro Shikano. 2010. Silentspeech enhancement using body-conducted vocal-tract resonance signals. Speech Communication 52, 4 (2010), 301 – 313. https: //doi.org/10.1016/j.specom.2009.12.001 Silent Speech Interfaces. [23] Robin Hofe, Stephen R. Ell, Michael J. Fagan, James M. Gilbert, Phil D. Green, Roger K. Moore, and Sergey I. Rybchenko. 2013. Smallvocabulary Speech Recognition Using a Silent Speech Interface Based on Magnetic Sensing. Speech Commun. 55, 1 (Jan. 2013), 22–32. https://doi.org/10.1016/j.specom.2012.02.001 [24] Jess Hohenstein and Malte Jung. 2018. AI-Supported Messaging: An Investigation of Human-Human Text Conversation with AI Support. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA ’18). ACM, New York, NY, USA, Article LBW089, 6 pages. https://doi.org/10.1145/3170427.3188487 [25] T. Hueber, G. Aversano, G. Cholle, B. Denby, G. Dreyfus, Y. Oussar, P. Roussel, and M. Stone. 2007. Eigentongue Feature Extraction for an Ultrasound-Based Silent Speech Interface. In 2007 IEEE International Conference on Acoustics, Speech and Signal Processing - ICASSP ’07, Vol. 1. I–1245–I–1248. https://doi.org/10.1109/ICASSP.2007.366140 [26] Thomas Hueber, Elie-Laurent Benaroya, Gérard Chollet, Bruce Denby, Gérard Dreyfus, and Maureen Stone. 2010. Development of a Silent Speech Interface Driven by Ultrasound and Optical Images of the Tongue and Lips. Speech Commun. 52, 4 (April 2010), 288–300. https: //doi.org/10.1016/j.specom.2009.11.004 [27] Thomas Hueber, Elie-Laurent Benaroya, Bruce Denby, and Gérard Chollet. 2011. Statistical Mapping Between Articulatory and Acoustic Data for an Ultrasound-Based Silent Speech Interface. In INTERSPEECH. [28] Thomas Hueber, Gerard Chollet, Bruce Denby, and M Stone. 2008. Acquisition of ultrasound, video and acoustic speech data for a silentspeech interface application. (01 2008). [29] Google Inc. [n. d.]. Clund Speech-to-Text. https://cloud.google.com/ speech-to-text/. [30] Aurore Jaumard-Hakoun, Kele Xu, Clémence Leboullenger, Pierre Roussel-Ragot, and Bruce Denby. 2016. An Articulatory-Based Singing Voice Synthesis Using Tongue and Lips Imaging. In ISCA Interspeech 2016, Vol. 2016. San Francisco, United States, 1467 – 1471. https: //doi.org/10.21437/Interspeech.2016-385 [31] Yan Ji, Licheng Liu, Hongcui Wang, Zhilei Liu, Zhibin Niu, and Bruce Denby. 2018. Updating the Silent Speech Challenge Benchmark with"
    }, {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.5523681640625,
        "y1": 97.40254211425781,
        "y2": 698.4769897460938
      },
      "text": "Deep Learning. Speech Commun. 98, C (April 2018), 42–50. https: //doi.org/10.1016/j.specom.2018.02.002 [32] Chuck Jorgensen and Kim Binsted. 2005. Web Browser Control Using EMG Based Sub Vocal Speech Recognition. In Proceedings of the Proceedings of the 38th Annual Hawaii International Conference on System Sciences - Volume 09 (HICSS ’05). IEEE Computer Society, Washington, DC, USA, 294.3–. https://doi.org/10.1109/HICSS.2005.683 [33] Arnav Kapur, Shreyas Kapur, and Pattie Maes. 2018. AlterEgo: A Personalized Wearable Silent Speech Interface. In 23rd International Conference on Intelligent User Interfaces (IUI ’18). ACM, New York, NY, USA, 43–53. https://doi.org/10.1145/3172944.3172977 [34] Diederik P. Kingma and Jimmy Ba. 2014. Adam: A Method for Stochastic Optimization. CoRR abs/1412.6980 (2014). arXiv:1412.6980 http://arxiv.org/abs/1412.6980 [35] Lorenz Cuno Klopfenstein, Saverio Delpriori, Silvia Malatini, and Alessandro Bogliolo. 2017. The Rise of Bots: A Survey of Conversational Interfaces, Patterns, and Paradigms. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS ’17). ACM, New York, NY, USA, 555–565. https://doi.org/10.1145/3064663.3064672 [36] Rafal Kocielnik, Daniel Avrahami, Jennifer Marlow, Di Lu, and Gary Hsieh. 2018. Designing for Workplace Reflection: A Chat and VoiceBased Conversational Agent. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS ’18). ACM, New York, NY, USA, 881–894. https://doi.org/10.1145/3196709.3196784 [37] L. Maier-Hein, F. Metze, T. Schultz, and A. Waibel. 2005. Session independent non-audible speech recognition using surface electromyography. In IEEE Workshop on Automatic Speech Recognition and Understanding, 2005. 331–336. https://doi.org/10.1109/ASRU.2005.1566521 [38] Hiroyuki Manabe, Akira Hiraiwa, and Toshiaki Sugimura. 2003. \"Unvoiced Speech Recognition Using EMG - Mime Speech Recognition\". In CHI ’03 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’03). ACM, New York, NY, USA, 794–795. https: //doi.org/10.1145/765891.765996 [39] Denys J. C. Matthies, Bernhard A. Strecker, and Bodo Urban. 2017. EarFieldSensing: A Novel In-Ear Electric Field Sensing to Enrich Wearable Gesture Input Through Facial Expressions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). ACM, New York, NY, USA, 1911–1922. https://doi.org/10.1145/ 3025453.3025692 [40] Jess McIntosh, Asier Marzo, Mike Fraser, and Carol Phillips. 2017. EchoFlex: Hand Gesture Recognition Using Ultrasound Imaging. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). ACM, New York, NY, USA, 1923–1934. https://doi. org/10.1145/3025453.3025807 [41] Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for How Users Overcome Obstacles in Voice User Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). ACM, New York, NY, USA, Article 6, 7 pages. https://doi.org/10.1145/3173574.3173580 [42] Y. Nakajima, H. Kashioka, K. Shikano, and N. Campbell. 2003. Nonaudible murmur recognition input interface using stethoscopic microphone attached to the skin. In 2003 IEEE International Conference on Acoustics, Speech, and Signal Processing, 2003. Proceedings. (ICASSP ’03)., Vol. 5. V–708. https://doi.org/10.1109/ICASSP.2003.1200069 [43] Phuc Nguyen, Nam Bui, Anh Nguyen, Hoang Truong, Abhijit Suresh, Matt Whitlock, Duy Pham, Thang Dinh, and Tam Vu. 2018. TYTH-Typing On Your Teeth: Tongue-Teeth Localization for HumanComputer Interface. In Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys ’18). ACM, New York, NY, USA, 269–282. https://doi.org/10.1145/3210240. 3210322"
    }, {
      "page": 10,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.39422607421875,
        "y1": 97.40254211425781,
        "y2": 371.6059875488281
      },
      "text": "[44] Anne Porbadnigk, Marek Wester, Jan Calliess, and Tanja Schultz. 2009. EEG-based Speech Recognition - Impact of Temporal Effects. In BIOSIGNALS. [45] Amanda Purington, Jessie G. Taft, Shruti Sannon, Natalya N. Bazarova, and Samuel Hardman Taylor. 2017. \"Alexa is My New BFF\": Social Roles, User Satisfaction, and Personification of the Amazon Echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17). ACM, New York, NY, USA, 2853–2859. https://doi.org/10.1145/3027063.3053246 [46] Olaf Ronneberger, Philipp Fischer, and Thomas Brox. 2015. U-Net: Convolutional Networks for Biomedical Image Segmentation. CoRR abs/1505.04597 (2015). arXiv:1505.04597 http://arxiv.org/abs/1505. 04597 [47] Alexander I. Rudnicky. 1989. The Design of Voice-driven Interfaces. In Proceedings of the Workshop on Speech and Natural Language (HLT ’89). Association for Computational Linguistics, Stroudsburg, PA, USA, 120–124. https://doi.org/10.3115/100964.100972 [48] Himanshu Sahni, Abdelkareem Bedri, Gabriel Reyes, Pavleen Thukral, Zehua Guo, Thad Starner, and Maysam Ghovanloo. 2014. The Tongue and Ear Interface: A Wearable System for Silent Speech Recognition. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (ISWC ’14). ACM, New York, NY, USA, 47–54. https://doi. org/10.1145/2634317.2634322 [49] Tanja Schultz. 2010. ICCHP Keynote: Recognizing Silent and Weak Speech Based on Electromyography. In Computers Helping People with Special Needs, Klaus Miesenberger, Joachim Klaus, Wolfgang Zagler, and Arthur Karshmer (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 595–604."
    }, {
      "page": 10,
      "region": {
        "x1": 317.95501708984375,
        "x2": 559.548828125,
        "y1": 97.40254211425781,
        "y2": 351.6809997558594
      },
      "text": "[50] Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. \"Hey Alexa, What’s Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS ’18). ACM, New York, NY, USA, 857–868. https://doi.org/10.1145/3196709.3196772 [51] László Tóth, Gábor Gosztolya, Tamás Grósz, Alexandra Markó, and Tamás Csapó. 2018. Multi-Task Learning of Speech Recognition and Speech Synthesis Parameters for Ultrasound-based Silent Speech Interfaces. [52] Michael Wand, Jan Koutník, and Jürgen Schmidhuber. 2016. Lipreading with Long Short-Term Memory. CoRR abs/1601.08188 (2016). arXiv:1601.08188 http://arxiv.org/abs/1601.08188 [53] Jun Wang, Ashok Samal, and Jordan Green. 2014. Preliminary Test of a Real-Time, Interactive Silent Speech Interface Based on Electromagnetic Articulograph. (06 2014). [54] Yuxuan Wang, R. J. Skerry-Ryan, Daisy Stanton, Yonghui Wu, Ron J. Weiss, Navdeep Jaitly, Zongheng Yang, Ying Xiao, Zhifeng Chen, Samy Bengio, Quoc V. Le, Yannis Agiomyrgiannakis, Rob Clark, and Rif A. Saurous. 2017. Tacotron: A Fully End-to-End Text-To-Speech Synthesis Model. CoRR abs/1703.10135 (2017). arXiv:1703.10135 http://arxiv. org/abs/1703.10135 [55] Qiao Zhang, Shyamnath Gollakota, Ben Taskar, and Raj P.N. Rao. 2014. Non-intrusive Tongue Machine Interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’14). ACM, NewYork, NY, USA, 2555–2558. https://doi.org/10.1145/2556288. 2556981"
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 116.5623779296875,
        "y1": 653.5090942382812,
        "y2": 659.9349975585938
      },
      "text": "REFERENCES"
    }
  }]
}