{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.08100128173828,
      "x2": 295.5535888671875,
      "y1": 233.9391326904297,
      "y2": 418.87200927734375
    },
    "text": "ABSTRACT From Fanger’s seminal work on thermal comfort in the 1970s, standards governing temperatures in the workplace enshrine clothing level calculations based on full business suits, and building regulations developed using only male metabolic data, locking in a default male perspective. Even later work that highlights gender biases with regard to metabolism calculation, inclusive of both genders has focused on younger women, and the voices of older working women are missing from this discourse. We invited women over 45 to explore what they fnd important in workplace thermal comfort, and how devices and interfaces might meet their needs and also encourage thermal adaptivity. Our study highlights factors such as ’fresh air’, and the importance of empathy to fellow inhabitants. We bring new voices to the thermal comfort discourse which supports reducing energy use in the workplace, improving thermal environments and ensuring the needs of a diverse, aging workforce are considered."
  },
  "figures": [{
    "caption": "Figure 3: Comfyapp https://www.comfyapp.com/",
    "captionBoundary": {
      "x1": 75.46199798583984,
      "x2": 272.3820495605469,
      "y1": 590.5670776367188,
      "y2": 596.197998046875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "3",
    "page": 5,
    "regionBoundary": {
      "x1": 78.0,
      "x2": 270.0,
      "y1": 83.0,
      "y2": 577.0
    }
  }, {
    "caption": "Figure 9: participant design; the ‘Ot or Not’ app, from the yellow table",
    "captionBoundary": {
      "x1": 165.031005859375,
      "x2": 446.9706115722656,
      "y1": 333.0411071777344,
      "y2": 338.6719970703125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "9",
    "page": 10,
    "regionBoundary": {
      "x1": 96.0,
      "x2": 516.0,
      "y1": 83.0,
      "y2": 320.0
    }
  }, {
    "caption": "Figure 4: Trial prototype UI",
    "captionBoundary": {
      "x1": 250.27000427246094,
      "x2": 361.7314758300781,
      "y1": 252.30506896972656,
      "y2": 257.93597412109375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "4",
    "page": 6,
    "regionBoundary": {
      "x1": 168.0,
      "x2": 444.0,
      "y1": 83.0,
      "y2": 239.0
    }
  }, {
    "caption": "Figure 5: Participant design from the pink table illustrating temperature controlled (and controlling) clothing",
    "captionBoundary": {
      "x1": 83.96600341796875,
      "x2": 528.0361938476562,
      "y1": 524.2140502929688,
      "y2": 529.844970703125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "5",
    "page": 6,
    "regionBoundary": {
      "x1": 95.0,
      "x2": 517.0,
      "y1": 273.0,
      "y2": 511.0
    }
  }, {
    "caption": "Figure 8: Participant design (yellow table) for robot to provide data about the ofce to the worker before they leave home",
    "captionBoundary": {
      "x1": 61.5369987487793,
      "x2": 550.4660034179688,
      "y1": 611.9880981445312,
      "y2": 617.6190185546875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "8",
    "page": 9,
    "regionBoundary": {
      "x1": 97.0,
      "x2": 515.0,
      "y1": 363.0,
      "y2": 598.0
    }
  }, {
    "caption": "Figure 7: High-tech design idea including automatic window tinting, light altering, temperature changing walls, seat controls and fresh air blowers, all controlled by AI, from the orange table",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.202880859375,
      "y1": 331.92010498046875,
      "y2": 348.5079345703125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "7",
    "page": 9,
    "regionBoundary": {
      "x1": 97.0,
      "x2": 515.0,
      "y1": 83.0,
      "y2": 318.0
    }
  }, {
    "caption": "Figure 6: Participant design from the orange table. An example of a design focussing on maintaining a specifc local environment, with minimum impact on other room inhabitants",
    "captionBoundary": {
      "x1": 53.7979736328125,
      "x2": 559.8079223632812,
      "y1": 312.8701171875,
      "y2": 329.45794677734375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "6",
    "page": 7,
    "regionBoundary": {
      "x1": 114.0,
      "x2": 498.0,
      "y1": 83.0,
      "y2": 299.0
    }
  }, {
    "caption": "Figure 1: Workshop in progress showing participants’ work and refreshments",
    "captionBoundary": {
      "x1": 317.9549560546875,
      "x2": 558.4678955078125,
      "y1": 379.0573425292969,
      "y2": 395.6444396972656
    },
    "figType": "Figure",
    "imageText": [],
    "name": "1",
    "page": 3,
    "regionBoundary": {
      "x1": 332.0,
      "x2": 544.0,
      "y1": 83.0,
      "y2": 366.0
    }
  }, {
    "caption": "Figure 2: Nest Controller (https://nest.com/uk/.",
    "captionBoundary": {
      "x1": 211.28399658203125,
      "x2": 400.7171325683594,
      "y1": 383.5431213378906,
      "y2": 389.17401123046875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "2",
    "page": 4,
    "regionBoundary": {
      "x1": 128.0,
      "x2": 484.0,
      "y1": 83.0,
      "y2": 370.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79681396484375,
        "x2": 294.0318298339844,
        "y1": 451.5815124511719,
        "y2": 468.73345947265625
      },
      "text": "• Human-centered computing; • HCI design and evaluation methods;"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 134.8191375732422,
        "y1": 437.2281494140625,
        "y2": 444.0790100097656
      },
      "text": "CCS CONCEPTS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.59199905395508,
        "x2": 286.84246826171875,
        "y1": 501.4465026855469,
        "y2": 507.6419982910156
      },
      "text": "1, Thermal comfort, 2, Gender, 3, Menopause 4, User experience"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 115.66295623779297,
        "y1": 487.0921325683594,
        "y2": 493.9429931640625
      },
      "text": "KEYWORDS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.3120002746582,
        "x2": 294.9259033203125,
        "y1": 533.6647338867188,
        "y2": 588.9859619140625
      },
      "text": "Kathy New, Alexandra Gormally, Adrian Friday, and Mike Hazas. 2021. ’We Can Send A Man To The Moon But We Can’t Control The Temperature In Our ofce’; A Considerate Approach To Workplace Thermal Comfort by Older Women. In CHI Conference on Human Factors in Computing Systems (CHI ’21), May 08–13, 2021, Yokohama, Japan. ACM, New York, NY, USA, 15 pages. https://doi.org/10.1145/3411764.3445127"
    }, {
      "page": 0,
      "region": {
        "x1": 53.316795349121094,
        "x2": 294.81671142578125,
        "y1": 621.2329711914062,
        "y2": 707.3482055664062
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for proft or commercial advantage and that copies bear this notice and the full citation on the frst page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specifc permission and/or a fee. Request permissions from permissions@acm.org. CHI ’21, May 08–13, 2021, Yokohama, Japan © 2021 Association for Computing Machinery. ACM ISBN 978-1-4503-8096-6/21/05. . . $15.00 https://doi.org/10.1145/3411764.3445127"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.50299835205078,
        "x2": 140.4955596923828,
        "y1": 524.2047729492188,
        "y2": 529.2099609375
      },
      "text": "ACM Reference Format:"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.6860046386719,
        "x2": 558.4290771484375,
        "y1": 248.29246520996094,
        "y2": 396.9540100097656
      },
      "text": "Indoor air temperature recommendations derive from early work done by Fanger, [22] and are calculated based on a thermal comfort model known as Predicted Mean Vote (PMV). PMV became the internationally accepted model for predicting the mean thermal sensation for building inhabitants. The model was developed from laboratory studies of approximately 1,300 students and has since been applied to set temperature ranges across a wide range of building types, despite originally being intended for use only in buildings with mechanical heating, ventilation and air-conditioning (HVAC) [22, 28]. As well as highlighting the faws in the universal application of the model to any building, Van Hoof [28] also notes that it can only be applied to healthy adults, and is not applicable to children, older adults and disabled people, without corrections being applied."
    }, {
      "page": 0,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7091674804688,
        "y1": 401.7149658203125,
        "y2": 550.3790283203125
      },
      "text": "Calculations related to the insulation efect of clothing now enshrined in building regulations are based on 1970s stereotypes of a male in a full business suit. Kingma and van Marken Lichtenbelt [31] further highlight the gender bias in these regulations with regard to metabolism calculation, estimating that they may overestimate female metabolism by as much as 35%. However, even studies that include both genders have focused on young women. The voices of older women, particularly with regard to issues experienced around menopause, have until now, been missing from the discourse. This implicit bias is particularly problematic now as we look to reconsider how to control indoor environments in new ways to reduce energy and carbon footprint, while also needing to engage building inhabitants in the active production of their own thermal comfort [13]."
    }, {
      "page": 0,
      "region": {
        "x1": 317.8290100097656,
        "x2": 559.7181396484375,
        "y1": 555.1425170898438,
        "y2": 707.3469848632812
      },
      "text": "According to Hess et al, [26] “Menopause is a universal phenomenon for women. It is a biological process, characterized by falls in estradiol and progesterone, increases in follicle stimulating hormone, as well as a life stage, characterized by changing roles such as the end of childbearing potential and children leaving home.” It afects roughly half the population, and has a range of physical, psychological and emotional symptoms including low mood, anxiety, problems with memory and concentration1 [41]. Physical and emotional efects of the menopause often coincide with other lifechanging events for women including ‘empty nests’, aging parents with deteriorating health leading to an increased caring burden and increasing levels of divorce for women in midlife [19]. 1As defned by UK National Health Service, https://www.nhs.uk/conditions/ menopause/symptoms/, accessed 16th September 2020."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 420.6850280761719,
        "y1": 233.9391326904297,
        "y2": 240.78997802734375
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5574951171875,
        "y1": 87.45320129394531,
        "y2": 181.32000732421875
      },
      "text": "This demographic group make up a considerable proportion of the workforce in the UK and are likely to increase in proportion as the working population ages [11]. In June 2019, Lancaster University in the UK had 818 female staf aged 46 and over out of a total workforce of 3,633 (22.5%), and a high proportion of these female staf work in shared ofces. We wanted to explore the specifc needs of this group in terms of thermal comfort and give voice to a group underrepresented in technological design, and thermal comfort specifcally."
    }, {
      "page": 1,
      "region": {
        "x1": 53.48400115966797,
        "x2": 295.5574645996094,
        "y1": 186.0832061767578,
        "y2": 290.90899658203125
      },
      "text": "Older working women, particularly those going through various stages of the menopause journey, report a wide range of symptoms including problems of thermal regulation and lack of confdence. Arber and Ginn [1] note the invisibility of women in later life, and Bochantin [8] describes how employers have been slow in their recognition of the efect of menopause on working women, and notes little consideration is given to their specifc needs. This has resulted in women being silenced with regards to their needs in terms of menopause considerations at work, due to fear of embarrassment or ridicule."
    }, {
      "page": 1,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.56280517578125,
        "y1": 295.6722412109375,
        "y2": 488.16900634765625
      },
      "text": "We conducted a design workshop carefully curated to ensure participants felt heard and valued, inviting women over 45 years working or studying at Lancaster University, to explore the design of devices and user interfaces that would meet their thermal comfort needs and encourage thermal adaptivity in the workplace. We contribute to the existing body of literature on thermal comfort in diferent user groups, and facilitate the creation of genderresponsible user interfaces using inclusive design methods. The resulting fndings make an important contribution to existing work by highlighting the signifcance of: empathy for and relationship to others; the need for fresh air; enabling the reconfguration of working practices and policy; and extending the discourse from designer-to-user, towards user-user, and user-planet. We identify empathy for others as a signifcant concern for our workshop participants, and therefore highlight its potential as a design direction for thermal comfort user interfaces driven by the needs of this underrepresented but important, and growing, demographic in the workplace."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 558.1990356445312,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan Kathy New et al."
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.4273986816406,
        "y1": 520.3302001953125,
        "y2": 559.4019775390625
      },
      "text": "This research relates to a number of HCI areas including empathy in HCI design, negotiation in interaction design and energy use. Plus, areas less considered in HCI design, such as thermal comfort and gendered interfaces for thermal comfort."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 157.587158203125,
        "y1": 505.9761047363281,
        "y2": 512.8270263671875
      },
      "text": "2 RELATED WORK"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.5554504394531,
        "y1": 591.5621948242188,
        "y2": 707.3469848632812
      },
      "text": "Established theoretical models for predicting thermal comfort are based on six parameters: four environmental and two humancentred. The environmental parameters are air temperature, radiant temperature, air speed and humidity. The two human-centered parameters are metabolism and clothing level. Temperature standards for buildings were developed from landmark studies by Fanger [22], on the thermal comfort model known as Predicted Mean Vote (PMV). While there has been criticism of the PMV model [28], it forms the basis of current building standards such as BS EN 12831 (Rhe/24, 2017 [9]) in Europe, ASHRAE 55-92 [2] in America and CIBSE Guide A, 2015 [12] in the UK. However, Kingma and Marken"
    }, {
      "page": 1,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.4378662109375,
        "y1": 87.45320129394531,
        "y2": 159.4019775390625
      },
      "text": "von Lichtenbelt [31] noted that the original standards focus on ‘the average male’ and may have overestimated female metabolism by as much as 35%. Conversely, the study they conducted to refute this was performed on sixteen young adult female participants of 18 to 30 years of age, and entirely excluded older women. Indeed, women are regularly excluded from thermal comfort studies, leaving their needs unconsidered and invisible."
    }, {
      "page": 1,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7179565429688,
        "y1": 164.1652374267578,
        "y2": 367.6210021972656
      },
      "text": "Schellen et al. [44] conducted a study on thermal comfort preferences comparing younger and older adults. This study used sixteen participants, eight young adults (22–25) and eight older adults (67– 73), all of whom were male. It investigated diferences between young adults and elderly in thermal comfort, productivity, and thermal physiology in response to moderate temperature drifts (17–25{°}C), Policies around thermal comfort are evolving, and in 2014 and found little diference between the two groups, although there was a slight diference in comfort among the elderly in line with other studies (Collins et al., [16] – using solely male elderly subjects, Hashiguchi et al. [25], Degroot and Kenny [20]) Although the subjects felt less comfortable as the temperature drifted, the conditions were not unacceptable, and productivity was not afected negatively. The paper refers to ‘subjects’, ‘young adults’ and ‘the elderly’ throughout, and there is no consideration of gender either in the discussion or conclusion. Instead, the male is seen as the default human, despite the fact that women experience more metabolic fuctuations throughout their lifetimes due to the menstrual cycle, pregnancy and menopause, none of which are experienced by men."
    }, {
      "page": 1,
      "region": {
        "x1": 317.95477294921875,
        "x2": 559.716552734375,
        "y1": 372.3821716308594,
        "y2": 521.0460205078125
      },
      "text": "A recent paper by Oppermann et al. [43] conducted a case study on 18 male workers at an open pit mine in Australia, to look at heat stress. Despite noting at the beginning of the paper that all the workers were male, the conclusions are generalized in terms of the ‘rhythms of the body’ rather than the rhythms of male bodies. These are just a few examples of the ‘default male’ which we have found to span the vast majority of thermal comfort literature. Implicit biases such as these due to participant selection and generalization of conclusions occur in many walks of life. Criado Perez [18] cites numerous examples of gender inequality in research, and highlights the gender data gap with regard to the design of a range of artefacts and systems including transportation, safety equipment, medical devices and treatments, smartphones and voice recognition technologies."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 226.53268432617188,
        "y1": 577.2091064453125,
        "y2": 584.0599975585938
      },
      "text": "2.1 Thermal Comfort and Gender"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1906127929688,
        "y1": 580.6041870117188,
        "y2": 652.552978515625
      },
      "text": "Blythe et al. [7] conducted a series of workshops investigating employees’ perceptions of energy use in the workplace, highlighting the importance of trust in systems, and employee engagement and empowerment, for the design of successful workplace energy interventions. However, the gender of participants is not disclosed, and discussion of power relationships centered on who is to blame if it goes wrong, rather than a cooperative approach."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7141723632812,
        "y1": 657.316162109375,
        "y2": 707.3469848632812
      },
      "text": "Clear et al. [14] looked at the role of sensor data as a tool for developing a more inclusive building management process. While highlighting the benefts of bringing together managers and inhabitants, and facilitating conversations around building management using temperature data, it does not discuss the power diferences"
    }, {
      "page": 2,
      "region": {
        "x1": 53.2400016784668,
        "x2": 392.1065673828125,
        "y1": 57.68657684326172,
        "y2": 69.929443359375
      },
      "text": "’We Can Send A Man To The Moon But We Can’t Control The Temperature In Our ofice’; A Considerate Approach To Workplace Thermal Comfort by Older Women"
    }, {
      "page": 2,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.0314636230469,
        "y1": 87.45348358154297,
        "y2": 104.60797119140625
      },
      "text": "within those relationships, and key demographic data of people in those roles such as gender and age is not explicit."
    }, {
      "page": 2,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5541687011719,
        "y1": 109.37151336669922,
        "y2": 203.23797607421875
      },
      "text": "Indeed, a tradition within thermal comfort and HCI has been design systems to ‘evenly spread the sufering’ [45]. Milenkovic [39] is very clear about the gender representation of the participants in his study (71% male in the French trial, 59% male in the Japanese trial) using POEM (personal ofce energy monitor), a device which enables inhabitants to express their comfort votes, form an aggregate and then inform the building manager. However, the age of the inhabitants is not revealed, and the system places control frmly with the building manager."
    }, {
      "page": 2,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.4147033691406,
        "y1": 208.0015106201172,
        "y2": 268.99102783203125
      },
      "text": "There is a lack of transparency and discussion about participant characteristics throughout the majority of these studies, and little discussion of the power discrepancies that exist within these groups. This is an important factor to be mindful of when bringing managers and inhabitants together during workshops. Specifc cultural and workplace factors are also important, and need to be highlighted."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79798889160156,
        "x2": 294.2695617675781,
        "y1": 273.7545166015625,
        "y2": 378.5799865722656
      },
      "text": "HCI’s engagement with menopause and its experiences have largely centered around associated health issues (e.g. self-tracking tools, [27] and other health apps), however it is also acknowledged that women’s experience of menopause is shaped by social, cultural and political contexts [35]. In this study we are looking specifcally at the context of work, and how thermal comfort needs across the menopausal journey are (not) considered. This contributes to a broader efort to embed women’s needs throughout their lifetime more generally into system design, thus speaking to both issues of gender inequality and ageism in the workplace [3]."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 513.9915161132812,
        "y1": 553.298095703125,
        "y2": 573.0980834960938
      },
      "text": "2.2 Gender and Interaction Design For Thermal Comfort"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.4150695800781,
        "y1": 427.17950439453125,
        "y2": 564.8820190429688
      },
      "text": "According to the Merriam-Webster dictionary, Empathy is ‘the action of understanding, being aware of, being sensitive to, and vicariously experiencing the feelings, thoughts, and experience of another of either the past or present without having the feelings, thoughts, and experience fully communicated in an objectively explicit manner’. [38] Toussaint and Webb [50] note that much of the research indicates that women are more empathic than men. In terms of age, most studies on empathy focus on children rather than women of diferent ages, so the impact of this factor is not clear. By not including older women in the design of space temperature control systems, we risk missing out on characteristics such as empathy for others, which have the potential to be transformative in that design space."
    }, {
      "page": 2,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.5537414550781,
        "y1": 569.6455078125,
        "y2": 707.345458984375
      },
      "text": "Empathy for the user is a natural goal of user centered design. The importance of engaging a diverse range of users in the design of systems and interfaces has long been established. Menold and Jablokow [37] conducted studies into cognitive diversity within teams, fnding heterogenous teams outperformed homogenous teams with regard to creative output. Fulton Suri [23], specifcally highlights how empathy can be useful for understanding why people do things, broadening our comprehension from how and what they do. Wright and McCarthy [53] encourage empathy as an important part of designing for others and Koskinen et al. [32] explore empathy as a key component when designing interactive technologies. Developing empathy for users is itself a challenge. Bennett and Rosner reach to the foundations of empathy in design and"
    }, {
      "page": 2,
      "region": {
        "x1": 432.1289978027344,
        "x2": 558.205078125,
        "y1": 65.87957000732422,
        "y2": 69.927978515625
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan"
    }, {
      "page": 2,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.7013549804688,
        "y1": 87.45348358154297,
        "y2": 115.5670166015625
      },
      "text": "point to how problematic many established techniques are in developing empathy between designers and, in their case, users with disabilities [5]."
    }, {
      "page": 2,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7172241210938,
        "y1": 120.33049774169922,
        "y2": 258.031982421875
      },
      "text": "These works justifably highlight the need for empathy from designers to users and the need for empathy from users towards other users. However, it is less clear how that should be factored into the design process. Coulton et al. posit the integration of design to engender various forms of empathy including compassion for others in their work on ‘digital candles’ [17]. This is important given for example, sufering centered design, postulated by Tomlinson [49], who argues that HCI has been complicit in hiding the sufering of others due to limited contextual cues via digital mediated communication. Tomlinson also suggests the community design activities that highlight this sufering rather than obscuring it, although this approach could be problematic in a predominantly capitalist economic context."
    }, {
      "page": 2,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7100219726562,
        "y1": 262.7955322265625,
        "y2": 356.6629943847656
      },
      "text": "While our study was the very opposite in terms of diversity of participant type, focusing by design on one demographic, it highlights the importance of having a diversity of experiences involved in the design process, a process where older women are often absent. A UK Ofce for National Statistics report [42] identifes that women are much more likely than men to work part time, and in low paid sectors such as administrative and secretarial jobs, and therefore much more likely to be in shared ofces. As we will see, empathy for others is a signifcant factor in our fndings."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 173.3060760498047,
        "y1": 412.82513427734375,
        "y2": 419.6759948730469
      },
      "text": "2.3 Empathy in Design"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7035522460938,
        "y1": 388.8235168457031,
        "y2": 471.7309875488281
      },
      "text": "Our study is part of a larger project exploring the relationships between technology, people and policies, and the efect of their interactions on adaptive thermal comfort in the workplace. One of our project’s practical goals is to enable energy managers to control buildings on a room-by-room basis, and thus reduce energy consumption. Our study is a key step to support the successful introduction of such systems, and to identify features of user interfaces that promote adaptation and meet diverse users’ needs."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.4214477539062,
        "y1": 476.4945068359375,
        "y2": 526.5260009765625
      },
      "text": "At frst it may seem counterintuitive that we wanted to improve diversity in the design space by running a workshop with only one restricted demographic group. However, this is a group with specifc needs that we particularly wanted to reach in order to enable an efective voice."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 497.99713134765625,
        "y1": 374.4691467285156,
        "y2": 381.32000732421875
      },
      "text": "3 METHODS AND PARTICIPANTS"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7034912109375,
        "y1": 558.6865234375,
        "y2": 707.3469848632812
      },
      "text": "A snowball approach was used to target a specifc demographic of women 45 years of age or older, working or studying at Lancaster University in the UK. Emails advertising the workshop were sent to the menopause support group, mature and post graduate students’ Facebook page, and the University Staf ‘Live Projects’ website. People were asked to share the invitation with anyone they knew who might like to participate. This approach was designed to reach as many people as possible in diferent roles at the University. Participants were ofered a £10 voucher for taking part, and the workshop lasted 2.5 hours. Thirteen cis gender women attended with an age range of 47-60. Five of the women were 50 years of age, and one woman stated her age as ‘mid ffties’. Menopause usually occurs between 45 and 55 years of age, and 51 is the average age for women in the UK to reach the menopause [34]. The thirteen participants"
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 458.12481689453125,
        "y1": 544.3321533203125,
        "y2": 551.1829833984375
      },
      "text": "3.1 Recruiting Participants"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.55035400390625,
        "y1": 87.45348358154297,
        "y2": 214.197021484375
      },
      "text": "comprised of women in diferent stages of the menopausal journey: perimenopause, menopause and post-menopausal working women. These stages are difcult to delineate particularly from a personal point of view without specialized medical diagnosis. The participants were not asked to disclose their specifc relationship with regard to the menopause during the workshop and will therefore be referred to throughout this paper as older working women. While our study did not (and could not) seek to diferentiate and defne specifc experiences of workplace thermal comfort bolted onto a defned menopausal stage, we instead sought to provide a comfortable space for older working women to discuss commonalities and diferences in their experiences."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 558.2066650390625,
        "y1": 63.29857635498047,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan Kathy New et al."
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.551513671875,
        "y1": 243.1374969482422,
        "y2": 435.6340026855469
      },
      "text": "We set out to understand the participants’ attitudes to thermal comfort in the workplace and particularly in shared ofce environments by asking them to refect on their experiences, strategies for managing thermal comfort at work, and the creation of a number of inventive system design sketches to inform our understanding for future design work. We set out to create a sense of ‘afternoon tea with friends’, and provide a relaxed, informal friendly space for women to share their thoughts comfortably and confdently. Browne [10] discusses the importance of researcher positionality, concluding that focus groups, humour and laughter enable more relaxed intimate conversations about everyday practices, which may not be so easy to elicit using other research methods. At the workshop, there were three tables: yellow, orange and pink, each with a female facilitator. The three tables were covered with paper for people to write and draw on. Cake stands with a range of cakes and vintage crockery were provided (Figure 1). Conversations were audio recorded on each table throughout, and later transcribed by the researcher."
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0351867675781,
        "y1": 440.3974914550781,
        "y2": 468.510986328125
      },
      "text": "After an initial ice breaker, the frst 20 minutes of the workshop consisted of facilitated discussion, sharing experiences of workplace thermal comfort:"
    }, {
      "page": 3,
      "region": {
        "x1": 68.08084106445312,
        "x2": 295.5503845214844,
        "y1": 475.45068359375,
        "y2": 503.56298828125
      },
      "text": "1. How do you fnd temperature in the workplace generally? 2. How does that change through the day/week/seasons? 3. Has that changed throughout your lifetime? Diferent work-"
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5486145019531,
        "y1": 508.32647705078125,
        "y2": 549.572998046875
      },
      "text": "places? After a brief ‘checking in’ point from the workshop coordinator, the second 20 minutes was more facilitated discussion on the following questions:"
    }, {
      "page": 3,
      "region": {
        "x1": 68.08084106445312,
        "x2": 295.0251770019531,
        "y1": 556.5115356445312,
        "y2": 650.3779907226562
      },
      "text": "1. How do you personally manage your thermal comfort? What opportunities are there in your space? (prompts – windows, doors, breaks, exercise, clothing, food, hot/cold drinks) 2. Any barriers, what prevents you from achieving thermal comfort? 3. Who’s in control? (prompts – shared ofce, line manager, building manager, who sits next to the window etc.) 4. What do you expect the workplace to provide in terms of thermal comfort?"
    }, {
      "page": 3,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.0227355957031,
        "y1": 657.3164672851562,
        "y2": 707.3469848632812
      },
      "text": "After another checking in, the participants completed a ‘design brief’ which asked them to write a description of themselves (age, occupation, hobbies etc.), their individual thermal comfort needs, what they would like the system to do and how they would make it accessible to a range of users."
    }, {
      "page": 3,
      "region": {
        "x1": 317.953857421875,
        "x2": 558.1928100585938,
        "y1": 438.1385192871094,
        "y2": 488.16900634765625
      },
      "text": "Participants were next asked to sketch something that would help them to control their thermal comfort needs. They were asked to be as creative as possible, and to be as imaginative and unconstrained as they wished. We used four diverse visual prompts to seed the discussion (see supplementary materials)."
    }, {
      "page": 3,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.7097778320312,
        "y1": 492.9324951171875,
        "y2": 630.635009765625
      },
      "text": "Dewberry et al. [21] discuss the importance of design activities in promoting sustainability both at a product and system level. Their work demonstrates the benefts of ‘design visions’ which look at the whole system rather than focusing on small improvements to current products. We were interested in the kinds of interactions participants would come up with, when given the opportunity and the space. The stimulus materials were chosen to provoke and promote creative thinking, and to bring a sense of fun to the discussion. We deliberately avoided items traditionally linked to thermal comfort such as thermometers, air-conditioners or heaters. We also wanted to ensure participants would neither feel constrained by traditional solutions nor by the particular energy-saving agenda of our broader project."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.4207153320312,
        "y1": 635.3984985351562,
        "y2": 707.3469848632812
      },
      "text": "Participants were given 20 minutes to ideate up to three possible devices or systems to improve their thermal comfort, and then to develop one of these further, using an iterative process. Examples from each table were shared with the wider group. Following a short break, participants were then asked to design an online user interface that would encourage people to take greater responsibility for their own thermal comfort."
    }, {
      "page": 4,
      "region": {
        "x1": 53.2400016784668,
        "x2": 558.1988525390625,
        "y1": 57.68669509887695,
        "y2": 69.92919921875
      },
      "text": "’We Can Send A Man To The Moon But We Can’t Control The Temperature In Our ofice’; A Considerate Approach To Workplace Thermal Comfort by Older Women CHI ’21, May 08–13, 2021, Yokohama, Japan"
    }, {
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.55877685546875,
        "y1": 411.1722412109375,
        "y2": 472.1629943847656
      },
      "text": "The fnal activity of the workshop was to look at three examples of existing online interfaces for heating systems, and discuss what they liked about them, what they didn’t like, and how they would improve them (Figure 2). The three examples were chosen to illustrate a range of features and included a design currently in a testbed trial at the University (fgure 4)."
    }, {
      "page": 4,
      "region": {
        "x1": 53.48400115966797,
        "x2": 295.5588073730469,
        "y1": 476.92523193359375,
        "y2": 570.79296875
      },
      "text": "The workshop was audio recorded and transcribed. Materials produced during the workshop (written, design brief sheets, device designs and writing on the tables) were retained and photographed. All the data produced; written, audio and sketched were thematically coded and analysed by the researcher. We emphasise that our goal was not for our participants to produce viable system designs, but rather to gain a greater appreciation through the whole process of the factors afecting their thermal comfort in the workplace, and interactive systems’ potential role in supporting this."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 235.40011596679688,
        "y1": 228.7831268310547,
        "y2": 235.63397216796875
      },
      "text": "3.2 Workshop Design And Delivery"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.55767822265625,
        "y1": 602.5211791992188,
        "y2": 707.3469848632812
      },
      "text": "Berg [6] highlights the important role of the workshop facilitator’s instruction and approach to delivery in determining the outcomes of the workshop. The workshop leader has over 20 years’ experience in designing and delivering workshops, and lead the delivery, introducing each activity, leading group discussions and feedback, and visiting all tables throughout each activity, for clarifcation and consistency. The table facilitators all had experience of facilitating and leading group discussions and followed the workshop leader’s guidance on design tasks. Facilitators fostered a dynamic dialogue, and provided a secure environment for overlooked voices."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 188.45993041992188,
        "y1": 588.1680908203125,
        "y2": 595.0189819335938
      },
      "text": "3.3 Workshop Facilitators"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.7182006835938,
        "y1": 424.8712158203125,
        "y2": 507.77899169921875
      },
      "text": "In this section, we draw on our fndings from the workshop. We use this hitherto underrepresented voice in thermal comfort to develop insights and highlight implications for improving comfort in shared ofce spaces. While being careful not to over-generalise our fndings given our intentionally very specifc set of participants, it is clear that this new perspective takes thermal comfort technology, interfaces, and supporting infrastructures and policy in new directions, accepting the workplace and shared ofce context."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2015380859375,
        "y1": 512.542236328125,
        "y2": 551.614990234375
      },
      "text": "The methodology produced a rich variety and range of data, and all participants engaged fully in each of the workshop tasks. When drawing on the tables, facilitators were provided with a diferent colour pen so their contributions could be identifed."
    }, {
      "page": 4,
      "region": {
        "x1": 317.95343017578125,
        "x2": 558.2034301757812,
        "y1": 556.377197265625,
        "y2": 628.3270263671875
      },
      "text": "Once collected, audio data was transcribed by the researcher and all forms of data were analysed using iterative, inductive coding and distinct themes were identifed. The fve key themes emerging from the workshop were: 1. The specifc and individual comfort needs of this group, 2. Agency and control, 3. Empathy and consideration for others, 4. Improving access to data, and 5. High-tech versus low-tech solutions. These themes are considered in turn below."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 475.1551818847656,
        "y1": 410.51708984375,
        "y2": 417.3680114746094
      },
      "text": "4 RESULTS AND DISCUSSION"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7177734375,
        "y1": 690.1931762695312,
        "y2": 707.3469848632812
      },
      "text": "The design brief sheets asked the women what their specifc thermal comfort needs were, and many of the responses indicated the"
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 546.3805541992188,
        "y1": 662.8881225585938,
        "y2": 682.6881103515625
      },
      "text": "4.1 Specifc and Individual Thermal Comfort Needs"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.464080810546875,
        "x2": 295.5574951171875,
        "y1": 622.3231811523438,
        "y2": 705.2310180664062
      },
      "text": "temperatures were currently too high to be comfortable in the workplace. During the design phase of the workshop, participants were asked to write a problem statement, which the device or system was trying to alleviate. Three people left this blank, so there were ten respondents in total. The most common response from participants was that of being too hot (5 respondents). The second most common issue was lack of control over their environment (4 respondents), and one person also mentioned the importance of fresh air."
    }, {
      "page": 5,
      "region": {
        "x1": 342.364013671875,
        "x2": 535.3081665039062,
        "y1": 87.45320129394531,
        "y2": 115.5670166015625
      },
      "text": "“I am much too hot at work, the ofce temp[erature] is too high all the time sometimes but feel it is a particular problem in the ofce.”"
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7191772460938,
        "y1": 122.76521301269531,
        "y2": 216.63201904296875
      },
      "text": "Hot fushes, and the sensation of the inability to regulate internal temperature are the most common complaint of menopausal women, and these fushes may be accompanied by a range of other symptoms such as sweating, fushing, palpitations, anxiety, irritability and panic [48]. These thermoregulatory changes can negatively impact on women’s daily functioning [33]. Kronenberg and Barnard [34] investigated the efect of ambient temperature on the frequency and intensity of hot fushes and found that lower temperatures can help in making these fushes both shorter and less intense."
    }, {
      "page": 5,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.7157592773438,
        "y1": 221.3952178955078,
        "y2": 271.427001953125
      },
      "text": "Proposed devices such as ‘magic clothes’ or ‘temperaturecontrolled clothing’ were popular, as were systems such as ‘personal pods’ and personal air conditioners. Workshop participants were very conscious that ‘they’ felt diferent, and they framed it as ‘their’ issue and problem (Figure 5)."
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7217407226562,
        "y1": 276.1902160644531,
        "y2": 315.2619934082031
      },
      "text": "Artifacts that did not impact on others such as wearable or bodycontact devices including wrist coolers, seat pads and foot chillers were proposed. This could in part be symptomatic of how openly sensitive issues like menopause can be included in the workplace."
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.1873168945312,
        "y1": 320.0252380371094,
        "y2": 402.9330139160156
      },
      "text": "Although very much present in the thermal comfort standards, one aspect rarely adequately considered in the thermal comfort literature is access to ‘fresh air’, yet this was a common theme with our workshop participants. “Mostly I need (and sufer if there isn’t) fresh air”. This aspect was discussed a number of times during the workshop (Figure 6). Artifacts that did not impact on others such as wearable or body-contact devices including wrist coolers, seat pads and foot chillers were proposed;"
    }, {
      "page": 5,
      "region": {
        "x1": 342.364013671875,
        "x2": 535.3108520507812,
        "y1": 410.1322326660156,
        "y2": 462.5989990234375
      },
      "text": "“When I went through menopause I had a big hot fushes and things like that and I was fortunate I didn’t have it really really bad.” “I just got hotter and then menopause has been unbearable, you know it has been terrible at work.”"
    }, {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2069702148438,
        "y1": 469.7972412109375,
        "y2": 497.9110107421875
      },
      "text": "Other participants discussed the difculties they had had at times through the course of their menopause journey trying to control their temperatures:"
    }, {
      "page": 5,
      "region": {
        "x1": 342.364013671875,
        "x2": 533.7926635742188,
        "y1": 505.1092224121094,
        "y2": 555.1400146484375
      },
      "text": "“I found when I was going to face-to-face meetings there’s nothing worse than sitting there and knowing suddenly your face is sweating, and it happened to me a few times and I just thought I can’t cope with this and ran out of the room”"
    }, {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7124633789062,
        "y1": 562.3392333984375,
        "y2": 623.3289794921875
      },
      "text": "This links to recent research by Tutia et al. on menopause and HCI, which although concerned with more intimate experiences, also noted that participants described a fuctuating loss of control over their bodies [51]. As well as the uncomfortable feelings described above, one of the commonalities across the tables was consideration for the other inhabitants of shared ofces:"
    }, {
      "page": 5,
      "region": {
        "x1": 342.364013671875,
        "x2": 534.0282592773438,
        "y1": 630.5272216796875,
        "y2": 707.3469848632812
      },
      "text": "“The thing for me is bothering others in the ofce and its fnding ways . . . that doesn’t” “I think; can I open the window? and I feel a bit guilty because you’re worried about everybody else.” “We’re trying to respect everybody else in the ofce so you feel you can’t, you don’t want to make too much of a fuss”"
    }, {
      "page": 6,
      "region": {
        "x1": 53.2400016784668,
        "x2": 558.1988525390625,
        "y1": 57.68669509887695,
        "y2": 69.92919921875
      },
      "text": "’We Can Send A Man To The Moon But We Can’t Control The Temperature In Our ofice’; A Considerate Approach To Workplace Thermal Comfort by Older Women CHI ’21, May 08–13, 2021, Yokohama, Japan"
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.564697265625,
        "y1": 551.8441772460938,
        "y2": 579.95703125
      },
      "text": "There was a distinct focus on cooling options, with people wanting a range of devices to help them cool down ideally without impacting others (Figure 6):"
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 558.1990356445312,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan Kathy New et al."
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.48400115966797,
        "x2": 295.5634460449219,
        "y1": 615.709228515625,
        "y2": 676.698974609375
      },
      "text": "All of the women participating in the workshop occupied shared offces, although this had not been specifed as a requirement during recruitment. One of the questions asked during the groups’ discussions was about how workspaces were allocated, and none of the participants had experienced any specifc control or been permitted to exercise choice over where they sat within those spaces."
    }, {
      "page": 6,
      "region": {
        "x1": 78.20700073242188,
        "x2": 269.6412353515625,
        "y1": 690.1931762695312,
        "y2": 707.3469848632812
      },
      "text": "“I’ve never been given a choice of desk, you tend to get put where you’re put”"
    }, {
      "page": 6,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.720458984375,
        "y1": 551.8441772460938,
        "y2": 656.6699829101562
      },
      "text": "Seating is determined by line managers, and even when preferences were expressed, these were not always considered. One participant had specifcally requested a window seat in an ofce she was due to be moving into, for personal thermal comfort reasons relating to her experiences during menopause, but this request had not been met. Consultation on ofces during moves, or during establishment of new teams was something that would have been welcomed, and occasionally took place, but then was ignored. As a consequence of this participants did not feel they had any control over their space, as can be seen from the following exchanges:"
    }, {
      "page": 6,
      "region": {
        "x1": 342.364013671875,
        "x2": 533.791015625,
        "y1": 690.1931762695312,
        "y2": 707.3469848632812
      },
      "text": "“We did have lots of feedback and meetings.” “But did it change?” “No.”"
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 177.61627197265625,
        "y1": 601.3551025390625,
        "y2": 608.2059936523438
      },
      "text": "4.2 Agency and Control"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 77.875,
        "x2": 269.637939453125,
        "y1": 351.4582214355469,
        "y2": 379.5719909667969
      },
      "text": "“I don’t think anybody’s needs are taken into account when you design buildings - you just move in when its ready.”"
    }, {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.03277587890625,
        "y1": 390.6922302246094,
        "y2": 418.80499267578125
      },
      "text": "In terms of a general approach to shared ofce thermal comfort, participants expressed a desire for it to be cooler rather than warmer, as they felt it is easier to adapt in that direction."
    }, {
      "page": 7,
      "region": {
        "x1": 77.875,
        "x2": 269.63568115234375,
        "y1": 429.92523193359375,
        "y2": 447.0790100097656
      },
      "text": "“Personally, I’d like it to be slightly cooler than I’d want it ‘cause at least you can put something on”."
    }, {
      "page": 7,
      "region": {
        "x1": 53.79798889160156,
        "x2": 295.5554504394531,
        "y1": 458.1973571777344,
        "y2": 497.27099609375
      },
      "text": "Menopause is associated with periodic challenges in the ability to regulate body temperature, leading to suggestions that interfaces should allow fner grained control of temperatures to help participants work around these:"
    }, {
      "page": 7,
      "region": {
        "x1": 78.20700073242188,
        "x2": 269.63677978515625,
        "y1": 508.3912658691406,
        "y2": 536.5040283203125
      },
      "text": "“What I’d like to see is an additional bit because during the day you might change. In the morning I’m as hot as anything”."
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.2798767089844,
        "y1": 547.6242065429688,
        "y2": 707.2440185546875
      },
      "text": "Another aspect of agency and control which emerged during the workshop was that of ‘gatekeepers’, a notion previously discussed by Snow et al. [47]. Gatekeepers in this context are typically other inhabitants of the ofce, who may take responsibility for aspects of infrastructure such as windows or radiators normally proximate to them which they regard as ‘theirs’ to control, efectively removing control from others. Building managers and other specialists may also see it as their role to control the thermal environment for building users, and this is common on large campuses and tenanted ofce buildings. As mentioned previously, some of the issues and symptoms experienced during diferent stages of menopause can include a lack of confdence, and invisibility. These are factors that can exacerbate the gatekeeper efect. Participants spoke of barriers to achieving thermal comfort with regards to their position in an ofce:"
    }, {
      "page": 7,
      "region": {
        "x1": 342.0320129394531,
        "x2": 534.7803344726562,
        "y1": 351.4582214355469,
        "y2": 379.5719909667969
      },
      "text": "“I’ve got someone between me and the window, and it’s not that he’s guarding it you know there is that, well I’ve got to take him into account as well”"
    }, {
      "page": 7,
      "region": {
        "x1": 342.36376953125,
        "x2": 507.157470703125,
        "y1": 388.8880920410156,
        "y2": 395.0838623046875
      },
      "text": "“If I was next to it I might open it a bit more”"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7157592773438,
        "y1": 404.40423583984375,
        "y2": 454.4360046386719
      },
      "text": "There was also discussion highlighting the role of people outside of the ofce inhabitants controlling thermal comfort remotely through a set of ‘rules’. This links to work by Goulden and Spence [24] highlighting the role of diferent organizational actors and their contradictory rationales in building use and management:"
    }, {
      "page": 7,
      "region": {
        "x1": 342.364013671875,
        "x2": 533.7940063476562,
        "y1": 463.7542419433594,
        "y2": 491.86700439453125
      },
      "text": "“We’ve got air-conditioning so we’re not allowed to open the doors or windows . . . if we do that we get told of.”"
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2071533203125,
        "y1": 501.18524169921875,
        "y2": 529.2990112304688
      },
      "text": "In terms of personal control over people’s appearance, this was also an issue that impacted on participants’ thermal comfort and ability to adapt, as exemplifed by these participants:"
    }, {
      "page": 7,
      "region": {
        "x1": 342.364013671875,
        "x2": 534.0296020507812,
        "y1": 538.6171875,
        "y2": 566.7310180664062
      },
      "text": "“I have to go to a lot of meetings outside University so I have to have a certain dress code and it’s quite hard at times”;"
    }, {
      "page": 7,
      "region": {
        "x1": 342.364013671875,
        "x2": 534.0283813476562,
        "y1": 576.0491943359375,
        "y2": 593.2030029296875
      },
      "text": "“I feel a certain requirement on me to be professionally presented and it’s not always easy”"
    }, {
      "page": 7,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7158203125,
        "y1": 602.5211791992188,
        "y2": 707.3469848632812
      },
      "text": "The socio-cultural constraints of appropriate dress is a wellknown issue in workplace culture [46], and our fndings would certainly point to revisiting dress codes and the use of layers as part of a more fexible and adaptive clothing policy in the workplace. In the UK we are used to a narrow, static band of indoor temperature, with many workplaces being set to run at around 21oC, but in practice often exceeding this. In contrast in Japan to address rising summer temperatures and a need to cool using less energy, a scheme called ‘cool biz’ has seen Government building expand this range by not cooling buildings below 28oC. This has occurred in parallel"
    }, {
      "page": 8,
      "region": {
        "x1": 53.2400016784668,
        "x2": 392.096923828125,
        "y1": 57.68669509887695,
        "y2": 69.92919921875
      },
      "text": "’We Can Send A Man To The Moon But We Can’t Control The Temperature In Our ofice’; A Considerate Approach To Workplace Thermal Comfort by Older Women"
    }, {
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.04901123046875,
        "y1": 87.45320129394531,
        "y2": 104.60797119140625
      },
      "text": "with the modifcation of conventions and practices of clothing, and has successfully led to a reduction in energy demand."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 558.1990356445312,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan Kathy New et al."
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.28082275390625,
        "y1": 138.3701934814453,
        "y2": 265.114013671875
      },
      "text": "In direct contrast to traditional discussions of workplace thermal comfort which often frame the narrative as a site of confict or thermostat war [40], a strong theme to emerge from the workshop was that of empathy and the needs of others. One of the things the participants were very keen to know was the consensus in the room, to address the underlying feeling that feeling thermally uncomfortable was their problem; and they didn’t want everyone to be sufering just because of them (for example, one woman discussed not wanting to remove her shoes because she didn’t want to upset anyone). Participants in the design workshop were very conscious of the impact that meeting their thermal comfort needs might have on others:"
    }, {
      "page": 8,
      "region": {
        "x1": 77.875,
        "x2": 269.8094482421875,
        "y1": 276.6932373046875,
        "y2": 315.7659912109375
      },
      "text": "“I don’t want to impact (much) on others” and “one of the things about being hot or cold is how other people react to you being hot or cold and you don’t want to upset them”."
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5646667480469,
        "y1": 327.34521484375,
        "y2": 377.3760070800781
      },
      "text": "As an example of this, during the design brief stage at the beginning of the workshop, when asked what they wanted the system or device to do, a participant wanted it to diagnose if her comfort sensations were due to the room or her personal state, and to ‘think about others comfort too’:"
    }, {
      "page": 8,
      "region": {
        "x1": 78.20698547363281,
        "x2": 269.8734130859375,
        "y1": 388.9552307128906,
        "y2": 449.9460144042969
      },
      "text": "“You’re able to see what the consensus is, so it’s not just you, or it is just you. So, you can see that everyone else in the room is colder than me, so I’ve just got to sort myself out, cos my colleagues are fne. I think that’s quite useful to be able to see where you sit in the room.”"
    }, {
      "page": 8,
      "region": {
        "x1": 53.796417236328125,
        "x2": 295.564697265625,
        "y1": 461.5252380371094,
        "y2": 500.5979919433594
      },
      "text": "Suggestions to encourage more environmentally conscious adaptive behaviour arose during the workshop. One participant designed an app for controlling thermal comfort that was linked to a reward system:"
    }, {
      "page": 8,
      "region": {
        "x1": 77.87307739257812,
        "x2": 269.8097229003906,
        "y1": 512.1771850585938,
        "y2": 606.0440063476562
      },
      "text": "“So, say for example get cool or get warm, and under that are diferent options of ways you can get cool or get warm and the best bit is that each one has a points value, and you get reward points depending on what you chose, so if you chose to put on a radiator or an extra heater you get well actually you should get negative points for that, well the lowest level of points let’s say. If you’re putting on a cardie [cardigan] or some layers, you get more points.”"
    }, {
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.0437316894531,
        "y1": 617.6231689453125,
        "y2": 645.7369995117188
      },
      "text": "This was considered to be a ‘carrot’ approach by rewarding people for positive behavior change. A contrasting approach that was also raised was more punitive (‘stick’):"
    }, {
      "page": 8,
      "region": {
        "x1": 77.875,
        "x2": 269.6356506347656,
        "y1": 657.316162109375,
        "y2": 707.3469848632812
      },
      "text": "‘I used the stick rather than the carrot in that you would have a dashboard instead of the points which is a nicer way to do it and mine would show you the environmental impact or the fnancial cost of turning the radiator up or what-have-you.’"
    }, {
      "page": 8,
      "region": {
        "x1": 432.1289978027344,
        "x2": 558.2012939453125,
        "y1": 65.87968444824219,
        "y2": 69.927978515625
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan"
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 244.92544555664062,
        "y1": 124.0170669555664,
        "y2": 130.86798095703125
      },
      "text": "4.3 Empathy and the Needs of Others"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7191772460938,
        "y1": 114.10322570800781,
        "y2": 175.093017578125
      },
      "text": "There were distinct diferences between some of the complex technical designs involving ecosystems of automated systems, apps, robots, sensors or a combination of these, and more quotidian lowtech devices such as water sprays and jumpers (also known as sweaters, jerseys or pullovers). The lowest-tech suggestion was simply a sketch of a jumper with the caption “Just a jumper”!"
    }, {
      "page": 8,
      "region": {
        "x1": 317.6409912109375,
        "x2": 559.7185668945312,
        "y1": 179.85621643066406,
        "y2": 284.6820068359375
      },
      "text": "AI was introduced to a number of designs and was envisioned to be usefully deployed by systems in order to learn your personal thermal preferences. An autonomous roving sensor unit was even suggested that roves the ofce mapping the thermal environment. This would then provide feedback on where to position yourself to be most comfortable at diferent times of the day. Using AI to learn about and give advice on clothing choices was also suggested. An example of a high-tech design idea showing responsive selftinting windows, adaptive lighting and heating/cooling walls all automatically controlled by AI is shown in Figure 7"
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.713623046875,
        "y1": 289.4452209472656,
        "y2": 350.4360046386719
      },
      "text": "Cooling devices were particularly prevalent, but some designs extended beyond the individual to the furniture, and wider infrastructure such as walls and windows. This included a wall that could either heat or cool; an automatic tinting window to prevent overheating due to the sun. There were several personal air conditioning devices that could fexibly be either hot or cold."
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7147216796875,
        "y1": 355.19921875,
        "y2": 405.2300109863281
      },
      "text": "Another common focus was on improving data and information about ofce conditions in order to support workplace thermal comfort. As an example, during the design brief stage, a participant responded to the question ‘What would you like the system/device to do?’"
    }, {
      "page": 8,
      "region": {
        "x1": 333.92413330078125,
        "x2": 507.119384765625,
        "y1": 411.6858215332031,
        "y2": 451.1379699707031
      },
      "text": "• Tell me room temperature before I arrive. • Tell me my temperature • Ask how warm I’m feeling • Record these over time and predict my needs"
    }, {
      "page": 8,
      "region": {
        "x1": 317.6826477050781,
        "x2": 559.7138061523438,
        "y1": 457.980224609375,
        "y2": 584.7239990234375
      },
      "text": "A number of participants wanted to understand the ofce temperature before leaving home, so they could prepare before arriving (Figure 8). This links back to the discussion in section 4.2 on agency and control. Providing ofce inhabitants with more information on conditions in the workplace before setting of from home would enable them to prepare accordingly in terms of appropriate dress. By providing data on diferent rooms or areas of the ofce once at work, this would also enable them to make further informed choices about where to sit at diferent times of the day to be more comfortable. These desires for agency and control are at odds with the lived experiences the participants described in terms of clothing conventions and desk allocation."
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2056274414062,
        "y1": 589.4871826171875,
        "y2": 617.6010131835938
      },
      "text": "One method of delivering this improved data to better inform choices was a robot, which occurred in several of the sketches and discussions."
    }, {
      "page": 8,
      "region": {
        "x1": 342.0320129394531,
        "x2": 535.3073120117188,
        "y1": 624.439208984375,
        "y2": 707.3469848632812
      },
      "text": "“There’s a robot at work and in the morning it sends a message to your phone and it says this is the temperature at work today so this is how you need to dress. But it does other things as well so when you get to work it will have sussed out the best place for you to sit as well based on your temperature so it will say go and sit over there ‘cause that’s that temperature today.”"
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 531.893310546875,
        "y1": 86.7980728149414,
        "y2": 106.59808349609375
      },
      "text": "4.4 Improved Data And Hi Tech/Low Tech Options"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 533.7950439453125,
        "y1": 639.6171875,
        "y2": 656.77197265625
      },
      "text": "The ‘robot’ device was also designed to share information to be. Also you can make it into a bit of a portal and support other people’s thermal comfort: an online forum . . . put ideas down there as well so"
    }, {
      "page": 9,
      "region": {
        "x1": 78.20700073242188,
        "x2": 533.793701171875,
        "y1": 661.5352172851562,
        "y2": 707.3469848632812
      },
      "text": "other people can have a look and see oh well that “It also gives you lots of other ideas because it’s might work for me or what things have worked and always Googling and looking for good ideas about what haven’t so using it as a real portal for collecting temperature control and it will be looking for new information and continuously improving” ideas and telling you what those new ideas might"
    }, {
      "page": 10,
      "region": {
        "x1": 53.2400016784668,
        "x2": 558.1988525390625,
        "y1": 57.68669509887695,
        "y2": 69.92919921875
      },
      "text": "’We Can Send A Man To The Moon But We Can’t Control The Temperature In Our ofice’; A Considerate Approach To Workplace Thermal Comfort by Older Women CHI ’21, May 08–13, 2021, Yokohama, Japan"
    }, {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.0374450683594,
        "y1": 360.67022705078125,
        "y2": 421.6610107421875
      },
      "text": "Another version of this was the ‘Yorkshire’ inspired app ‘Ot or Not’ shown in Figure 9. This works on a similar principle of providing data on conditions in the ofce before leaving home, enabling the inhabitant to prepare accordingly, resulting in the inhabitant being ‘’opefully ‘appy’. Again, fun and humour were evident throughout the workshop."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 558.1990356445312,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan Kathy New et al."
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.106201171875,
        "y1": 466.15423583984375,
        "y2": 505.22601318359375
      },
      "text": "In this section we draw on our fndings from the workshop to outline the potential applications of the work in three main areas: technology and interface design, buildings and workplace practices, and policy implications."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 272.3291015625,
        "y1": 438.8490905761719,
        "y2": 458.64910888671875
      },
      "text": "5 HCI DESIGN, POLICIES AND THERMAL COMFORT"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 53.4656982421875,
        "x2": 295.4273986816406,
        "y1": 536.7681884765625,
        "y2": 641.593994140625
      },
      "text": "As is common in many UK ofces, our participants found their workplaces were frequently overheated, with little in the way of specifc control over where to sit in the thermal landscape, and no access to mechanisms for making themselves more comfortable. This was particularly visible to our specifc set of participants, as a set of inhabitants dealing with hot fushes and variations in thermal comfort needs that were themselves difcult to control. Yet our participants were also not empowered to take agency and control over their thermal environment, nor raise these issues within the organisation."
    }, {
      "page": 10,
      "region": {
        "x1": 53.368133544921875,
        "x2": 295.561279296875,
        "y1": 646.357177734375,
        "y2": 707.3469848632812
      },
      "text": "The majority of design sketches from our participants were for devices or systems focused on personal solutions that would support comfort within shared ofce spaces in an unobtrusive way. While the workshop utilized an almost autobiographical design process, with participants designing devices and systems for themselves to meet their own needs, there was a focus on making the"
    }, {
      "page": 10,
      "region": {
        "x1": 317.9532470703125,
        "x2": 559.71240234375,
        "y1": 360.6701354980469,
        "y2": 410.7019958496094
      },
      "text": "artefacts accessible to a range of users, through questions on the design brief. This approach links to that of somesthetic design [29] in terms of raising awareness of bodily sensations (here, with regard to thermal comfort), and in some cases, participants designed devices to ‘tell me how I’m feeling’."
    }, {
      "page": 10,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.71435546875,
        "y1": 415.4652404785156,
        "y2": 575.0859985351562
      },
      "text": "Our participants certainly perceived themselves as having very localized needs for heating or cooling. Perhaps in contrast to established approaches, and as pointed out by Clear et al. [15], provision of thermal comfort to all at a given setpoint temperature (‘collective comfort’), while enshrined in standards and control systems, is unlikely to satisfy everyone. Rather than collective comfort, we see opportunities to design highly localised heating and cooling solutions, or the deliberate creation of opportunities for alliesthesia (thermal delight) through intentional temperature variations, as being important for providing resources to achieve comfort. Beyond HCI, this aligns with established energy savings approaches based on low baseline temperatures with supplementary targeted heating and or cooling [52]. Interfaces and control systems should acknowledge and account for the fact that sensations change over the day, and this may vary considerably for diferent building users."
    }, {
      "page": 10,
      "region": {
        "x1": 317.6210632324219,
        "x2": 558.5369873046875,
        "y1": 579.84716796875,
        "y2": 706.5919799804688
      },
      "text": "While our participants clearly felt and took ownership over their own thermal comfort, they were concerned that they were unable to currently determine to what extent, it really was ‘them’, i.e. how they were perceiving the environment, versus how the environment was perceived by others. This suggested that they valued interfaces that would help them explore to what extent their choices were representative or would impact the others in the ofce. Making visible the room temperature, stufness or shared consequences of actions such as turning the radiator on was seen as important to governing or enabling their actions. Participants liked the simplicity and understandability of the Comfyapp interface prompt, not just the friendliness of the language used – they found the options"
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 241.39088439941406,
        "y1": 522.4141235351562,
        "y2": 529.2650146484375
      },
      "text": "5.1 Technology and Interface Design"
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 53.08100128173828,
        "x2": 295.4292907714844,
        "y1": 87.45320129394531,
        "y2": 148.4429931640625
      },
      "text": "‘warm me up’, ‘cool me down’ or ‘I’m comfy’ particularly appealing. They also liked the attempt in this interface to refect the balance between their selections and other peoples’. Instead of showing the consensus in the room, interfaces could also show ‘the outliers’, indicating when there is real unhappiness with regard to shared temperature, which may also impact on individual’s actions."
    }, {
      "page": 11,
      "region": {
        "x1": 53.08100128173828,
        "x2": 295.5612487792969,
        "y1": 153.20619201660156,
        "y2": 301.8680114746094
      },
      "text": "Clothing choice was seen as important, not least as it is more socially acceptable especially in the work setting to ‘layer up’ than ‘layer down’. This linked to design suggestions that would allow better fore-knowledge on how the ofce will feel, in advance of being there. There is an opportunity here for systems that help improve the thermal comfort literacy by exposing data both to inform the users of the space, but also to ofer opportunities for dialogue with other actors such as line managers, building and estates managers. Understanding the thermal landscape, and specifcally how this can change throughout the space, during the day and over the seasons can help advise people where to sit, and potentially enable new and more dynamic working practices based on comfort and in response to the changing weather and a broader and ever more dynamic climate."
    }, {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2169189453125,
        "y1": 306.6312255859375,
        "y2": 400.49798583984375
      },
      "text": "Being able to cool down is clearly a challenge in our setting, and perhaps especially for our participants, which could explain the abundance of personal cooling device ideas. Fresh air is important to a healthy workplace, and this has even has gained a renewed importance at the moment as we work to create more air fow and safer working environments during the pandemic. While fresh air is part of a broader consideration about ‘how buildings work’ and are used, we can explore technological designs for better mapping this thermal landscape, and its air fow."
    }, {
      "page": 11,
      "region": {
        "x1": 53.79798889160156,
        "x2": 295.0067138671875,
        "y1": 405.26123046875,
        "y2": 466.24993896484375
      },
      "text": "Tomlinson [49] suggests that HCI tools and techniques have both exacerbated and ameliorated the human tendency to ignore the sufering of others. As noted above, he suggests sufering-centered design which expands the focus of the system beyond the ‘user’ towards the other people (and in his paper, non-humans) who are afected by it."
    }, {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04974365234375,
        "y1": 471.01422119140625,
        "y2": 564.8820190429688
      },
      "text": "This raised questions about how we can incorporate a sense of empathy into user interfaces and designs that control space temperature that impact a range of space users, and not just those interacting with the system. We might even consider addressing how an increase in heat on one foor has a knock-on impact on those on the foors above. Could we design an interface that provides data and feedback for participants on the consequences of their act of turning a radiator on, on other users in the building? And if we did, would that reduce some of the overheating?"
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 558.1990356445312,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan Kathy New et al."
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 53.57400131225586,
        "x2": 294.2745666503906,
        "y1": 602.5211791992188,
        "y2": 707.3469848632812
      },
      "text": "Real opportunities for consultation and co-design which inform and infuence building construction are rare. As we have seen from the literature, older women are routinely absent from the data which informs the standards buildings are intended to adhere to. Our study revealed some of the experiences and concerns from the hitherto silent voices of older women in relation to thermal comfort. These voices emphasize how silence and powerlessness go hand in hand and highlight the lack of an inclusive design approach which sought to understand their needs or develop structures and practices to meet those needs."
    }, {
      "page": 11,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.2034301757812,
        "y1": 87.45320129394531,
        "y2": 159.4019775390625
      },
      "text": "We are an ageing population, with fewer new entrants from education joining the workforce. The workforce is also aging, and organisations need to look after their ‘older’ workers [11]. Ofce design and environmental control systems need to engage with older workers, and ensure they are part of the discussion when designing and developing workplace systems, to ensure they are ft for purpose."
    }, {
      "page": 11,
      "region": {
        "x1": 317.9549560546875,
        "x2": 558.20703125,
        "y1": 164.1652374267578,
        "y2": 247.072998046875
      },
      "text": "One of the key learnings to emerge from the workshop was the desire for fresh air in an ofce, and personal control of the space. Windows were highly desired and seen as the best way of providing this. While individual control is acknowledged as difcult in shared spaces, Covid-19 measures have included the introduction of Perspex screens in many shared spaces, single person spaces, and increased need for ventilation. Thus, we may see some unexpected benefts for many shared ofce inhabitants."
    }, {
      "page": 11,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.71240234375,
        "y1": 251.83619689941406,
        "y2": 356.6629943847656
      },
      "text": "In terms of control, the women in the study had no control over their location within shared ofces, and even when they were specifcally asked about their preferences, these were ignored. Line managers were responsible for allocating desks. This relationship is under-researched in the literature, which focusses on the role of energy and facilities managers as the controlling stakeholders, rather than more local management relationships. We see significant opportunities to design systems that help support a more inclusive dialogue on the use of space, and on workplace practices around thermal comfort needs."
    }, {
      "page": 11,
      "region": {
        "x1": 317.62579345703125,
        "x2": 559.7217407226562,
        "y1": 361.42523193359375,
        "y2": 521.0460205078125
      },
      "text": "The term ‘hot desking’ is widely accepted as a practice of allocating desks to workers as required or on a rotation, rather than giving each worker their own desk. This may become more prevalent in a post-Covid-19 world as working practices change; people are working from home more frequently and visiting the ofce less. However, the concept of ‘cool desking’, i.e. intentionally providing cooler spaces for people with diferent thermal comfort needs could also be explored. Beyond this, these needs of inhabitants are rarely incorporated in regard to retroftting buildings. It is especially common to address building thermal performance issues by insulation, often without fully considering how this changes the working environment. Higher specifcations may even reduce or even remove the ability to open windows. We should be developing tools to enable designers and those commissioning building improvements to understand the lived experiences in the environments they create."
    }, {
      "page": 11,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.71826171875,
        "y1": 525.8092041015625,
        "y2": 630.635009765625
      },
      "text": "Gendered ageism in the workplace can occur at many stages of career development. Beck et al. [4] note the lack of literature on menopause and work and describe the menopause taboo as a function of gendered ageism in Western work contexts, and elsewhere. This study has specifcally focused on thermal comfort concerns for older working women, highlighting some of the temperature fuctuations experienced during diferent stages of menopause, and imagining how these could be better managed in the workplace. The work also serves to increase older women’s visibility and voice within the design of thermal comfort systems."
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 250.20542907714844,
        "y1": 588.1680908203125,
        "y2": 595.0189819335938
      },
      "text": "5.2 Buildings and Workplace Practices"
    }
  }, {
    "paragraphs": [{
      "page": 11,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.5806274414062,
        "y1": 679.2341918945312,
        "y2": 707.3438720703125
      },
      "text": "The research highlights several opportunities for HCI in terms of engaging with policies to ensure women’s voices are heard. Menopause policies in UK Higher Education Institutions (HEIs)"
    }, {
      "page": 12,
      "region": {
        "x1": 53.2400016784668,
        "x2": 392.096923828125,
        "y1": 57.68669509887695,
        "y2": 69.92919921875
      },
      "text": "’We Can Send A Man To The Moon But We Can’t Control The Temperature In Our ofice’; A Considerate Approach To Workplace Thermal Comfort by Older Women"
    }, {
      "page": 12,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.5595397949219,
        "y1": 87.45320129394531,
        "y2": 268.99102783203125
      },
      "text": "are a relatively new phenomenon, with the University of Leicester being the frst to launch a workplace menopause policy in 2017 [36]. To date, there are still few policies on menopause within UK HEIs and currently no policy in place at Lancaster University. It is therefore likely that awareness of the specifc needs of women during this time is not widespread throughout HEIs, and further, there is currently little agency for women to make the necessary adjustments to their working environment in order to be comfortable at work. Introducing such a policy, coupled with appropriate training for managers could improve working conditions and comfort levels for a considerable number of staf. Consideration of menopause within gender equality charters such as Athena Swan2, would also raise awareness of this as an issue, and further ensure that this is given attention across a wider research and development agenda. More broadly, space allocation and ofce management policies which consider individual needs including menopausal factors would be benefcial for this demographic, and the wider workforce."
    }, {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0455627441406,
        "y1": 273.7542419433594,
        "y2": 323.7860107421875
      },
      "text": "Policies around thermal comfort are evolving, and in 2014, Public Health England (PHE) revised its recommendations for minimum temperatures in homes, down from 21{°}C in living rooms to 18{°}C in all rooms, stating that this had minimal risk to the health of ‘a sedentary person wearing suitable clothing’ (Gov.UK, 2014)."
    }, {
      "page": 12,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5574951171875,
        "y1": 328.5492248535156,
        "y2": 542.9639892578125
      },
      "text": "From a systematic review by Jevons et al. [30] of literature on minimum indoor temperatures in the UK and countries with similar climates ‘A threshold of 18{°}C was considered the evidence based and practical minimum temperature at which a home should be kept during winter in England’ [26]. While this lower temperature recommendations are for the home environment, it could be argued that there is no rationale for excluding ofces, but as yet, in the UK this policy evolution has not been mirrored in the workplace. In terms of a general approach to shared ofce thermal comfort, workshop participants expressed a desire for it to be cooler rather than warmer, as they felt it easier to adapt in that direction. We see opportunities for technologists in contributing the creation of inclusive systems that meet the needs of a diverse population, amplifying unheard voices. By avoiding framing menopause and thermal comfort issues as a problem for women, and instead exploring how the HCI community can design for the menopausal experience, we could establish more inclusive and evidence-driven policy and designs, empowering both building users and enabling the ongoing disclosure, monitoring and negotiation of thermal comfort in workplace environments."
    }],
    "title": {
      "page": 11,
      "region": {
        "x1": 317.9549865722656,
        "x2": 554.2243041992188,
        "y1": 651.9291381835938,
        "y2": 671.7291259765625
      },
      "text": "5.3 Opportunities for HCI to Engage With The Broader Policy Landscape"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 53.52899932861328,
        "x2": 294.2134094238281,
        "y1": 574.3582153320312,
        "y2": 668.2249755859375
      },
      "text": "This paper brings the underrepresented voices of older women to the thermal comfort discourse. It helps to shift the narrative from one of confict framed as ‘thermostat wars’ and expands debate from concepts focusing on ‘evenly spreading discomfort’ [45] to a broader view of users, considering not just on the individual but the other room inhabitants and building inhabitants. Our workshop provided a friendly, engaging space for participants to share their experiences discussing an otherwise largely sidelined and sensitive topic in the workplace."
    }, {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 283.5234680175781,
        "y1": 691.8746948242188,
        "y2": 707.3469848632812
      },
      "text": "2https://www.advance-he.ac.uk/news-and-views/infographic-story-of-athenaswan, accessed 17th September 2020."
    }, {
      "page": 12,
      "region": {
        "x1": 432.13055419921875,
        "x2": 558.2028198242188,
        "y1": 65.87937927246094,
        "y2": 69.92767333984375
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan"
    }, {
      "page": 12,
      "region": {
        "x1": 317.2380065917969,
        "x2": 559.7144165039062,
        "y1": 87.45320129394531,
        "y2": 225.156005859375
      },
      "text": "Our research identifed valuable insights for the HCI community and designers of thermal comfort technology by highlighting the importance of proactively providing data on ofce conditions in advance, as a signifcant driver of adaptive behavior. By considering how to make this data available to ofce inhabitants while at home, heating and cooling system designers could be supporting an adaptive approach to thermal comfort and encouraging energy saving. In addition, it was felt that generally reducing ofce temperatures would be benefcial both in terms of comfort, and energy saving. ‘Empathetic’ technology that enabled participants to ‘read the room’ and gauge their thermal comfort levels in relation to others was considered highly benefcial and an important addition to thermal comfort user interfaces."
    }, {
      "page": 12,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.5844116210938,
        "y1": 229.91920471191406,
        "y2": 323.7860107421875
      },
      "text": "With the arrival of Covid-19, the prevalence of shared ofce spaces at the time of writing has dramatically reduced, with a vast increase in people working from home. The future of shared ofces, and the impact of the virus on the way we design, occupy and control our workspaces is suddenly very much in question. With this uncertainty comes the potential to reconceptualize our workspaces with a focus on a sustainable empathic and considerate future, if the designers invite a broad range of people to the design table and rise to the challenge. As one participant put it:"
    }, {
      "page": 12,
      "region": {
        "x1": 342.0320129394531,
        "x2": 533.7903442382812,
        "y1": 333.40423583984375,
        "y2": 350.5589904785156
      },
      "text": "“It seems to me we can send a man to the moon but we can’t control the temperature in our ofce”."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 147.07080078125,
        "y1": 560.0040893554688,
        "y2": 566.85498046875
      },
      "text": "6 CONCLUSIONS"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.71484375,
        "y1": 382.28424072265625,
        "y2": 465.1919860839844
      },
      "text": "The authors would like to acknowledge the ERDF Grant ‘Low Carbon Lancashire Innovation Hub (LoCaL-i)’, 19R16P01012) which enabled this work to take place, and the fantastic support from our industry partner, Hardy and Ellis Inventions Ltd., in particular Carl Ellis. We would also like to thank Kelly Widdicks and Christina Bremer who volunteered to assist with facilitating the workshop, and Martin Wain, Robin and Holly Watkins-New for their help in sourcing stimulus images."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 317.9549865722656,
        "x2": 435.5114440917969,
        "y1": 367.9300842285156,
        "y2": 374.781005859375
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 321.197998046875,
        "x2": 558.19970703125,
        "y1": 495.30609130859375,
        "y2": 500.125
      },
      "text": "[1] Sara Arber and Jay Ginn. 1991. The Invisibility of Age: Gender and Class in"
    }, {
      "page": 12,
      "region": {
        "x1": 321.197998046875,
        "x2": 559.3807373046875,
        "y1": 503.2760925292969,
        "y2": 707.3469848632812
      },
      "text": "Later Life. Sociol. Rev. 39, 2 (May 1991), 260–291. https://doi.org/10.1111/j.1467954X.1991.tb02981.x [2] ASHRAE. 1992. ANSI/ASHRAE Standard 55-1992, Thermal environmental conditions for human occupancy. Atlanta: American Society of Heating, Refrigerating and Air-Conditioning Engineers, Inc. [3] Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Chi’10, 1301–1310. https://doi.org/10.1145/1753326.1753521 [4] Vanessa Beck, Jo Brewis, & Andrea Davies, 2018. The post-re/productive: Researching the menopause. Journal of Organizational Ethnography, 7(3), 247-262 [5] Cynthia L. Bennett and Daniela K. Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the \"Other\". In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). Association for Computing Machinery, New York, NY, USA, Paper 298, 1–13. DOI: https://doi.org/10.1145/ 3290605.3300528 [6] Tessa Berg, 2015, Rich Picture: The Role of the Facilitator. Syst Pract Action Res 28, 67–77 https://doi-org.ezproxy.lancs.ac.uk/10.1007/s11213-014-9318-z [7] Mark Blythe, Derek Foster, Shaun Lawson, Conor Linehan and Jamie Wardman. 2012. “Watts in it for me?” Design implications for implementing efective energy interventions in organisations. In Conference on Human Factors in Computing Systems - Proceedings, 2357–2366. https://doi.org/10.1145/2207676.2208396 [8] Jaime Bochantin (2014) “Long Live the Mensi-Mob”: Communicating Support Online With Regards to Experiencing Menopause in the Workplace, Communication Studies, 65:3, 260-280, DOI: 10.1080/10510974.2013.811433 [9] British Standards Institution, (2017). BS EN 12831-1:2017: Energy Performance of Buildings. Method for calculation of the design heat load. Space heating load, Module M3-3."
    }, {
      "page": 13,
      "region": {
        "x1": 53.79800033569336,
        "x2": 179.87039184570312,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 08–13, 2021, Yokohama, Japan"
    }, {
      "page": 13,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.22723388671875,
        "y1": 88.83009338378906,
        "y2": 691.406982421875
      },
      "text": "[10] Alison Browne. 2016. Can people talk together about their practices? Focus groups, humour and the sensitive dynamics of everyday life. Area 48, 2,198–205. https://doi.org/10.1111/area.12250 [11] Ronald J. Burke, Cary. L. Cooper and Alexander-Stamatios Antoniou, 2015. The Multi-generational and aging workforce?: challenges and opportunities. Edward Elgar Publishing, Cheltenham, UK. [12] CIBSE. 2015. 1.5.1 Heated, Cooled and Air. In CIBSE Guide A : Environmental Design (8th ed.). CIBSE, 402. [13] Adrian K. Clear, Janine Morley, Mike Hazas, Adrian Friday, and Oliver Bates, Understanding adaptive thermal comfort: new directions for UbiComp. In Proc. of UbiComp (2013), pp. 113–122. [14] Adrian K. Clear, Rob Comber, Sam Finnigan and Patrick Olivier. 2017. “I’d Want to Burn the Data or at Least Nobble the Numbers.” (2017), 2448–2461. https: //doi.org/10.1145/2998181.2998188 [15] Adrian K. Clear, Samantha Mitchell Finnigan, Patrick Olivier and Rob Comber (2018) ThermoKiosk: Investigating Roles for Digital Surveys of Thermal Experience in Workplace Comfort Management. In: CHI 2018 - 2018 ACM Conference on Human Factors in Computing Systems, 21st - 26th April 2018, Montreal, Canada. [16] Kenneth J. Collins, Arthur N. Exton-Smith and Caroline Doré 1981. Urban hypothermia: preferred temperature and thermal perception in old age. Br. Med. J. (Clin. Res. Ed). 282, 6259 (January 1981), 175–177. https://doi.org/10.1136/bmj. 282.6259.175 [17] Paul Coulton, Jonny Huck, Andrew Hudson-Smith, Ralph Barthel, Panagiotis Mavros, Jennifer Roberts, and Philip Powell. 2014. Designing interactive systems to encourage empathy between users. In Proceedings of the 2014 companion publication on Designing interactive systems (DIS Companion ’14). Association for Computing Machinery, New York, NY, USA, 13–16. DOI: https://doi.org/10. 1145/2598784.2602770 [18] Caroline Criado-Perez. 2019. Invisible Women: Data Bias in a World Designed for Men. Abrams Press, New York, USA. [19] Julie S. Dare. 2011. Transitions in Midlife Women’s Lives: Contemporary Experiences. Health Care Women Int. 32, 2 (January 2011), 111–133. https://doi.org/10. 1080/07399332.2010.500753 [20] David Degroot and Larry Kenney. 2007. Impaired defense of core temperature in aged humans during mild cold stress. Am. J. Physiol. Regul. Integr. Comp. Physiol. 292, 1 (January 2007), R103-8. https://doi.org/10.1152/ajpregu.00074.2006 [21] Emma Dewberry and Chris Sherwin. 2002. Visioning Sustainability through Design. Greener Manag. Int. 37 (September 2002), 125–138. Retrieved from http: //www.jstor.org/stable/greemanainte.37.125 [22] Povl O. Fanger. 1972. Thermal comfort: analysis and applications in environmental engineering,. McGraw-Hill, New York. [23] Jane Fulton Suri (2001) The next 50 years: future challenges and opportunities for empathy in our science, Ergonomics, 44:14, 1278-1289, DOI: 10.1080/00140130110105850 [24] Murray Goulden & Alexa Spence, 2015. Caught in the middle: The role of the Facilities Manager in organisational energy use. Energy Policy, 85, 280-287 [25] Nobuko Hashiguchi, Yutaka Tochihara, Tadakatsu Ohnaka, Tamio Otsuki, and Chiaki Tsuchida. 2004. Physiological and subjective responses in the elderly when using foor heating and air conditioning systems. J. Physiol. Anthropol. Appl. Human Sci. 23, 6, 205–213. https://doi.org/10.2114/jpa.23.205 [26] Rachel Hess, Rebecca C. Thurston, Ron D. Hays, Chung-Chou H. Chang, Stacey N. Dillon, Roberta B. Ness, Cindy L. Bryce, Wishwa N. Kapoor, and Karen A. Matthews . 2012. The impact of menopause on health-related quality of life: results from the STRIDE longitudinal study. Qual. Life Res. 21, 3 (2012), 535–544. DOI: https://doi.org/10.1007/s11136-011-9959-7 [27] Sarah Homewood. 2019. Inaction as a Design Decision: Refections on Not Designing Self-Tracking Tools for Menopause. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, Paper alt17, 1–12. DOI: https://doi.org/10.1145/3290607.3310430 [28] Joost Van Hoof. 2008. Forty years of Fanger’s model of thermal comfort: Comfort for all? Indoor Air 18, 3 (2008), 182–201. https://doi.org/10.1111/j.1600-0668.2007. 00516.x [29] Kristina Höök, Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, and Eva Carin Banka Johnson 2015. Somaesthetic design. Interactions 22, 4 (2015), 26–33. https://doi.org/10.1145/2770888 [30] Rachel Jevons, Catriona Carmichael, A. Crossley and Angie Bone, 2016. Minimum indoor temperature threshold recommendations for English homes in winter – A systematic review, Public Health, Volume 136, Pages 4-12, https://doi.org/10. 1016/j.puhe.2016.02.007 [31] Boris Kingma and Wouter van Marken Lichtenbelt. 2015. Energy consumption in buildings and female thermal demand. Nat. Clim. Chang. 5, 12 (2015), 1054–1056. https://doi.org/10.1038/nclimate2741 [32] Ilpo Koskinen, Katja Battarbee and Tuuli Mattelmäki. 2003. Empathic Design. IT Press, Helsinki, Finland."
    }, {
      "page": 13,
      "region": {
        "x1": 510.2780456542969,
        "x2": 558.2019653320312,
        "y1": 63.30119705200195,
        "y2": 67.3494873046875
      },
      "text": "Kathy New et al."
    }, {
      "page": 13,
      "region": {
        "x1": 317.95458984375,
        "x2": 559.380859375,
        "y1": 88.83009338378906,
        "y2": 689.760986328125
      },
      "text": "[33] Fredi Kronenberg, 1994, Hot fashes: Phenomenology, quality of life, and search for treatment options, Experimental Gerontology, Volume 29, Issues 3–4. https: //doi.org/10.1016/0531-5565(94)90012-4 [34] Fredi Kronenberg, Ruth M. Barnard, 1992. Modulation of menopausal hot fashes by ambient temperature, Journal of Thermal Biology, Volume 17, Issue 1, Pages 43-49, https://doi.org/10.1016/0306-4565(92)90018-B [35] Amanda Lazar, Norman Makoto Su, Jefrey Bardzell, and Shaowen Bardzell. 2019. Parting the Red Sea: Sociotechnical Systems and Lived Experiences of Menopause. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). Association for Computing Machinery, New York, NY, USA, Paper 480, 1–16. DOI: https://doi.org/10.1145/3290605.3300710 [36] Leicester University, 2017, https://www2.le.ac.uk/ofces/press/press-releases/ 2018/august/201clet2019s-say-2018menopause2019-three-times-a-day201d#. [37] Jessica Menold and Kathryn Jablokow 2019. Exploring the efects of cognitive style diversity and self-efcacy beliefs on fnal design attributes in student design teams. Des. Stud. 60, (2019), 71–102. https://doi.org/10.1016/j.destud.2018.08.001 [38] Merriam-Webster. Empathy. Merriam-Webster. Retrieved from https://www. merriam-webster.com/dictionary/Empathy [39] Milan Milenkovic, Ulf Hanebutte, Yonghong Huang, David Prendergast, and Han Pham. 2013. Improving user comfort and ofce energy efciency with POEM (personal ofce energy monitor). In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 1455–1460. DOI: https://doi.org/10.1145/2468356.2468616 [40] Jennie Morton. 2012. The Root Causes of Thermal Comfort. Buildings. Retrieved from https://www.buildings.com/article-details/articleid/13374/title/the-rootcauses-of-thermal-comfort [41] NHS. 2018. Menopause. Retrieved from https://www.nhs.uk/conditions/ menopause [42] Ofce for National Statistics. 2017. How do the jobs men and women do afect the gender pay gap? Retrieved from https://www.ons.gov.uk/ employmentandlabourmarket/peopleinwork/earningsandworkinghours/ articles/howdothejobsmenandwomendoafectthegenderpaygap/2017-10-06 [43] Elspeth Oppermann, Gordon Walker and Matt Brearley. 2020. Assembling a thermal rhythmanalysis: Energetic fows, heat stress and polyrhythmic interactions in the context of climate change. Geoforum 108, October 2018 (2020), 275–285. https://doi.org/10.1016/j.geoforum.2019.09.012 [44] Henk Schellen, Wouter van Marken Lichtenbelt, Marcel Loomans, Jørn Toftum and Marij de Wit 2010. Diferences between young adults and elderly in thermal comfort, productivity, and thermal physiology in response to a moderate temperature drift and a steady-state condition. Indoor Air 20, 4 (2010), 273–283. https://doi.org/10.1111/j.1600-0668.2010.00657.x [45] Eun Jeong Shin, Roberto Yus, Sharad Mehrotra and Nalini Venkatasubramanian. 2017. Exploring fairness in participatory thermal comfort control in smart buildings. In Proceedings of the 4th ACM International Conference on Systems for Energy-Efcient Built Environments, 0–9. https://doi.org/10.1145/3137133. 3137156 [46] Elizabeth Shove (2014) Putting practice into policy: reconfguring questions of consumption and climate change, Contemporary Social Science, 9:4, 415-429, DOI: 10.1080/21582041.2012.692484 [47] Stephen Snow, Anna Soska, Shre Kumar Chatterjee, and m.c. schraefel. 2016. Keep Calm and Carry On: Exploring the Social Determinants of Indoor Environment Quality. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 1476–1482. DOI: https://doi.org/10.1145/2851581. 2892490 [48] Vered Stearns, Lynda Ullmer, Juan F Lopez, Yolanda Smith, Claudine Isaacs, Daniel F Hayes, 2002. Hot fushes, The Lancet, Volume 360, Issue 9348, Pages 1851-1861, https://doi.org/10.1016/S0140-6736(02)11774-0 [49] Bill Tomlinson. 2020. Sufering-centered design. In Conference on Human Factors in Computing Systems - Proceedings, 1–19. https://doi.org/10.1145/3334480. 3381812 [50] Loren Toussaint and Jon Webb. 2005. Gender Diferences in the Relationship Between Empathy and Forgiveness. J. Soc. Psychol. 145, (December 2005), 673– 685. https://doi.org/10.3200/SOCP.145.6.673-686 [51] Agatha Tutia, Kelda Baljon, Lan Vu, and Daniela K. Rosner. 2019. HCI and Menopause: Designing With and Around the Aging Body. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, Paper CS23, 1–8. DOI: https://doi.org/10.1145/3290607.3299066 [52] Michal Veselý, Wim Zeiler, 2014, Personalized conditioning and its impact on thermal comfort and energy performance – A review, Renewable and Sustainable Energy Reviews, Volume 34,Pages 401-408, https://doi.org/10.1016/j.rser.2014.03. 024 [53] Peter Wright and John McCarthy 2008. Empathy and experience in HCI. Conf. Hum. Factors Comput. Syst. - Proc. (2008), 637–646. https://doi.org/10.1145/ 1357054.1357156"
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 317.9549865722656,
        "x2": 387.3695983886719,
        "y1": 482.5640869140625,
        "y2": 489.4150085449219
      },
      "text": "REFERENCES"
    }
  }]
}