{"authors": "Jan Kučera; James Scott; Siân Lindley; Patrick Olivier;  Bedtime", "pub_date": "", "title": "Bedtime Window A Field Study Connecting Bedrooms of Long-Distance Couples Using a Slow Photo-Stream and Shared Real-Time Inking", "abstract": "Figure 1: Final Bedtime Window user interface as deployed in the field study, showing various features of the system: slow photo stream, real-time, disappearing inking on shared surface, light timeline, and adaptive brightness.", "sections": [{"heading": "", "text": "feeling of presence and privacy, and to remove the pressure to communicate. The system also includes a real-time shared inking canvas with disappearing ink, which was found to provide a rich versatile medium allowing for new patterns of communication, live interventions, and collaborative drawing. Learnings from how our system balances privacy and remote connectedness may also have relevance for other domains such as remote healthcare and education.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "INTRODUCTION", "text": "Going to sleep and waking up together is an everyday yet intimate experience for partners living together. According to the 2013 international bedroom poll conducted by the National Sleep Foundation [1], 89% of people in the United Kingdom living with someone sleep together with their significant other on most nights (82% in USA, 85% in Canada, 79% in Mexico, 87% in Germany, 63% in Japan). Sharing of this time and space among partners separated geographically -in a long-distance relationship (LDR) -is, however, limited to voice/video calls and messaging.\nPrevious work showed that people in LDRs commonly used SMS texting for short greetings such as \"Good Morning\" or \"I love you\". In [2], 6 out of 14 participants reported that they would watch their partner fall asleep, or vice versa over Skype or Google Chat, despite having issues with location, stability and overheating of their devices, so there is clearly an opportunity to address these needs of remote couples.\nFurthermore, as highlighted by the Covid-19 pandemic, the need to self-isolate can introduce situations whereby people who normally co-habit may find themselves needing to avoid physical contact with family and loved ones for weeks or even months. This is especially the case for healthcare workers who wish to shield their families from the risk they face, as well as those with particular health concerns. For these groups, the experience of living with loved ones is transformed to one that shares some similarities with those in LDRs.\nWe present the design, implementation and evaluation of the Bedtime Window system, connecting partners in LDR with the aim of enabling them to share bedtime, the time before going to sleep and after waking up, and therefore improving communication and intimacy in long-distance couples.\nThe main contributions of this paper are as follows:\n1. Exploration of bedrooms as an environment for interactive technology. We show that even systems with full-featured display and touch interfaces can become invisible and desirable in bedrooms. 2. The first system for LDR couples that allows them to share bedtime, falling asleep and waking up. We show that partners value spending this time together, and hence identify a gap in the available technology in its ability to facilitate sharing of bedtime between partners. Our system is unique in specifically targeting this scenario. 3. Evaluation of a slow photo-stream as a balance between privacy and remote presence. We show that the qualities of always-on video channels are achievable with a slow photostream. 4. We introduce a collaborative drawing experience in the home environment for everyday communication. Disappearing, shared-layer real-time inking was found to be useful, versatile, and engaging communication channel, that may have many other applications. While this paper is focused on the bedtime scenario, our findings can also have relevance for other domains that could potentially benefit from the interactivity and feeling of connectedness, but also the privacy afforded by Bedtime Window. This includes domains such as remote healthcare, social services, and remote education, subject to further research in those areas.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "RELATED WORK 2.1 Long-Distance Relationships", "text": "Long-distance relationships are fairly common -many individuals were in a LDR at least once (75% in USA in 2017 [3], 54% in Germany in 2014 [4]) and the number is still increasing [5], which is attributable to the continual advancement of travel and communication technologies [6], as well as job market and globalization forces [5]. Despite popular beliefs, partners in LDR can be as satisfied as partners in normal relationships, if properly maintained [7]. Canary & Stafford define relational maintenance behavior as actions and activities used to sustain desired relational definitions and suggest that sharing activities play important role in maintaining relationships [8].\nMany prototypes and designs for relationship maintenance were published in the past, from remote hugging [9,10], touch [11,12] or kisses [13,14], to sharing heart rate [15] or glasses [16,17], from abstract, multimodal interaction [18] to single bit of communication [19,20]. One system that shares some aspects with our work is Pictures' Call by Pujol & Umemuro [21], which takes up to 7 pictures at different times of the day at random intervals, and sends them to the remote system, which is continuously showing a slideshow of up to the last 20 pictures received. Users cannot see when or what pictures they are sending, but they can delete any in the past 2 hours for which the transfer is delayed, and they can also ink on received pictures and send them back.\nThe main difference of our system is in specifically target bedtime sharing, i.e. connecting partners when going to sleep and waking up. Our system also employs a situated interactive display with synchronous shared inking, and a transparent slow photo-stream.\nOutside of academic research, several commercial mobile apps have targeted couples in LDR in the past, including Between, Couple, Twyxt, Couplete and others. These apps were primarily designed for memory curation and relationship organization, offering features like shared calendars and lists, timelines of memories, and dedicated text messaging. In contrast, our system foregrounds ephemerality and \"being together\" through a situated device.", "n_publication_ref": 20, "n_figure_ref": 0}, {"heading": "Always-On Channels", "text": "Always-on or at least always-available media spaces have been studied for decades in the context of work environments and sharing workspaces [22], summarized by Harrison et al. [23]. Pang et al. looked into creating an always-on channel between workspace and personal space [24] and substantial research also went into connecting homes and families, across generations [25][26][27], living apart [28,29]. A good summary of this work can be found in the Connecting Families book [30].\nJudge et al. designed a Family Window to connect part of families living separately [31]. This work was later extended to more than two connected homes through Family Portals [32], and to multiple cameras and/or displays [33]. All these systems are summarized in [34]. The Family Window, offering video and back and forth ink messages is the closest system to ours, albeit targeting a different environment and users.", "n_publication_ref": 13, "n_figure_ref": 0}, {"heading": "Bedrooms", "text": "HCI research in the bedroom environment is still very sparse, although it seems to be getting some traction. Wan prototyped a situated shopping experience from the bedroom [35], and Odom looked at virtual possessions in the context of teen bedrooms in a lab study [36]. Beds themselves have been used as a medium for intimate communication in the past [37,38], with recent focus on pillows [39,40], but these channels always conveyed some secondary information about the partner, a physiological state or their activity. We are not aware of any prior work where partners in the bedroom could communicate directly to each other for prolonged periods of time.", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "Privacy", "text": "According to a survey of private moments in the home by Choe et al., the bedroom is the most frequently mentioned place where people do activities that they don't want to be recorded [41]. Hindus et al. found even a simple presence light based on remote activity to be perceived as a surveillance device that threatened home privacy despite conveying minimal information [42]. However, as Neustaedter et al. stated [43], video use in homes cannot be stopped; we can only identify and try to resolve the related problems.\nPrevious research into always-on video media spaces in homes found the transmission of audio to be more privacy-invasive than audioless video [44]. For video streams, various approaches have been explored to provide some level of privacy to users. This includes image processing filters such as pixelization or blur [45] and mechanical metaphors such as blinds or curtain overlays [31]. However, the usage of these was found to quickly cease with time [31].", "n_publication_ref": 7, "n_figure_ref": 0}, {"heading": "Inking", "text": "Much research has been devoted to ink input in the work environment, especially for document annotation and review, much of which has been summarized in a survey paper by Sutherland et al. [46]. In the home environment, inking has been used for sharing notes in households [42,47] as well as for remote communication [32,48].\nResearch into collaborative drawing focused only on the work environment so far, with the pioneering prototypes of VideoDraw by Tang & Minneman [49,50] and several ClearBoard iterations by Ishii et al. [51][52][53] using the metaphor of 'talking through and drawing on a transparent glass window'. Similar experience were supported by DigitalDesk [54] and PlayTogether [55], where remote drawing was overlaid on paper using a projector. In all these cases, each participant had their own inking layer that no one else could interact with.", "n_publication_ref": 12, "n_figure_ref": 0}, {"heading": "MOTIVATION AND RESEARCH AIMS", "text": "In [2,56], Neustaedter & Greenberg interviewed participants in LDR to understand how they make use of video chat systems to maintain their relationships. The authors argue for designs that support a shared sense of presence between partners as a means of supporting and maintaining LDRs, and suggest that researchers consider other mediums in addition to video to provide a rich experience that allows partners to feel like they are part of each other's life [2]. but However, they also found the video connection to be more challenging to initiate and maintain long-term. Baishya [57] enabled sharing of everyday mundane activities through an audiovisual streaming system. Their users found this valuable, but also found that it unfortunately reduced the number of topics to talk about. These studies raise questions around how one might design communication systems that still place value in the creation of special moments.\nInspired by these challenges and drawing from suggestions and ideas of participants in several other studies (putting devices in LDR bedrooms [29], long calls without audio , exchanging drawings [39], leaving messages for waking up [59]), we designed the Bedtime Window, a technological probe to explore how a similar communication device would be used by partners in LDRs in bedrooms. Hutchinson et al. highlight three goals in relation to technological probes: understanding the needs and desires of users in a real-world setting, field-testing the technology, and inspiring users and researchers to think about new technologies [60].\nThe discussed challenges arising from previous work were addressed as follows: Motivated by salient privacy concerns in the bedroom environment, we opted for a regular exchange of photos rather than constant video stream, and avoided any audio transmission, since it was found to be the most privacy invasive [44]. Moreover, sharing individual photos enables masking of connectivity drops and therefore mitigates problems in maintaining stable video connections. To avoid the hassle of connection initiation and to support sharing mundane activities, the system was designed as an always-on, situated and dedicated device -the lack of dedicated devices was found to be one of the main barriers to the adaption of always-on technologies in the past [24].\nWe added inking in Bedtime Window as inking is generally found to be fun to use and simple to operate, supporting play and art, and preferred to text messages [47,48]. Ishii's work on ClearBoard showed the potential of live collaborative drawing in the working environment, and we wanted to build on this work and discover how this paradigm works in the home setting. To support both live communication and leaving messages for later, we introduced the idea of disappearing ink, where users can specify how long individual strokes stay on the screen.", "n_publication_ref": 12, "n_figure_ref": 0}, {"heading": "SYSTEM DESIGN", "text": "The Bedtime Window is a system connecting two places using a custom developed application running on standard Windows PC tablets with a built-in or off-the-shelf RGB light sensor. The sensor enables a paper-like display experience as described in [61], where the display mimics a reflective surface in terms of light and color produced, making it physically acceptable in bedrooms at night.\nA snapshot of the user interface is shown in the cover Figure 1, demonstrating the two most important user experiences:\n1. Slow photo stream: the device captures a picture using the front camera every 5 seconds and sends it to the remote device. The user interface shows a live camera preview in the bottom-left corner with a progress bar so that the user knows at what moment the photo is taken. Received photos are shown full screen in the background, over which the users can ink. Note that the background image is different for each user, since each sees the most recent photo from their partner's camera. 2. Inking: Users can draw on the screen with their finger. As they draw, the inking data is transferred and shown in realtime on the remote device, creating a shared inking space. All inking is in single layer, i.e. later strokes are drawn over earlier strokes regardless of who drew them. Users can select one of 8 predefined colors, 3 predefined ink thicknesses and 4 predefined ink durations (one second, one minute, one hour or one day). All strokes start linearly disappearing (i.e. becoming transparent) as soon as they are drawn, so that full transparency is reached when the selected duration passes. When short duration ink covers long duration ink, the long duration ink will be revealed as the short duration ink disappears. Users also have the ability to instantly erase all ink on both devices at once.\nEach pair of devices were connected through a server. The devices had a symmetric AES encryption key pre-deployed, so that photos from bedrooms couldn't be eavesdropped on the network or recovered from the devices transferring them. More technical and architectural details about the system are available in [62].\nIn order to produce and then refine Bedtime Window, we used an autobiographical design [63] approach, refining the system over multiple iterations and months based on the first author and his partner's experiences living with and reacting to the system.", "n_publication_ref": 3, "n_figure_ref": 1}, {"heading": "STUDY DESIGN", "text": "To understand the value to LDR couples of Bedtime Window, we conducted a field study with 5 LDR couples using our system for 4 weeks in their bedrooms.\nEach participant has been remunerated £150 in recognition of their contribution to the study and had travel costs to the interviews reimbursed if they chose to attend them in person. The study design was approved by the ethics committee at Newcastle University.\nThe study was advertised using e-mails and printed flyers at various accommodation locations. Interested participants answered an online pre-screening questionnaire and were invited on a firstcome-first-served basis for an initial interview and survey regarding their current communication practices and use of technology in the relationship.\nInitial interviews were conducted with both partners together, either in person or over Skype video-call, depending on participants' choice. We didn't see a need to conduct the initial interview individually, since the aim of the interview was to make participants familiar with the system and to find out about their existing communication practices in the relationship, which includes the dynamics of interacting with each other. All but one couple chose a Skype call; for the remaining couple, the local partner came in person, but the remote partner had to be called separately due to scheduling. The Bedtime Window hardware was shipped by mail to the participants who could not pick it up personally.\nThe participants then used Bedtime Window for the period of 4 weeks. The instructions in the information sheet were minimal: to leave the device on 24/7 in the bedroom as an ambient display (being free to cover it or turn away if it made the user feel uncomfortable), and to have fun with the device or just live with it for a while. Participants were allowed to move the device around if they felt their daily schedules did not leave them any interesting common time to take advantage of the system.\nAfter the first week, we sent an e-mail to check with participants whether everything was working and to give them an opportunity to ask questions and voice their concerns and/or impressions. After the full 4 weeks, devices were collected and exit surveys and interviews were conducted, this time with each participant separately, in case they would like to share experiences or feelings that they wouldn't like their partner to hear.\nInspired by one of the couples sharing photos they took of the device during the study, we sent another e-mail around to check if any other couple had taken any photos of the system in-situ that they would be willing to share (they were not instructed to do so during the study).", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Participants", "text": "All five couples (10 participants aged 23-46, median 27) were recruited from a university in the UK, with the prerequisites of being in a relationship but currently living separately; not sharing their bedrooms with other people; and having previously lived together. All couples were heterosexual, though this was not a prerequisite. Two of the couples had remote partners in mainland Europe (France and Germany), others were separated across the UK. Despite these requirements, it later transpired that the eldest couple (C5) had not lived together before. Since these partners were in their forties, we found it valuable to keep them in the study nevertheless, however, their views on privacy might be skewed by this difference. To refer to participants in this paper, we use the notation (e.g.) C4 M for the  1 for more demographic details on participants.\n5.1.1 Data. We gathered data through initial and exit surveys and interviews, feedback entered through the system, and photos the couples were willing to share. The semi-structured interviews were transcribed and analyzed using thematic analysis. Telemetry from the device was also recorded (screen touches, built-in accelerometer etc.), but in order to avoid biasing communication between the partners, we deliberately did not record the inking absolute coordinates, only the amount and type of ink they used. We explained to couples that this prevented us reconstructing the actual ink messages sent.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "RESULTS", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Engagement", "text": "Overall, participants used and enjoyed the system. Analysis of the data gave us insights into communication between partners in LDRs, as well as learnings regarding the individual features of the system.\n6.1.1 Usage. All participants kept using the system actively for the whole duration of the study, except for some periods where the participants were not at home (for an overview, see Figure 2). As the data shows, everyone used the device for at least 4 weeks, with the exception of C1 M , who was travelling for the last week of the study.\nDuring recruitment, participant C1 F expressed a concern that she would use the system for a bit as it was a novelty and then stop. That did not turn out to be the case as she recollected during the final interview.\n\"Yeah I liked it more than I thought actually. I liked the fact that it's taking pictures every 5 seconds and the drawing was fun, so I think I liked it more than I thought I would, and we used it mostly in the evening, like coming home from work to say 'hi' and have some interaction and then the same in the morning before work, that's the time, yeah. \" C1 F Four of the five couples reported keeping the device always or mostly in their bedroom. Both C1 M and C4 M said that they would occasionally move it out when they stayed home during the day as \"it's kind of nice to see the other person working rather than it being pointed at the empty bed\" (C4 M ). Couple C5 experimented with other locations more, as they kept missing each other at the bed, but eventually concluded that \"it worked better in the bedroom\" (C5 F ). All couples reported using the device mostly in the mornings and evenings, hence we believe our device successfully targeted the bedtime sharing scenario.   3: How much do you agree with the following: \"I would recommend the system to other partners in a long-distance relationship\" (top) \"The system has connected me with my partner in a way that other technology have not.\" (bottom) 6.1.2 Reception. Seven of the ten participants viewed the system positively and would recommend it to other people in LDR (see Figure 3). \"I am really enjoying it -it is a much nicer way to say goodnight and good morning to [my partner], as opposed to using Facebook messenger. \" C4 M \"I think it was mostly nice device, I enjoyed having it, now that we don't have it anymore, I was telling [my partner] it would have been nice if it was still here\" C1 M One couple, as already suggested by the responses in Figure 3, disagreed. They felt that the way their relationship works did not really benefit from the device. \"I don't like being in a long-distance relationship, I'd rather be close to [my partner] but I am not, I don't feel like I need more ways to be close to [her]. I think being in a long-distance relationship will always be difficult and with phones and the internet and messaging and ringing and video chat, there are enough tools out there to make the distance bearable and I don't, didn't need another device. \" C3 M He strongly disagreed with recommending the device to other couples in the exit questionnaire. However, at the end of his interview, when asked whether there is anything he would like to add, he said he would like to revise that answer: \"[. . .] maybe I was thinking too much about myself rather than other relationships when I answered the question [. . .] one of my friends who was in a LDR I did know that they would like fall asleep on Skype with each other, that was few years gone, so I guess if I had known about this at the time, I would mentioned it to him. \" C3 M The oldest couple (C5) reported some mixed feelings. While they really enjoyed the inking aspect of the system, they felt negatively towards the picture sharing. Feeling negatively towards picture sharing was explained in terms of being self-conscious and associations with surveillance. Both of these were explained in part as being \"a generational thing\". Indeed, none of the younger participants had any problems with picture sharing. Despite this unease, the oldest couple also missed the system: \"both [my partner] and I have remarked that in the weeks after the study, we both missed having the device, in spite of the reservations that each of us had held during the study period. \" C5 M The feedback from participants suggests that the system was enjoyable for most of the couples in our study.", "n_publication_ref": 1, "n_figure_ref": 4}, {"heading": "Slow Photo Stream", "text": "The slow photo stream was a novel experience for all participants, but its reception was divisive. One couple didn't like it, feeling \"we could just be on the phone instead\" (C3 F ) and comparing it to online video experiences. C5 F was frustrated \"that it wasn't smooth, that it was a still, and then another still, and then another\".\nOn the other hand, others saw this feature as an opportunity for play:\n\"it adds an element of fun, because if you are having a very interactive session, you have a chance to think what you are doing and you can have fun with it, like making some funny faces, or you can kind of put your head really close and then move away, just really silly, silly games. \" C1 F \"[at the initial interview] I was like 'maybe a video would be nicer' but actually I think there are nice things about the pictures\" C1 M Figure 4 shows results from the exit questionnaire asking whether participants would prefer the two familiar alternatives (i.e. video and photos). Note that they haven't experienced these conditions during this study, but we expected the partners, especially in LDR, to have a reasonable experience of video calls and sharing photos.\nHalf of the participants suggested they would either like to be able to adjust the interval between the photos, possibly the same way they could for the ink duration, or to make a photo last until the other person sees it as a part of a message they left.\nTwo participants mentioned a direct effect of the photo stream on privacy. When discussing the negative privacy implications, C5 F suggested video would actually be worse. C4 F felt the photo stream provided a balance between privacy and sharing: \"I liked it actually, because video feels quite awkward, because you can see everything they do all the time, whereas 5 seconds is like a moment where you know they can't see you, it doesn't matter if you wanna like go and get something or I don't know, it feel[s] a bit more private but also sharing, which is nice. \" C4 F Figure 4: How much do you agree with the following: \"I would prefer if the camera was sending video all the time rather than occasional pictures only.\" (top) \"I would prefer if the pictures were shared only when I say, not automatically.\" (bottom)\nAnother two participants also expressed the lessened tensions the photo stream provides compared to traditional video connection, suggesting it might be more appropriate for always-on peripheral systems: \"I think with the normal video maybe you feel you have to pay attention all the time\" C4 M \"you don't feel maybe the pressure like the video\" C1 M Nevertheless, the system managed to preserve the sense of remote presence. For 3 couples, the feeling of remote presence was an important part of being in an LDR, and those couples reported that the system made them feel present at their partner's place as well as the other way around. The remaining two couples who did not find the feeling very important also reported experiencing it to a lesser amount, see Figure 5 for details. The feeling of being present was left to each participant's interpretation.\nWe saw that participants did not agree on whether they preferred photos, photo stream or always-on video. Advantages included additional playfulness, lower attention demands supporting peripheral use and increased sense of privacy compared to video, while still supporting sharing and remote presence. Negative feedback suggested the photo stream to be either too slow or too fast. One option for a future system would be to enable users to adjust the frame rate anywhere from still photos to full video.", "n_publication_ref": 0, "n_figure_ref": 3}, {"heading": "Inking", "text": "Bedtime Window is the first system to deploy situated inking in the bedroom environment. Shared inking was the most important feature to the participants (9 out of 10 marked it as important, 8 of these as very important), even more so than visual contact (regular picture sharing was important to 7 participants). As we shall discuss below, we found the inking to be a personal, versatile method of communication appropriate in bedrooms, providing affordances that are not well supported by existing technologies.\n6.3.1 Personal. Four participants explicitly stated the inking felt more personal than texting, pointing out that the messages and/or drawings were handwritten by a real person, especially as seeing each other's handwriting is becoming less common. \"it's not like the usual kissie face you send, so it's not like press a button, enter, goodnight, it's a bit more personal\" C2 M \"it was nice to have a picture or a little handwritten, you know that's the nice thing, handwritten, and it's not typed, so we both really liked that [. . .] because it's more personal, it's part of somebody that used his hands to do it\" C5 F Committing to handcraft a message or draw a painting was perceived as caring about the partner. Sometimes, inking and messaging behavior differed in unexpected ways (\"[he] put more kisses that he would do normally on messenger, which was interesting, I don't know why, but he just did\" C4 F ).", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Versatile.", "text": "Inking is a medium of communication that it is inherently versatile, supporting both text in any language and freeform use . Participants engaged in various modalities of communication, from asynchronous, where one person was drawing to leave a message (85% of sessions), to turn taking, where both partners were present and drawing to each other but never at the Figure 5: How much do you agree with the following (top to bottom): \"The feeling of being remotely present is an important part of a relationship to me.\"\"The system made me feel my partner is present at my place.\" \"The system made me feel present at my partner's place.\" Figure 6: Example of inking as provided by participants. Top row: relationship maintenance (C4, C2, C5). Bottom row: heavy inking art (\"I'd just paint the whole screen once and drew on it\" C4 F ), picture frame (C2 M ) and tracing a scene (C4 F ). same time (10%, \"we just like.. take turns to see what each of [us] was drawing\" C3 M ), to fully synchronous where both partners were drawing at the same time (5%). 1 Such versatility was provided by the ink disappearing at the user-specified speed.\nIn addition to those varying modalities of use, participants also used ink for many different purposes. Among those reported and demonstrated by screenshots or photos were conversation (\"sometimes we talked actually by writing\" C4 F ), organization (\"We might have left messages like phone call tonight, question mark, 8pm, question mark\" C5 M ), relationship maintenance (\"small love words or like hearts, [. . .] usually not very long messages, but like just to say 'hello' or 'miss you' or something like that\" C1 M ), play (guess a word, rock paper scissors and others) and art (\"I drew random stuff -a pineapple, a ghost, a dinosaur. . . [no connection. . .] it was just a nice picture, just a dinosaur with the speech bubble saying 'hello' -it sounds really silly, but. . . that's kind of joy, apparently. \" C5 M ). Some participants also took advantage of the situated nature of the device, by either tracing a scene on the screen, or drawing picture frames through which the photos could be seen, for examples see Figure 6. Other purposes might have been utilized too, but as noted above, inking was not recorded in this study except when a screenshot was deliberately shared with us, so we rely on participants' reports.", "n_publication_ref": 1, "n_figure_ref": 3}, {"heading": "New Affordances.", "text": "To our knowledge, Bedtime Window is the first system whose main method of personal communication was inking on a shared, non-layered surface, where new strokes cover the previous ones, regardless of which party produced them. Moreover, the real-time and disappearing nature of the ink opened new ways of interaction between people. The communication flow builds on what is already on the screen, sometimes even before it is finished. Participants were overwriting, overdrawing or otherwise intervening with what their partner was inking in a way that exchanging messages does not allow.\n\"sometimes we'd adopt things to each other's drawing, or wrote over each other\" C1 M \"sometimes if you paint and I think this color does not fit here I just draw over the other color\" C2 M \"I'd cross out things that she wrote or sometimes trying guess what she is going to write -so she is writing a word - [and] trying to finish it or deliberately change it so that it's wrong. \" C4 M Another unique aspect of the real-time shared space is that it allows to participants to create something together in a way that other means of communication usually do not. People call each other or text each other, and while it is certainly possible to draw to each other, as many participants did, it's also possible to draw together. \"It's a beautiful thing, you can create somethingthat's quite nice -together\" C2 M \"we have drawn something together\" C2 F on many occasions \"I just find it quite funny trying to guess what it was that we were drawing\" C4 M (emphasis ours)\nIn other words, while other common ways of communication enforce turn-taking, inking in Bedtime Window allowed simultaneous collaboration in which both partners can participate at the same time.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Appropriateness in Bedrooms", "text": "The study showed that technology situated in bedrooms can provide value to people without being too intrusive. 7 out of 10 participants agreed that falling asleep and waking up together are important moments in a relationship. Six people found it valuable seeing their partner during that time and the same six people felt comfortable sharing this time with their partners, see Figure 7 Figure 7: How much do you agree with the following (top to bottom): \"Being together when falling asleep and waking up are important moments of a relationship to me.\" \"I felt comfortable sharing the time when I fall asleep and/or wake up with my partner.\" \"Seeing my partner fall asleep and/or wake up was valuable to me.\" \"I like the part that you can see when your partner, you can go to sleep with him and wake up, and you can see when he is home or not and what he is doing\" C2 F \"That time when you are in bed before you sleep, like I wouldn't really watch him after he'd fallen asleep, but it was more nice when we were both getting ready for bed, maybe sitting in bed for a bit and then sleeping, this period was nice. \" C1 F One couple even tried to synchronize the time they wake up. On the other hand, the couple who liked Bedtime Window the least didn't think it was important to share bedtime and their schedules did not let them try the experience either. \"I think I started waking up a bit later than I'd try to, because he wakes up later, so if I wake up and he is asleep, I'd be more inclined to just stay in bed rather than normally I get up straight away\" C4 F \"We didn't really used it very much for [sharing bedtime], I think he probably goes to bed later and gets up later than me as well, and I get up really early, so I think we weren't really on the right schedules to try that very much, but I feel like that, when he is not in the room, I am not that bothered about, trying to recreate it. \" C3 F", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "Relationship", "text": "Overall, we saw Bedtime Window having a positive impact on relationships, providing connections that are not easily achievable using other technology, as confirmed by the exit survey questions described in Figure 8 Committing to handcrafting a message or drawing a painting was perceived as caring between partners, and the system increased the feeling of care, connection and intimacy.\n\"He came across as more caring and affectionate in the drawings\" C4 F \"It definitely has [the showing care] effect, the intimacy effective, that was a surprise, it was a pleasant surprise, to see that, it did add a dimension to a relationship. \" C5 M Ordinary daily activities that are not worth having explicit conversations about become part of LDR again and participants found value in seeing them, in agreement with the results of Baishya [57].\n\"The whole morning routine and evening routine of getting ready for work or getting changed and stuff is something that's not important enough to talk about, but then when you see it, it's kind of, I don't know, it definitely increases the connection, like, I don't know it's just knowing what each other is doing is just nice I guess, it's more like being in the same place, kind of. \" C4 M The situated nature of the window leverages one of the key aspects of a collocated relationship -providing a means of being together even when explicit interaction is short and sparse or even absent (\"because if you are together, you wouldn't constantly be having a conversation 100% of the time\" C4 M ).\n\"Sometimes we would see each other and that was nice, briefly, and we knew that we were both sort of Figure 8: How much do you agree with the following (top to bottom): \"The system had a positive impact on my relationship\" \"The system has connected me with my partner in a way that other technology have not.\"\non our way to work, so we did give a wave and smile and a picture\" C5 F Participants felt the Bedtime Window made them feel closer compared to other existing technologies they were using.\n\"It helps you also feel sometimes that you're near to the other person, more than social media\" C1 M \"I feel more connected to my partner, I feel more like he would be close to me rather than text him and then [it's] over\" C2 F \"we were just thinking about each other slightly more, wondered what they were doing\" C3 F While one couple did not feel they need yet another way to be in touch in their relationship as we discussed in 6.1.2, all the other couples felt that Bedtime Window did help them to be closer, learn about each other and create shared memories.\n\"I think we are always in touch, you know, like nowadays would have all the technologies and WhatsApp and everything, we're always in touch, but it's a different way to be in touch. \" C1 M", "n_publication_ref": 1, "n_figure_ref": 2}, {"heading": "DISCUSSION", "text": "We deployed Bedtime Window, a system for connecting remote couples during bedtime, to the bedrooms of 5 couples in LDR, for a field study of 4 weeks. The design of the system builds on previous research done on always-on systems and into LDRs, and includes the new experiences of a slow photo stream and shared inking space to address many of the recommendations and suggestions made in prior work. Through the deployment of Bedtime Window, we explored the feasibility of having a full-screen, always-on interactive device in the bedroom.\nWe found that all but one couple considered being together when falling asleep and waking up to be important moments in a relationship, yet very few efforts are exploring this space. The same couples indicated that the system has connected them in a way that other technologies have not, that it had a positive effect on their relationship and that they would recommend Bedtime Window to other couples in LDR. The remaining couple did not feel they need to be connected during bedtime, neither that they need any more ways to connect in general. Every couple is different, and each has their own needs and expectations that a particular design might or might not meet.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Slow Photo Stream", "text": "We were able to reproduce several findings from previous work on always-on video channels, such as increased awareness of and connection to the remote partner, and increased thinking of and interacting with each other without the feeling of obligation to call [31]. Notably, we have been able to do so without having an alwayson video channel, suggesting that always-on video is not critical to achieve these design goals, saving consumption of both bandwidth and power as well as addressing privacy concerns associated with being constantly monitored.\nMoreover, the photo stream gave a sense of freedom from obligations to communicate via the device, as participants didn't feel pressured to pay full attention to each other and to give up their time to focus solely on the interaction with their partner compared to regular calls. Many mundane and daily activities are not worth talking about but are still nice to perceive and share, and sharing these seemingly unimportant moments is a fundamental part of living together with someone. As one of our participants pointed out, people don't constantly talk to each other when cohabiting either.\nOne negatively perceived quality of an always-on video connection highlighted in previous work is that it can take away topics for discussion when it comes to regular calls between partners [57]. With the slow photo stream and no audio, none of our participants reported such issues. On the contrary, we had reports of people using the device to complement audio calls.\nWhile the slow photo stream proved to be a promising compromise between users' privacy and feeling of remote presence, participants also expressed the desire to sometimes retain photos they have staged for their partners until they see them, as well as for more video-like sessions. One participant suggested the ability to control the duration of a photo the same way the ink could be set to disappear after various intervals. This suggests that users would benefit from being able to adjust the lifetime or interval between photos in a photo stream on the go, anywhere from 'stopped' to the 'video' state.\nAn indicator showing when a photo is going to be taken allowed some participants to playfully stage their photos and clearly marks the window when users can expect a window of complete privacy.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Inking", "text": "The core communication channel, real-time disappearing inking on a shared surface (i.e. where last stroke wins), proved to be an enjoyable and very versatile experience, allowing participants to communicate, play and create together, and enabling them to leave messages and drawings for later as well as synchronously draw at the same time, in any language and writing script, expressing personal involvement and care.\nWe have seen the ability to send handwritten messages come and go in commercial software, but that covers only a fraction of the affordances of inking. Sharing one inking space in real-time opens space for conversation, creativity and play. Ishii presented the metaphor of drawing from two sides of a glass, resulting in separated ink layers [65]. In Bedtime Window, the strokes are overlaid on a single layer, providing a new, unique experience without a corresponding physical equivalent, leading to inking meta-interactions where users alter, overwrite, annotate or decorate ink as it is appearing. This is comparable to typed-chat in which participants see messages as they are being typed (e.g. [66]), except that in this case users can actually interfere with each other's writing.\nIn addition to traditional inking properties such as stroke width and color, we introduced a 'decay time' property, defining an individual stroke's behavior over time, effectively making all the ink continuously disappearing as soon as it is written. Similar to the photo stream, while disappearing ink supported conversation flow and extra playfulness, users suggested it would have been desirable to have an option to keep the inking visible until the other partner sees it. Some participants spent a lot of time drawing unexpectedly complex and ink-heavy content and employed their own measures to ensure their creation is preserved, such as taking picture of the device with their camera. Despite valuing ephemerality of the system for sharing mundane tasks, everyday drawings and just being together, inking is inherently time consuming and cannot be as easily reproduced as usual text messages or photos, suggesting that a way to save drawings would have been welcomed by users.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Limitations and Future Work", "text": "Undoubtedly the learnings from Bedtime Window are limited by the circumstances of our participants, who were at most 1 hour of time zone difference apart, all in western Europe, and who have experienced the system for 4 weeks only.\nWe did not stratify our participants by length of relationship, sexual orientation, cultural background or time zone differences, and we did not have enough older participants or couples with children to allow specific conclusions for those groups.\nOur work has introduced new experience paradigms and many questions remain yet to be answered. We showed that always-on video is unnecessary to achieve many of the common goals of connecting partners in LDR. Bedtime Window used an interval of 5 seconds between photos, but how much of the continuity can be removed without affecting the design goals is not known. In a similar way, the intervals by which ink disappeared were restricted, and the optimal duration for maximizing communication flow needs to be determined. We can also imagine this property to be automatically determined or adjusted by the system on the fly, as people communicate.\nBeing cautious about affecting the content of inking exchange between partners in an intimate space, we decided not to record inking content in this study, only the amount and properties of ink used. However, we learned that real-time shared inking brings metainteractions and new elements driving communication dynamics, topics that have not yet been systematized or described in the field and that we look forward to exploring in future works.\nFinally, many of the same underlying requirements found in the domain of remote relationships that we have addressed with Bedtime Window are also present in other domains, in a world where human contact is increasingly computer-mediated. In domains like remote healthcare, remote education, social services, or elder care, similar needs to balance privacy with interactivity and the feeling of connectedness exists. We therefore hope that the technologies we have developed and the lessons learned in our study will be of relevance to those domains, and to enable future work in those areas.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "CONCLUSION", "text": "We have designed an always-on interactive system that allows couples in LDRs to share bedtime, and deployed it into bedrooms of 5 couples. Building on learnings from previous work, we introduced two new experiences: a slow photo stream, which we found to balance feelings of privacy and remote presence with a reduced pressure to communicate; and a shared, real-time inking surface, which brings new ways to communicate and the ability to create something together. We look forward for these results to be used in new applications and contexts.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "We are grateful to our participants, and to our anonymous reviewers for their valuable feedback. This work was supported by Microsoft Research through its PhD Scholarship Programme.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "2013 International Bedroom Poll", "journal": "National Sleep Foundation", "year": "2013", "authors": " Wba Research"}, {"title": "Intimacy in Long-Distance Relationships over Video Chat", "journal": "", "year": "2012", "authors": "C Neustaedter; S Greenberg"}, {"title": "Long Distance Relationship Statistics -Statistic Brain", "journal": "", "year": "2017-09-14", "authors": ""}, {"title": "Technology-Mediated Relationship Maintenance in Romantic Long-Distance Relationships: An Autoethnographical Research through Design", "journal": "Humann-Computer Interaction", "year": "2017", "authors": "W.-C Chien; M Hassenzahl"}, {"title": "All You Need is Love: Current Strategies of Mediating Intimate Relationships through Technology", "journal": "ACM Transactions on Computer-Human Interaction", "year": "2012", "authors": "M Hassenzahl; S Heidecker; K Eckoldt; S Diefenbach; U Hillmann"}, {"title": "Relational Maintenance and Noncopresence Reconsidered: Conceptualizing Geopgrahic Separation in Close Relationships", "journal": "Communication Theory", "year": "2010", "authors": "A J Merolla"}, {"title": "Measuring Long-Distance Romantic Relationships: A Validity Study", "journal": "Measurement and Evaluation in Counselling and Development", "year": "2011", "authors": "M C Pistole; A Roberts"}, {"title": "Maintaining Relationships through Strategic and Routine Interaction", "journal": "Academic Press, Inc", "year": "1994", "authors": "D J Canary; L Stafford"}, {"title": "Hug Over a Distance", "journal": "", "year": "2005", "authors": "F ' Mueller; F Vetere; M R Gibbs; J Kjeldskov; S Pedell; S Howard"}, {"title": "The Hug: a New Form for Communication", "journal": "", "year": "2003", "authors": "F Gemperle; C Disalvo; J Forlizzi; W Yonkers"}, {"title": "Feelybean: Communication Touch Over Distance", "journal": "", "year": "2012", "authors": "D Kontaris; D Harrison; E - E Patsoule; S Zhuang; A Slade"}, {"title": "Flex-N-Feel: Emotive Gloves for Physical Touch Over Distance", "journal": "", "year": "2017", "authors": "S Singhal; C Neustaedter; A N Antle; B Matkin"}, {"title": "Kissenger: Design of a Kiss Transmission Device", "journal": "", "year": "2012", "authors": "H A Samani; R Parsani; L T Rodriguez; E Saadatian; K H Dissanayake; A D Cheok"}, {"title": "Mediating intimacy in long-distance relationships using kiss messaging", "journal": "Int. J. Human-Computer Studies", "year": "2014", "authors": "E Saadatian; H Samani; R Parsani; A V Pandey; J Li; L Tejada; A D Cheok; R Nakatsu"}, {"title": "United-Pulse: Feeling Your Partner's Pulse", "journal": "", "year": "2008", "authors": "J Werner; R Wettach; E Hornecker"}, {"title": "Lover's cups: connecting you and your love one", "journal": "", "year": "2006", "authors": "C.-H J Lee; H Chung"}, {"title": "MyEyes\": The Design and Evaluation of First Person View Video Streaming for Long-Distance Couples", "journal": "", "year": "2017", "authors": "R Pan; S Singhal; B E Riecke; E Cramer; C Neustaedter"}, {"title": "cubble: A Multi-Device Hybrid Approach Supporting Communication in Long-Distance Relationships", "journal": "", "year": "2013", "authors": "R Kowalski; S Loehmann; D Hausen"}, {"title": "WearLove: Affective Communication via Wearable Device with Gamification", "journal": "", "year": "2015", "authors": "Y R Joi; T B Jeong; J H Kim; K H Park; T Lee; J D Cho"}, {"title": "I Just Clicked To Say I Love You: Rich Evaluations of Minimal Communication", "journal": "Montreal", "year": "2006", "authors": "J ' Kaye"}, {"title": "Productive Love Promotion via Affective Technology: An Approach Based on Social Psychology and Philosophy", "journal": "An Interdisciplinary Journal on Humans in ICT Environments", "year": "2010", "authors": "R S Pujol; H Umemuro"}, {"title": "Issues and Solutions to Informal Communication in Working from Home Using a Telepresence Robot", "journal": "ITE Transactions on MEdia Technology and Applications", "year": "2018", "authors": "E Myodo; J Xu; K Tasaka; H Yanagishara; S Sakazawa"}, {"title": "Media Space 20+ Years of Mediated Life", "journal": "Springer-Verlag", "year": "2009", "authors": "S Harrison"}, {"title": "Reactions to Mixed-Context Always-On Video for Connecting Close Personal and Work Contacts", "journal": "", "year": "2014", "authors": "C Pang; A Fogrhani; E Oduor; C Neustaedter; I Walker; D Robinson"}, {"title": "Hi Grandpa!: A communication Tool Connecting Grandparents and Grandchildren Living Apart", "journal": "", "year": "2015", "authors": "J S Lee; S Liang; S Park; C Yan"}, {"title": "Home technologies to keep elders connected", "journal": "", "year": "2004", "authors": "J Lundell; M Morris; S Intille"}, {"title": "Gust of me: reconnecting mother and son", "journal": "IEEE Pervasive Computing", "year": "2004", "authors": "I Keller; W V D Hoog; P J Stappers"}, {"title": "Anchor: connecting sailors to home", "journal": "", "year": "2012", "authors": "J Farny; M Jennex; R Olsen; M Rodriguez"}, {"title": "I want to imagine how that place looks\": designing technologies to support connectivity between africans living abroad and home", "journal": "", "year": "2013", "authors": "S P Wyche; M Chetty"}, {"title": "Connecting Families", "journal": "Springer-Verlag", "year": "2013", "authors": ""}, {"title": "The Family Window: The Design and Evaluation of a Domestic Media Space", "journal": "", "year": "2010", "authors": "T K Judge; C Neustaedter; A F Kurtz"}, {"title": "Family portals: connecting families through a multifamily media space", "journal": "", "year": "2011", "authors": "T K Judge; C Neustaedter; S Harrison; A Blose"}, {"title": "The family room: a multi-camera, multi-display family media space", "journal": "", "year": "2014", "authors": "E Oduor; C Neustaedter"}, {"title": "Sharing Domestic Life through Long-Term Video Connections", "journal": "ACM Transactions on Computer-Human Interaction", "year": "2015", "authors": "C Neustaedter; C Pang; A Forghani; E Oduor; S Hillman; T K Judge; M Massimi; S Greenberg"}, {"title": "Magic Wardrobe: Situated Shopping from your own Bedroom", "journal": "Personal Technologies", "year": "2000", "authors": "D Wan"}, {"title": "Investigating the prsence, form and behavior of virtual poseessions in the context of a teen bedroom", "journal": "", "year": "2012", "authors": "W Odom; J Zimmerman; J Forlizzi; H Choi; S Meier"}, {"title": "The Bed: A Medium for Intimate Communication", "journal": "", "year": "1997", "authors": "C Dodge"}, {"title": "The Sensing Beds", "journal": "", "year": "2003", "authors": "E Goodman; M Misilim"}, {"title": "Enhancing the Sleeping Quality of Partners Living Apart", "journal": "", "year": "2010", "authors": "T Scherini; P Melo; T V Craenendonck; W Zou; M Kaptein"}, {"title": "SleepyWhispers: Sharing Goodnights within Distant Relationships", "journal": "", "year": "2012", "authors": "D Gooch; L Watts"}, {"title": "Living in a glass house: a survey of private moments in the home", "journal": "", "year": "2011", "authors": "E K Choe; S Consolvo; J Jung; B Harrison; J A Kientz"}, {"title": "Casablanca: Designing Social Communication Devices for the Home", "journal": "", "year": "2001", "authors": "D Hindus; S D Mainwaring; N Leduc; A E Hagström; O Bayley"}, {"title": "Blur Filtration Fails to Preserve Privacy for Home-Based Video Conferencing", "journal": "ACM Transactions on Computer-Human Interaction", "year": "2006", "authors": "C Neustaedter; S Greenberg; M Boyle"}, {"title": "The Autobiographical Design and Long Term Usage of an Always-On Video Recording System for the Home", "journal": "", "year": "2017", "authors": "Y Heshmat; C Neustaedter; B Debrincat"}, {"title": "The Language of Privacy: Learning from Video Media Space Analysis and Design", "journal": "ACM Transactions on Computer-Human Intearction", "year": "2005", "authors": "M Boyle; S Greenberg"}, {"title": "Freeform digital ink annotations in electroninc documents: A systematic mapping study", "journal": "Computers & Graphics", "year": "2015", "authors": "C J Sutherland; A Luxton-Reilly; B Plimmer"}, {"title": "HomeNote: Supporting Situated Messaging in the Home", "journal": "", "year": "2006", "authors": "A Sellen; R Harper; R Eardley; S Izadi; T Regan; A S Taylor; K R Wood"}, {"title": "Designing a Technological Playground: A Field Study of the Emergence of Play in Household Messaging", "journal": "", "year": "2010", "authors": "S E Lindley; R Harper; A Sellen"}, {"title": "VideoDraw: A Video Interface for Collaborative Drawing", "journal": "", "year": "1990", "authors": "J C Tang; S L Minneman"}, {"title": "VideoDraw: A Video Interface for Collaborative Drawing", "journal": "ACM Transactions on Information Systems", "year": "1991", "authors": "J C Tang; S L Minneman"}, {"title": "ClearBoard: A Seamless Medium for Shared Drawing and Conversation with Eye Contact", "journal": "", "year": "1992", "authors": "H Ishii; M Kobayashi"}, {"title": "Integration of inter-personal space and shared workspace: ClearBoard design and experiments", "journal": "", "year": "1992", "authors": "H Ishii; M Kobayashi; J Grudin"}, {"title": "Integration of interpersonal space and shared workspace: ClearBoard design and experiments", "journal": "ACM Transactions on Information Systems", "year": "1993", "authors": "H Ishii; M Kobayashi; J Grudin"}, {"title": "Interacting with Paper on the DigitalDesk", "journal": "Communications of the ACM", "year": "1993", "authors": "P Wellner"}, {"title": "PlayTogether: Playing Games across Multiple Interactive Tabletops", "journal": "", "year": "2007", "authors": "A D Wilson; D C Robbins"}, {"title": "Shared Living, Experiences, and Intimacy over Video Chat in Long Distance Relationships", "journal": "Springer-Verlag", "year": "2013", "authors": "S Greenberg; C Neustaedter"}, {"title": "In Your Eyes: Anytime, Anywhere Video and Audio Streaming for Couples", "journal": "CSCW", "year": "2017", "authors": "U Baishya"}, {"title": "Home Video Communication: Mediating 'Closeness'", "journal": "", "year": "2010", "authors": "D Kirk; A Sellen; X Cao"}, {"title": "Are You Sleeping? Sharing Portrayed Sleeping Status withing a Social Network", "journal": "", "year": "2008", "authors": "S Kim; J A Kientz; S N Patel; G D Abowd"}, {"title": "Technology Probes: Inspiring Design for and with Families", "journal": "", "year": "2003", "authors": "H Hutchinson; W Mackay; B Westerlund; B B Bederson; A Druin; C Plaisant; M Beaudouin-Lafon; S Conversy; H Evans; H Hansen; N Roussel; B Eiderbäck"}, {"title": "Towards Calm Displays: Matching Ambient Illumination in Bedrooms", "journal": "", "year": "2017-06", "authors": "J Kučera; J Scott; N Chen; P Olivier; S Hodges"}, {"title": "Bedtime Window: A System Enabling Sharing of Bedtime for Long-Distance Couples", "journal": "", "year": "2019", "authors": "J Kučera; J Scott; S Lindley; P Olivier"}, {"title": "Autobiographical Design in HCI Research: Designing and Learning through Use-It-Yourself", "journal": "DIS", "year": "2012", "authors": "C Neustaedter; P Sengers"}, {"title": "Peer-to-peer ink messaging across heterogeneous devices and platforms", "journal": "", "year": "2008", "authors": "M Prasad; A ; M Selvaraj; S Madhvanath"}, {"title": "Iterative design of seamless collaboration media", "journal": "Communicationcs of the ACM", "year": "1994", "authors": "H Ishii; M Kobayashi; K Arita"}, {"title": "Come let us chat together: simultaneous typed-chat in computer-supported collaborative dialogue", "journal": "Journal of Computing Sciences in Colleges", "year": "2015", "authors": "M Glass; K Bryant; J H Kim; M Desjarlais"}, {"title": "Together in Bed? Couples' Mobile Technology Use in Bed", "journal": "", "year": "2019", "authors": "T Salmela; A Colley; J Häkkilä"}], "figures": [{"figure_label": "2", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 2 :2Figure 2: Active system usage during the study. Red: hours when the display was touched or a face was detected by the camera, pink: accelerometer activity only.", "figure_data": ""}, {"figure_label": "", "figure_type": "", "figure_id": "fig_1", "figure_caption": "FigureFigure 3: How much do you agree with the following: \"I would recommend the system to other partners in a long-distance relationship\" (top) \"The system has connected me with my partner in a way that other technology have not.\" (bottom)", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Participant demographics (self-reported during recruitment)", "figure_data": "CodeAgeOccupationLocationRelationship lengthCohabitating durationSeparation durationC1 F27project managerUK3 years< 1 year2 yearsC1 M27business developerFrance4 monthsC2 M38lab managerUK2 years4 months1.5 yearsC2 F32studentGermany9 monthsC3 F23unemployedUK4 years1 year2 weeksC3 M23unemployedUKC4 F26studentUK5 years1 year4 yearsC4 M25studentUKC5 M46research computingUK1 year-1 yearanalystC5 F45health visitorUKfourth couple, male participant. See Table"}], "doi": "10.1145/3411764.3445121"}