{"authors": "Stephen Uzor; John J Dudley; Jason T Jacques; Ola Per;  Kristensson", "pub_date": "", "title": "Investigating the Accessibility of Crowdwork Tasks on Mechanical Turk", "abstract": "Crowdwork can enable invaluable opportunities for people with disabilities, not least the work fexibility and the ability to work from home, especially during the current Covid-19 pandemic. This paper investigates how engagement in crowdwork tasks is afected by individual disabilities and the resulting implications for HCI. We frst surveyed 1,000 Amazon Mechanical Turk (AMT) workers to identify demographics of crowdworkers who identify as having various disabilities within the AMT ecosystem-including vision, hearing, cognition/mental, mobility, reading and motor impairments. Through a second focused survey and follow-up interviews, we provide insights into how respondents cope with crowdwork tasks. We found that standard task factors, such as task completion time and presentation, often do not account for the needs of users with disabilities, resulting in anxiety and a feeling of depression on occasion. We discuss how to alleviate barriers to enable efective interaction for crowdworkers with disabilities.• Human-centered computing → Empirical studies in accessibility; • Information systems → Crowdsourcing.", "sections": [{"heading": "INTRODUCTION", "text": "Crowdwork is a relatively new form of digital labor where crowdworkers complete microtasks posted by a 'requester' in order to earn income [8,61]. Given the fexibility involved in crowdwork and the lack of a need to commute to work, it is unsurprising that crowdwork ofers several advantages for work, which in most cases can be ideal for people with disabilities [61].\nAmazon Mechanical Turk (AMT) is a popular crowdwork platform, launched by Amazon in 2005, which has seen increasing use as a tool for research, including in social science [48], education [20], natural language processing (NLP) [57] image labelling [53,58] and more [35,38]. Using crowdwork for user research raises a number of issues, such as a lack of experimental controls, a need to ensure users invest efort in the tasks and a requirement and desire to maintain high research ethics standards [12,23]. Nonetheless, a series of studies have demonstrated that the results from crowdwork studies are practically indistinguishable from those that use more 'traditional' recruitment channels [11,19,20,28,56]. Other notable crowdwork platforms include Clickworker and Microworkers, although there are numerous such platforms available online.\nCommon microtasks (known as Human Intelligence Tasks, or HITs) performed on AMT include surveys, content generation, audio and video transcription, language translation, information fnding and verifcation and validation. Users can engage in crowdwork using a relatively simple and inexpensive computer connected to the Internet, which is another factor explaining why this type of work has become a viable option for either primary or secondary work [8,61].\nDespite the increasing interest in crowdwork by researchers and users alike, the literature suggests that crowdwork presents several accessibility issues [10,37,39,60,61], which can impact successful engagement in this type of work-examples of which include user interface issues [10], language barriers [37], wages [61], time limits [8,61] and unclear instructions [8]. Despite this body of literature, questions remain unanswered as to how the above issues afect people with a range of disabilities that are most likely to afect computer use. Further, it is important to identify how people with a range of disabilities approach or avoid crowdwork tasks, what role their impairment plays in the successful engagement in crowdwork and their opinions on how these issues may be alleviated.\nIn this paper, we frst conducted two surveys to understand how AMT workers who identify as having a disability cope with performing HITs (microtasks). We explored a variety of the most common disability categories [16], including: cognition/mental, hearing, physical, mobility, visual and motor/dexterity impairments. Out of the 1,000 participants that responded to the frst survey, 626 reported having a disability. We invited a subset of the participants in the frst survey (100 from each disability category) to take part in the second survey, which specifcally focused on the individual disability categories. Following both surveys, we conducted further interviews with 5 participants. We present demographic information on those users who identify as having a disability and discuss the fndings in light of previous work. Furthermore, we discuss how identifed barriers to accessibility can be reduced or alleviated to foster efective crowdwork. Given the increasing adoption of crowdwork as a permanent or supplemental source of income for users, the implications of such an investigation for HCI cannot be overstated. Hence, to the best of our knowledge, our work makes the following contributions to the wider HCI literature:\n(1) An investigation into the demographics of crowdworkers, in the US, who identify as having a disability and use the AMT platform.\n(2) Insights into the factors that hinder the efective completion of crowdwork tasks by people with a variety of difculties and impairments that are most likely to hinder computer use.\n(3) A discussion on how identifed accessibility issues can be alleviated in order to encourage efective participation in crowdwork.", "n_publication_ref": 31, "n_figure_ref": 0}, {"heading": "BACKGROUND 2.1 Crowdwork", "text": "Crowdsourcing is a relatively new technology for outsourcing work [33,53,56] in the form of microtasks to people who are generally known as crowdworkers [3]. Hensel et al. [29] defne crowdworking as the subset of crowdsourcing that involves paid work. Through crowdwork platforms, microtasks (a unit of a task on a crowdwork platform) can be available to thousands of workers from diverse backgrounds and communities. This afords potential benefts for research [1,12,27,35,38,41,58], such as the ability to sample a relatively large number of users from the population, high statistical power and generalizability of results [23,51]. Nevertheless, in certain cases such crowdwork platforms may be unsuitable for HCI-related experiments [30] due to a lack of experimental controls, means of ensuring user investment in the task and ethics [12,23]. Popular crowdwork platforms [23] include Clickworker [15] and Mechanical Turk [2], although there are numerous available alternatives. We focus on Mechanical Turk in this paper, not only because of the platform's popularity [25,41] and widely known brand association [41], but also due to the fact that it has been extensively studied in the literature [25,28,31,36,44], including in HCI (e.g. [25,53]), thereby facilitating a potential for comparison between studies.\n2.1.1 Amazon Mechanical Turk (AMT) and Terminology. Mechanical Turk (also known as AMT or MTurk) is a crowdsourcing platform developed by Amazon in 2005 that allows microtasks to be completed by crowdworkers [46,48,53]. A person who posts a microtask on AMT is called a requester, and the crowdworkers are known simply as workers, or 'Turkers' (when specifcally referring to AMT workers). In AMT, a microtask is referred to as a Human Intelligence Task (HIT), since these tasks are mostly suitable for human processing, rather than a machine. We use the terminology defned in this section in the rest of the paper. AMT normally requires certain qualifcations from workers in order to access and complete HITs on the platform [25]. Such qualifcations can range from having a certain number of previous HITs completed to having a 'masters' qualifcation gained by consistently completing HITs of a certain type from a variety of requesters with a high degree of accuracy. On the completion of HITs, requesters evaluate the HITs and can either approve or reject them. Approval results in payment, whereas a rejection does not. If a HIT is accepted but not completed, it is returned.\nMonetary rewards for completing HITs on AMT can be as little $0.01, with a median pay rate at $3.13 [25]. Given that this is far below the minimum wage rate in the US, it can lead to unsatisfactory and stressful working conditions [7,25]. Certain studies have found that income generation is the primary reason many workers engage in crowdwork [8,25,45]. Therefore, low compensation presents a problem to many workers [26]. Consequently, workers often resort to strategies, such as using scripts and community support to identify suitable HITs, including those with relatively higher payments [25].", "n_publication_ref": 42, "n_figure_ref": 0}, {"heading": "Demographics of Crowdworkers on AMT", "text": "Numerous studies have been conducted to investigate the demographics of AMT workers [17,53]. Ross et al. [53] estimated more than 400,000 registered workers, with some research placing the worker count at 500,000 [12,40]. It is not known how many of the users are active [12], although US workers were estimated at 15,000 at any given time [21,59]. However, in the interest of the research community, previous work revealed that only 7,300 participate in research studies [59], although Difallah et al. [17] estimate this number to be closer to 2,450 as at 2018. Prior work [42] also suggests that even though recruiting workers with the masters qualifcation provides some quality assurance, there is no marked diference in quality of results between more experienced workers and their less experienced peers.\nOne question that arises at this point is: Who are AMT workers? An informal 2010 investigation [34] suggested that the AMT demographics primarily included workers based in the US who are relatively young, female, educated and with moderately high incomes. Formal studies confrmed this demographic [17,49] but highlight an increase in international workers, mostly from India [17,37].\nThe literature highlights eforts to understand crowdworker demographics with regard to users identifying as having a disability. For example, Zyskowski et al. [61] explore the challenges associated with microtask employment for people with disabilities. They performed a survey with over 600 participants and carried out follow up interviews with 13 respondents. Zyskowski et al. [61] found that a reasonable number of people with disabilities engage in crowdwork. Consequently, they outline a number of avenues for further research, including understanding: a) the level of representation of people with diferent specifc disabilities in crowdwork; and b) the ever-changing demographics (e.g. the elderly) of people with disabilities and the potential dynamics for support within this community. Zyskowski et al. 's work [61] focuses on attitudes of people with disabilities towards crowdwork, regardless of whether or not they actually do engage, or have previously engaged, in crowdwork. In their study, a relatively small subset of participants used AMT. Our work, while similar to [61], difers mainly in the sense that we focus specifcally on AMT and aim to understand the demographics of users with diferent disabilities and how these disabilities afect their engagement in crowdwork on AMT.", "n_publication_ref": 20, "n_figure_ref": 0}, {"heading": "Accessibility in Crowdwork", "text": "In an attempt to evaluate the accessibility of AMT from a strict user interface (UI) standpoint, Calvo et al. [10] conducted a heuristic analysis of AMT using the Web Content Accessibility Guidelines (WCAG) 2.0 [52]-a set of guidelines for making websites useful and more accessible for users. Calvo et al. [10] found a variety of potential accessibility challenges with the AMT interface (in 2014), which could present barriers to use for those with visual, audio, cognitive and physical disabilities. Although the work by Calvo et al. [10] provided useful insights into how the AMT interface could be improved, there are a number of key opportunities for further work in the HCI domain. First, it is important to understand how AMT crowdworkers perceive accessibility issues and how these issues hinder their efective use of the platform. Second, although heuristic evaluations are a valid commonly used method in HCI, studies have suggested that expert audits of the WCAG guidelines do not meet the threshold of 80% agreement necessary to give a defnitive answer on whether or not guidelines have been met [4,5]. Therefore, it useful to gain insights into users' experiences with crowdwork platforms, by engaging in conversations with users.\nResearchers have conducted such investigations to improve the accessibility of crowdwork for users with low information and communication technology (ICT) literacy. For instance, in 2010, Khanna et al. [37] conducted a study to evaluate the usability of AMT interfaces for low-income workers in India. They proposed design recommendations based on the fact that the interfaces for HITs were often too complicated for these users, especially regarding the English language. Furthermore, a 2013 study by Kobayashi et al. [39] developed a question-answer card interface to allow low ICT-literate elderly users in Japan to participate in crowdwork with minimal efort.\nCertain disabilities are often associated with aging, and prior work has investigated barriers to efective participation in crowdwork in older adults. For instance, Brewer et al [8] report that older adults are more likely to engage in crowdwork, if certain accessibility issues, such as 'unfair' time limits and unclear instructions, are revised. Zyskowski et al. [61] also highlight accessibility issues involving people with disabilities who engage in crowdwork, and they suggest strategies for assisting such users, who may be unaware of crowdwork, in fnding opportunities in this space.", "n_publication_ref": 10, "n_figure_ref": 0}, {"heading": "RESEARCH OBJECTIVES", "text": "Most of the important works in the literature have investigated general accessibility in crowdwork, which provides an essential starting point for our work. To address the gaps in the literature, we set out to achieve the objectives below. We focus on AMT workers based in the US in order to compare demographics with existing research in this area (e.g. [61]) and the US Census Bureau [9].\n(1) Investigate the demographics of users who identify as having a disability and who regularly engage in crowdwork on AMT. (2) Identify how these users are limited by their individual disabilities and how accessibility issues identifed in the literature may be exacerbated given specifc disabilities, such as cognition/mental, vision, hearing, reading and motor/dexterity. (3) Discuss design implications for the AMT platform and HITs, based on our research fndings, in order to enable efective use of the platform by people with disabilities.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "METHOD", "text": "Using a mixed-methods approach, we conducted two surveys and follow-up interviews with survey respondents. Both surveys were administered over a three-week period in the summer of 2020 and were presented to participants as HITs on the AMT platform. The frst survey was a general survey to gain insights into user demographics, including any existing disabilities. The title of the HIT indicated that it was a survey on accessibility in crowdwork. We expected this HIT to attract people who identify as having a disability, in addition to non-disabled people who just wanted to complete the HIT. We then targeted participants who responded in the afrmative in the frst survey as having at least one disability and invited them privately to participate in the second survey, which was only made available to eligible respondents from Survey 1. Note that there was no initial indication in Survey 1 that the participants would be completing another HIT for a further survey. The second survey was a focused survey to gain insights into barriers to the successful completion of HITs based on users' existing disabilities. A secondary beneft for conducting a second focused survey was to eliminate potential bias due to misrepresentation, sometimes done by crowdworkers in order to qualify for a HIT [55] in the competitive crowdwork sphere. We performed consistency checks on the survey results to identify unusual patterns of answers and to confrm that there was a set of sufciently diverse answers [3,23]. Open-ended questions from the focused survey and transcribed interview responses were analyzed using a hybrid process of inductive and deductive thematic analysis methods to develop concepts, themes and interpretations based on the data [13,18]. We frst used a deductive approach to identify data patterns that were relevant to the disability themes of interest to our work. We then used open coding [47] to explore the qualitative data to allow for the discovery of emergent themes, which we had previously not identifed [61].\nPayments for most HITs on AMT are typically low (average of about $2/hr [25]). Our surveys were designed to meet the US federal minimum wage ($7.25/hr) and were presented as separate HITs with $0.25 and $0.20 rewards for Surveys 1 and 2 respectively. Ethics approval was granted for the study by the authors' university research ethics committee.", "n_publication_ref": 8, "n_figure_ref": 0}, {"heading": "Survey 1: General Survey", "text": "The questions in this survey were split into two categories: a) demographic information, such as: age, gender, race, employment status and education level; and b) whether participants identifed as having certain disabilities. The questions on the latter were adapted from the US Census Bureau [6] with some requiring binary answers (yes/no) and others requiring scale-based answers to determine the seriousness of the issue-see example of these questions below:\n• Vision: Do you have serious difculty seeing, even when wearing glasses? (yes, no) To target those participants who may experience accessibility issues when using the AMT platform, we invited participants who responded 'yes' to the binary questions and who responded with 1-4 in the scale-based questions to take part in Survey 2. Survey 1 was completed by 1,000 participants.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Survey 2: Focused Survey", "text": "Survey 2 was presented as a multi-dimensional survey HIT on AMT, with one section for general questions and individual dimensions for each disability category. The general section and one dimension of the survey were completed by 100 eligible participants, on a frstcome-frst-served basis, from each disability category in Survey 1. For instance, 100 participants who reported having visual impairments in Survey 1 completed Survey 2's general questions section and the visual disability component. Therefore there were 600 total responses for all disability categories. Survey 2 was tailored in this way so that participants only needed to complete a survey that was specifc to their identifed disability. In total, 600 responses were received for all disability categories. General questions were focused the following topics:\n(1) Reasons for using AMT.\n(2) Whether earnings from AMT are sufcient for daily living.\n(3) What AMT HITs are difcult to perform, given the participant's identifed disability. (4) Whether performance of AMT HITs induces, or is afected by, anxiety. (5) Whether performance of AMT HITs induces, or is afected by, a feeling of depression.\nIn Survey 2, questions were tailored to identify difculties completing HITs given the participants' identifed disabilities-these included binary, scale and open-ended answers depending on the question (see Table 1). Certain questions were adapted from the US Census Bureau [6,9]. In all of the categories, we asked the participants how their use of AMT was afected by their disability (open-ended) and to ofer suggestions for whether, and how, any identifed issues could be alleviated.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Interviews", "text": "Following the completion of both surveys, we invited participants from Survey 2 to take part in an online interview (using a HIT), in order to capture more detailed information on the barriers to completing HITs on the AMT platform. The fve participants who responded to the interview call were paid $5 in remuneration, which lasted for 30 minutes. Interview questions were focused on the following points: a) difculties completing HITs; b) income; c) work goals; d) user interface; and e) opportunities for improving accessibility. Example questions that we asked are as follows:\n• \"What role does the ability to work from home play in performing crowdwork on AMT?\" • What difculties do you have when completing HITs due to any existing impairment(s)?\" • \"What HITs do you complete and/or avoid as a result of your existing impairment(s)?\n• \"What can Amazon or third party requesters do to help you perform this HIT or alleviate accessibility issues?\"", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "SURVEY 1 FINDINGS", "text": "Based on the results, 626/1,000 (62.6%) of the survey respondents reported having at least one disability-Table 2 shows the percentage of respondents per disability dimension according to the survey. Note that certain people reported having more than one disability. Just over a third (38%) of all respondents reported that they use an assistive device, for example a magnifying tool, sticky keys or text-to-speech reader; this fnding is in line with previous work which found that 39.2% of respondents use assistive devices to participate in crowdwork [61]. In the interest of the current research, we focus on these respondents who identifed as having at least one disability or at least a minor difculty with dexterity (mouse and keyboard).", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Age Distribution", "text": "The distribution of the participants' ages (see Table 3) was skewed towards younger users. This is not surprising since previous work shows a relatively young demographic on AMT [34,53]. However this result is interesting in the sense that the average age of respondents who reported having a disability is identical to that of the general population, despite the increased prevalence of disabilities in older age [61]. Our fndings are contrary to that of Zyskowski et al. [61], where the demographic was relatively skewed towards an older population. However, Zyskowski et al. [61] surveyed individuals using the Cint service [14], and other avenues, who may or may not engage in crowdwork; whereas our participants were all recruited through AMT, and are therefore, more representative of users who identify as disabled and engage in crowdwork.", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "Gender", "text": "Gender was slightly skewed towards males in both the general respondents and those who reported having a disability-see Table 4. The literature describes a demographic skewed in favour of females as of 2010 [34,53]. Our fndings indicate that more males are now using AMT and that participants who identify as having a disability are representative of the general sample. ", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Race", "text": "Participant demographics were heavily skewed towards white userssee Table 5. This is, perhaps, unsurprising given that the distribution of race, as found in this study, is similar to that reported by the ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Education Level", "text": "A majority of the respondents (83%) reported that they have a bachelor's or higher degree, highlighting a relatively literate demographicsee Table 6. Similar to Age, our fndings support the literature, which shows a relatively highly-educated demographic among AMT workers in the US [34,53].", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Employment", "text": "Three quarters of the respondents were permanently employed in some capacity (working for less, or more, than 35 hours a week), while 21% or respondents were self-employed-see Table 7. Almost half of the respondents engaged in work for less than 35 hours a week. Given that almost 80% of the respondents reported that they are permanently employed, the fndings suggest that most of the respondents do not engage in crowdwork as a primary means of employment.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Time Spent Working on AMT", "text": "The amount of time that the respondents spent working on AMT was varied, with most people spending 5-9 (35%) or 10-19 (28%) hours per week and only 13% of respondents spending more than 35 hours a week completing tasks on AMT-see Table 8. This result is not surprising given that, according to the fndings on employment, a majority of the respondents reported being permanently employed.\nUzor, et al. ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Commonly Completed Tasks on AMT in Survey 1", "text": "Table 9 highlights the ratios of the most commonly completed tasks (based on the taxonomy of microtasks defned in [22]) on AMT according to our survey. Note that most participants reported that they performed more than one task. For instance, 69% and 41% of respondents reported that they regularly completed surveys and verifcation and validation tasks respectively.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Location", "text": "Every state in the US, except Maine, Vermont and Wisconsin was represented in the survey among respondents who reported at least one disability. Of the respondents who were geo-located to state level, the highest numbers were from New York (15.2%), California (13.9%), Texas (7.4%), Florida (4.5%) and Illinois (3.8%).", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "SURVEY 2 FINDINGS", "text": "In this section we frst report on the general questions that were available to all of the respondents. Thereafter we discuss the results from the individual survey disabilities that are most likely to afect crowdwork or computer use [16]-vision, hearing, cognition/mental, motor/dexterity and reading.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Working on AMT", "text": "Respondents were asked to state their primary reason(s) for using the AMT platform. Of the choices presented, 74% of all Survey 2 respondents stated that they primarily used AMT because it allowed them to work from home; 33% used AMT to earn a living (with no additional income); 28% used the income from AMT to supplement their existing income from employment, and 23% of respondents reported that they used AMT because they enjoyed completing the HITs.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Difculties Experienced when Completing HITs on AMT", "text": "Respondents were asked to comment on any difculties they have completing HITs on AMT, to which 43% reported that the allocated time for certain HITs was often not enough. There were various reasons why the participants were not satisfed with the allocated time to complete these microtasks. For instance, they felt that HITs often required them to think carefully about responses, however, the time given did not allow them to do this efectively. \"Sometimes the instructions in game type HITs are too complicated for me to understand as the language isn't plain or simple enough. If I fnally understand it, by the time I do there's too little time remaining in the hit [...] and at some point I end up returning it... \" P254 (Hearing impaired user.)\n\"Some long surveys need to be understood and to give wise answers. So it is takes time to complete in the allocated time\" P132 (Motor impaired user.).\nTime was not the only factor that presented difculties to the participants when completing HITs. For instance, the above comment by P254 highlights difculties due to instructions that are perceived as complicated. P600 also felt that difculties can arise when instructions are lacking sufcient information for the successful completion of the task.\n\"Some [HITs] need more time to perform but they will give one or two [HITs] like collect data from websites. Sometimes they don't even give links to collect data. \" P600 (Visually impaired user)", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Efects of Perceived Anxiety and Depression on HIT Completion", "text": "We asked the respondents whether they found task completion difcult for any HITs due to perceived anxiety or depression; 39% and 37% of all Survey 2 respondents responded in the afrmative for perceived anxiety and depression respectively. Note that this does not mean that they had been diagnosed for either condition (e.g. clinical depression), but that they (perceived) one or both conditions as a consequence performing crowdwork.\n6.3.1 Perceived Anxiety. According to P27, the nature of the HIT could induce anxiety in them if it encouraged them to recall a traumatic event.\n\"Sometimes tasks that delve into psychological trauma are too much for me given my background. \" P27 (Cognitively impaired user).\nOther participants stated that anxiety can arise when they feel that their worker reputation is at stake, especially since this reputation can be critical to their reliance on crowdwork for income.\n\"Most [HITs] just induce anxiety these days because you could reject me for no reason and I depend on this site for money.\" P61 (Cognitively impaired user). \"[...]you can have one requester give you some rejections and your approval rating can get low. I like to keep mine above 99.50.\" P400 (Motor impaired user)\nIn addition to presenting other difculties as mentioned in Section 6.2, the allocated time for HITs can induce anxiety, according to one of the respondents.\n\"I feel anxious when trying to race against the timer, even in non game type hits. \" P254 (Hearing impaired user) 6.3.2 Perceived Depression. According to the respondents' feedback, a sense of depression could arise as a result of perceived difculties with completing HITs and the difculties associated with having to do crowdwork in addition to regular employment.\nFor instance, one of the respondents was apprehensive about selecting HITs because they were not sure that they could complete it in time.\n\"Similar to the tasks I fnd difcult completing due to the amount of time, it makes me feel depressed that I'm more likely to return it and see the HITs appear as available and not bother even trying to accept it in the frst place. \" P254 (Hearing impaired user) P61 highlights pressures regarding working for most of the day and having little time for their personal life.\n\"I have to wake up at 2:30 or 3AM to turk for an hour or two before I go work my actual job just to hopefully be able to pay all of my bills. And then I come home and turk. \" P61 (Cognitively impaired user).", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Relationships Between Disability Category and General Issues", "text": "In Table 10, we highlight the number of respondents in each disability category who reported issues in the general category, with respect to difculties completing HITs due to time allocated, perceived anxiety and perceived depression.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Vision Issues", "text": "We asked the participants who reported having a visual impairment whether they found navigating the AMT interfaces difcult due to the visual layout; 54% (54/100) of visually-impaired respondents reported issues in this regard. One respondent's comment provides insights into the factors responsible for these difculties. \"Some elements in surveys like selecting yes or no answer buttons or bullets seems so small to click. [...] We are in rush to fnish the task within time. It is so difcult [to click those buttons] because we may miss clicking it. Those buttons must at least be average in size to [click them]. \" P600 Although 87% of these respondents reported that they could complete an Image Analysis HIT with little difculty, 58% reported difculties completing other HITs as a result of their existing visual impairments.\nWhen asked what could be done to alleviate these difculties, one respondent suggested drawing on their social circle of fellow workers for support.\n\"People are surprisingly willing to give support, if you ask for it in the right way. People performing similar tasks in other rooms could later exchange tips. \" P552", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Hearing Issues", "text": "Most of the participants who reported hearing impairments did not have a serious condition, according to the results. For instance, 87% (87/100) of these respondents stated that they can hear loud speech in a quiet room; 77% stated that they could use a telephone without any special adaptations, and 73% reported that they could follow a conversation against background noise. Regarding completing HITs on AMT, 80% of respondents reported that they could complete an Audio Transcription HIT without difculty. One of the respondents who found this HIT difcult to complete noted that their hearing impairment would not allow them to consider doing this HIT.\n\"I don't think anything can be done due to [the] type and degree of [my condition] (Tinnitus and Sensorineural hearing loss). \" P254 When asked whether the participants found any other HITs difcult to complete due to hearing impairments, 60% responded in the afrmative. Given that most of these respondents could complete an audio transcription task, it seems that issues with audio and hearing were more of a subtle nature. To this efect, P254 also elaborated:\n\"[I fnd difcult, HITs] that require you to notice any other subtle changes in audio for videos... \" P254", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Cognitive/Mental Issues", "text": "Approximately two thirds of participants who reported a cognitive disability appeared to have relatively mild conditions. For instance, 68% (68/100) of these respondents reported that they do not get confused about the time of day or who people are, and 79% could remember and pass on messages. However 45% reported that there were computer-based tasks that were difcult to perform as a result of cognitive issues, with 47% reporting difculties completing HITs on AMT due to their existing cognitive impairment. The following comment highlights a respondent's desire for additional time because they often get distracted while trying to complete HITs:\n\"Some surveys don't allow for enough time but I also would appreciate a longer time limit on most [HITs] because I have ADHD and I often get sidetracked. \" P61", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Motor/Dexterity Issues", "text": "The fndings were consistent regarding dexterity and motor abilities, as 77% (77/100) of these respondents reported being able to turn the knob of a cooker and pick up a pin without difculty, and 69% stated that they could tie laces in a bow. Most of the participants in this category could plug in a USB cable and put on headphones (median = 4, interquartile range = 1) on the difculty scale-1 = extreme difculty; 5 = no difculty.\nRegarding using AMT, 77% of these respondents reported that they encountered difculties when using AMT as a result of existing motor disabilities. No reasonable responses were given to the openended questions for this category; however, further insights can be gained in Section 7: Interview Findings.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Reading Issues", "text": "Two-ffths (40/100 or 40%) of the participants who reported having a reading disability stated that they encountered difculties when completing HITs on AMT due to this disability. One of the respondents who reported having a reading disability highlights a lack of sufcient instructions for a HIT, and he wishes the instructions could be simplifed.\n\"Some tasks must be simplifed for the worker like adding detailed instructions on tasks to complete it properly. \" P212", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "INTERVIEW FINDINGS", "text": "Based on the emergent themes from our analysis, we discuss the fndings from the interviews in this section. Following interviewee quotes, we sufx with their gender, age and reported disability category-for instance, female, 40, motor.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "HITs Most Performed on AMT due to an Existing", "text": "We asked the interviewees if there were any HITs that they performed mostly because of their disabilities. No particular HIT was mentioned as dominant in this case. However, all of the interviewees preferred completing surveys because they are relatively easy to do and ofer better income given the efort. To this efect, P3 comments: \"I try and do a survey because it takes less time and has a better time to money ratio. \" P3 (male, 32, cognition)", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "HITs Avoided on AMT due to an Existing Disability", "text": "We did not fnd a signifcant impact of disabilities on the types of HITs the interviewees most performed. However, since by nature, disabilities limit engagement, the interviewees were more opinionated regarding the type of HITs that were avoided as a result of their existing disability. For instance, P1 reports that he avoids HITs that contain sensitive content on depression and suicide ideation due to his own personal history. \"[The HIT] might bring up things from my past that I don't really want to get into, and it's not really worth it to me to get into that emotional state for a dollar or ffty cents, so I'll just drop them. A lot of times, there would be surveys with disturbing images, I would [normally] avoid those, but sometimes they don't tell you that, and then you get into it and it's like 'well this isn't really that great, I wish I didn't see that one'. \" P1 (male, 35, cognition)\nP2 avoids HITs that require a signifcant amount of time to complete due to a motor disability, as he comments:\n\"I think HITs that are really long and they want you to pay attention for a very long time [...] sometimes my neck [goes into spasms]; so for people who have a problem like this because of their disability, it would be a nightmare for them. \" P2 (male, 35, motor) P3 has difculty understanding instructions, especially if they are numerous and non-simplifed. For fear of having to return the HIT, on failure to complete it, he is apprehensive regarding accepting such HITs in the frst place.\n\"Sometimes if [a game type HIT] has so many instructions, it just makes me anxious because it is just like explaining it three diferent ways, I'm like 'I'm gonna forget and then I'm gonna fail and then I'll have to return the HIT'. \" P3 (male, 32, cognition and hearing)\nP3 also sufers from Tinnitus; therefore, he fnds it difcult to perform HITs that require processing audio.\n\"I get tired really easily and that slows down my reading and comprehension speed. Because I have Tinnitus and Hearing loss, there's a whole bunch of HITs like [audio transcription] or listening to a news article [as part of AI training] that can be difcult.\" P3 (male, 32, cognition and hearing)\nP4 refects on avoiding HITs that involve writing or typing, such as audio or video transcription, due to dyslexia.\n\"I tend not to do much writing because I am terrible at writing; words can reverse themselves or numbers can just change position.\" P4 (male, 38, cognition and reading)\nP4, who has severe difculties in processing numbers, refects on one occasion where, despite being a software developer, he returned a HIT that involved numerical data for training a conversational artifcial intelligence (AI) agent.\n\"I was trying the conversational AI HITs earlier, and it was where you have to follow up conversation and you're supposed to use the knowledge and rearrange it. It got to a point [where there were] a lot of numbers; that's where I quit.\" P4 (male, 38, cognition and reading)", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Qualifcations", "text": "There was a general uncertainty around the requirements for a masters qualifcation on AMT. None of the interviewees had achieved the qualifcation despite using the AMT platform for at least a year, and none of them knew how to obtain the masters qualifcation. This was an issue since the qualifcation allows workers to gain access to higher paid HITs. P5's and P4's comments echo the general sentiment regarding this problem.\n\"[AMT] not hand out their masters qualifcation, they just pay attention to it. The requesters come in and say 'I want the best workers', and no one has [the masters].\" P5 (female, 35, cognition) \"No one knows how to get qualifcations such as masters.\" P4 (male, 38, cognition and reading)", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Time to Complete HITs", "text": "The survey responses highlighted the fact that the allocated time for HITs can present a signifcant barrier for the participants. In the interview, P2 responds that the allocated time often presents a barrier to HIT completion mostly due to his impairment. Given that worker reputation can be afected by unfnished HITs, this can present a signifcant problem for AMT workers.\n\"My jaw pops in and out, so if it's dislocated, my neck will start pulling, and it makes it very hard to look at the computer, so I need to take a break. If I have a lot of HITs in my queue and I'm on a timer, and I'm in an instance where my symptoms fare up, I might have to return some of them, because I just can't do them in the time allotted. \" P2 (male, 35, motor)", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Wages and Income", "text": "All of the interviewees stated that they engage in crowdwork on AMT as a means to earn supplemental income, since they are currently permanently employed. However, none of the interviewees said that the wages were enough given the HITs that they normally performed. P5, who reported sufering from severe anxiety, highlighted experiencing stress in certain situations where she feels unfairly treated through HIT rejections.\n\"A lot of people like to just take your information and go. You put in all this work and you get rejected, so not only do you not get paid but it is a huge negative on your account and it signals other [ ", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Goals", "text": "Three of the interviewees stated that they set goals when using AMT, with income being the key focus of the goal. For P5, who sufers from post-traumatic stress disorder (PTSD) and attention defcit hyperactivity disorder (ADHD), work goals had a more serious efect on anxiety.\n\"I am just a giant ball of anxiety. On a scale of one to ten, I'm always really a ten. It's so frustrating because I know from my personal budget that if I don't hit a goal of at least $10 every day, I defnitely won't have enough money [for daily life]. \" P5 (female, 35, cognition)", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "User Interface (UI)", "text": "When asked about user interface problems, the interviewees felt that as experienced AMT workers, the user interface did not present a problem. However, they felt that they struggled to use the interface as less experienced workers and that new workers would also face the same problems. For instance, P1 highlights issues with the user interface.\n\"[AMT] has a bit of a learning curve to it in order to actually be productive in a way that is in any way shape or form meaningful. Somebody who knows nothing about it, goes to the [AMT] page registers as a worker and then starts trying to work HITs from the [AMT] user interface is going to have a really bad time, because it's hard to fnd HITs that pay well. \" P1 (male, 35, cognition)\nP1 also imagines what certain UI elements, such as a CAPTCHA could present for people with a reading disability.\n\"[There was] a very extreme CAPTCHA...it had like letters in front of letters [...] If someone had reading problems that would have been a little bit hard. \" P1 (male, 35, cognition)\nThe interviewees were asked to comment on potential usability issues using a screenshot of the AMT user homepage, which displays available HITs. Most responses indicated that the interviewees were either used to the platform or used scripts to access HITs (see Section 7.8.3 below), therefore they barely encountered the user home page. However, P3 highlights potential difculties regarding comprehending instructions; P3 suggests redesigning the interface to allow users to hide and view certain interface elements.\n\"I think there's a little too much information on the screen at the same time. I think that it should be optional what you want to see.\" P3 (male, 32, cognition and hearing)", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Improving Accessibility in AMT", "text": "We asked the interviewees to comment on what Amazon and third party sites owned by requesters could do to alleviate the key accessibility issues that they face as AMT workers. We categorize and discuss their responses in this section.\n7.8.1 Standardized Platforms and Tools. P1 felt that there should be a standard set of guidelines and ways to outline certain HITs that are similar, for instance surveys.\n\"At least for basic surveys, it would be nice if they were hosted on the same general platform, because that will help with efciency and also with confusion sometimes. \" P1 (male, 35, cognition) 7.8.2 Disability-Enabled Profiles. In response to encouraging a fairer system, P1 and P2 suggest using profles to distinguish between workers with and without disabilities. For those workers who have disabilities, accommodations can be made to enable them to complete HITs with less difculty. P1 draws comparisons between AMT and Prolifc (a UK-based crowdwork platform) [50], which allows for greater fexibility in tracking HIT time.\n\"If you could update your profle to include that you have disabilities and it can somehow fag your account and to let requesters know and maybe a requester can select an option like 'this person needs a little bit more time', and for people who do have disabilities, their account will be fagged as such. So they would see the extended time and the [non-disabled] people wouldn't, that's something that I think could help. \" P2 (male, 35, motor)\n\"If there was a standard way within the platform to say this is the estimated time that this should take, and that the platform enforced that you should at least give some kind of multiplier to the estimated time [...] On Prolifc there's kind of a diference between when you accept the task and when you start working on the task, whereas on AMT, you accept the task and then the timer starts... I don't know if Amazon cares to make any changes to it. \" P1 (male, 35, cognition) 7.8.3 Tools. We already highlighted, in our study fndings, user frustration regarding fnding HITs that ofer a reasonable income reward. In response to these problems, several tools, such as Turk-erView, HIT Catcher and MTurk Suite, have emerged, which allow workers to manage their AMT account and fnd reasonable HITs. Based on interviewee feedback these tools have become an essential part of their crowdwork workfow.\n\"TurkerView could give you the requester name, the HIT title, it flls in the wage data, how long it took me to complete it; it has fve ratings where I could go from underpaid to generous, and it lets me fll in how much per hour that HIT got me \"MTurk Suite is great, and when I found that, I said 'this is awesome, it will auto search for things and I will tell it any time this HIT from particular requester comes in, grab it for me', I will spend more time working and less time searching. \" P1 (male, 35, cognition) \"Maybe if [Amazon] can build their own HIT Finder and HIT Catcher, that will be the best thing that they can do really. These [tools] are really big quality of life improvements, because you don't really get them with the regular [AMT] dashboard.\" P2 (male, 35, motor) 7.8.4 Community Support. In addition to tools, as highlighted above, community support is also essential to gaining an advantage as a crowdworker on AMT. For instance, P2 comments on the importance of communities for learning about tools that could give them advantage in crowdwork.\n\"If you join communities and take some time to learn the platform with these tools, it could be very, very lucrative. Luckily I was able to get in these communities and read resources to where I could understand, but Amazon does not really do enough to tell you how you can make AMT worth your while [...] It's not intuitive.\" P2 (male, 35, motor)\nGiven, from our fndings, that AMT can be perceived as difcult to use (for new workers) and it requires an efort be made to search for crowdwork communities, we asked the interviewees what the community currently does to reach out to new workers who may need help. P2 responds with the following refection:\n\"Yes and also no, [the community does not reach out to new workers]. For me, I like to look up stuf [...], but for someone who's not like that it's going to be very difcult for them to fnd these resources. \" P2 (male, 35, motor)\nAll but one of the interviewees were active members of one or more crowdwork communities. P4, being a software developer by profession, highlights the importance of participating in the community by helping fellow workers with software tools to enable efective better paid crowdwork.\n\"I use Turkernator, which is created by a fellow Turker; he also created MTurk Suite. I worked closely with him in developing Turkernator. I basically have all of my settings to where I only see the cream of the crop type HITs. I can just click on a HIT and be directed to TurkerView to see whether it is worth my time or not. \" P4 (male, 38, cognition and reading)", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "DISCUSSION", "text": "We discuss our study fndings in light of our research objectiveshighlighted in Section 3.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Demographics of AMT Workers with Disabilities", "text": "Through our frst objective, we sought to highlight the proportion of Mechanical Turk (AMT) workers that identify as having a disability. Our fndings are consistent with the literature in the sense that the average worker is relatively young, educated and employed [17,25,34,49]. However, in our study there seems to be a higher representation of males (57.8%), compared to the higher representation of females indicated in the literature (70% in 2009 [34] and 50+% more recently in 2018 [17,26]), although this could be indicative of the fact that more males responded to the topic of our research in the frst survey HIT.\nOur fndings are also consistent with the literature [26] as we found that, although income was an important reason for participating in crowdwork, AMT workers also do crowdwork for a variety of other reasons such as keeping productive, performing enjoyable tasks and contributing to research. Income was not seen as sufcient for most HITs [25,26] with most survey respondents using crowdwork as a supplemental source of income. However, our participants use tools, such as MTurk Suite, HIT Finder and Turkernator to identify high income HITs and manage their crowdwork workfow. The key beneft of crowdwork, according to our fndings, is that work can be undertaken from home, enabling a fexible and potentially less stressful form of work [60,61].", "n_publication_ref": 12, "n_figure_ref": 0}, {"heading": "Accessibility Issues in AMT", "text": "In our second research objective, we sought to identify how AMT workers are limited by their individual disabilities and how accessibility issues may be exacerbated given specifc disabilities, which are likely to impact computer use-vision, cognition/mental, hearing, reading and motor/dexterity [16]. Two thirds of the respondents from our frst survey reported having at least one disability, or difculty using a computer, thereby presenting potential barriers to completing crowdwork tasks. This has signifcant implications for HCI, and it is not possible to exhaust all of the issues in a single piece of work. Nevertheless, we highlight the key issues as they relate to the individual disability categories.\nOur work echoes the fndings from previous work [61] that the allocated time for crowdwork tasks (or HITs) can be a signifcant barrier for crowdworkers, resulting in increased anxiety and a feeling of depression if HITs cannot be completed in time. In numerous cases, the need for additional time is essential given the limitations aforded by disabilities, such as motor/dexterity or cognition/mental. Key contributors to anxiety include the repercussions of failing to complete HITs on worker reputation, which afects future opportunities for work on the platform.\nA relatively high number of respondents in Survey 2 (37% to 77%) indicated that they encountered some sort of difculty when completing HITs on AMT, due to their disability. Workers with motor/dexterity impairments reported the highest occurrence in this regard (77%), which supports the study by Lund et al. [43] that found physical disabilities to be the most prevalent category. We note in the fndings that most of the issues are also applicable to the general population, for example, wages, HIT completion time, ambiguity regarding qualifcations and the user interface. However, the fact that these issues can be signifcantly exacerbated due to the presence of disabilities, as we report through our fndings, is noteworthy, and this is an important starting point towards improving the design of crowdwork platforms.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Implications for Design", "text": "In our third research objective, we sought to discuss implications for the design of crowdwork platforms and tasks, to enable efective use by people who have disabilities. We found numerous accessibility issues, in both Survey 2 and the interviews, and we consequently discuss implications for design in this section.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Streamlining Workflows in Crowdwork.", "text": "We highlight difculties regarding engaging in crowdwork arising from the following: a) a lack of information, for new and experienced workers, on how to fnd HITs that are lucrative for the worker; b) rigidity in allocated HIT time, especially in certain HITs posted by relatively new requesters, which presents issues for workers with disabilities; and c) a lack of clarity on how to achieve qualifcations necessary to access HITs with higher payments. We suggest that crowdwork platform holders, such as Amazon, streamline the workfow for microtasks, to reduce worker inequities in crowdwork.\nTo mitigate the above issues, we frst suggest that crowdwork platform holders (e.g. Amazon) ensure that instructions are clear, to reduce confusion and promote usability. To mitigate the risk of overloading the user interface, information can be contextualized based on user preferences and relevance. Further, we suggest that suitable warnings are issued on AMT in cases where sensitive material exists-for instance, HITs that discuss suicide ideation (for workers who have a history in this regard) and HITs that involve heavy numerical data (for workers who sufer from dyscalculia).\nSecond, et al. [61] suggest platform holders use metato indicate the kinds of abilities that are suitable for HITs; this could work in the case of popular HITs for which it is obvious that certain abilities are essential, for example, having no hearing impairment when doing an audio transcription HIT. However, it is possible that this solution could lead to complications in more nuanced cases, as found in our work. For instance, a requester may need to specify all of the relevant abilities for their HITs, and there are numerous conditions to cater to, some of which the requester may not even be aware of, such as dyscalculia in AI training tasks. Based on our user feedback, we recommend an additional solution where platform holders take responsibility and integrate such fexibility into user profles. For instance, if a worker has a certain disability, as stated in their profle, they do not get penalized if they cannot complete HITs that might be difcult for them in the allocated time. Instead they are given extra time to complete HITs. As a general rule, the approach taken by Prolifc [50] can be considered in AMT-activating the HIT timer only when a worker begins working on the HIT, rather than when the HIT is accepted.\nThird, in the case of AMT, Amazon should also clarify for workers how to achieve qualifcations, such as the masters, since this is necessary to access higher-paying HITs. One way to do this is to provide some indication of how much progress a worker has made towards achieving certain qualifcations. This could potentially encourage workers to perform more HITs in order to become more qualifed on the platform. 8.3.2 Implementing Useful Functionality. Our survey respondents heavily relied on external tools and scripts to assist them in managing their HITs, for example, fnding and tracking reasonable HITs from reputable requesters. We suggest that Amazon implements important functions provided by these third party tools into the AMT platform in order to promote usability. New workers and workers with disabilities will beneft greatly from this suggestion.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "User Interface Redesign.", "text": "AMT workers in our study remarked that the AMT interface does not regularly get updated, hence they resort to external tools to manage HITs. Using a screenshot of the worker home page, the interviewees identifed potential barriers to usability, such as presenting too much information and using relatively small interface elements, for instance buttons and hyperlinks. Calvo et al. [10], in their 2014 heuristic evaluation of the AMT interface, noted several heuristic violations which could have implications for usability. We suggest that platform holders conduct such evaluations in addition to user studies to reduce potential barriers to efective use.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "8.3.4", "text": "Leveraging the Community. According to our fndings, communities ofer essential support to AMT workers by highlighting useful information on available tools, tips, HITs and social benefts [32]. It can be difcult for new workers to access such communities, mostly due to a lack of awareness. On the one hand, platform holders can promote communities, such as Turker Nation, especially to new workers on the platform. On the other hand communities can, perhaps, make more of an efort to reach out to new workers or workers with disabilities, to help them on their crowdwork journey.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "LIMITATIONS", "text": "First, our work focused on US workers. Given the increasing prevalence of international workers on the AMT platform, especially in India, opportunities exist for further work to explore accessibility in crowdwork with participants from other countries, which we expect could difer from our fndings, given cultural diferences.\nSecond, fve participants responded to our interview call. Our interviewees responded in great depth to accessibility issues that they often face as AMT workers, with regard to their disabilities; this provides useful insights into improving accessibility in crowdwork platforms. However, their opinions represent a subset of the potential barriers to usability in crowdwork platforms in the domain of the explored disability categories. We note here that we experienced difculties recruiting participants for the interview. Similar problems are evident in the literature. For example, Sannon and Cosley [54] interviewed 14 regular AMT participants over a 4-month period. The exact factors contributing to low interview uptake are unclear. We conjecture factors such as anonymity and convenience to play a role, based on anecdotal evidence. For instance, crowdworkers can complete HITs in their own time and pace, and the work is relatively anonymous. On the other hand, an interview requires some degree of organization, rigidity and exposure.\nThird, due to the focus of our work, we explored a set of disability dimensions which are likely to impact computer use [16]. However, there are potentially other disability categories that may negatively impact usability in crowdwork tasks and can be explored in this area, for example, the autism spectrum. This is an opportunity for further work.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "CONCLUSIONS", "text": "Understanding the attitudes and work preferences of crowdworkers is a valuable necessary initial step towards improving design [24]. We sought to identify how crowdworkers with disabilities cope with performing Human Intelligence Tasks (HITs) on the Amazon Mechanical Turk (AMT) platform. We conducted two surveys to understand the key challenges for completing HITs, which could present barriers for efective usability. Following up with interviews, we found that accessibility issues pertaining to various disabilities can afect which HITs crowdworkers perform and avoid.\nBased on our fndings, we highlighted implications for design regarding the AMT platform, many of which could extend to other crowdwork platforms, in order to promote usability and reduce user frustration, especially for workers with disabilities. The most important solutions in this regard include: streamlining crowdwork workfows, implementing functionality from third party tools, a user interface redesign and leveraging community benefts.\nOur work constitutes one important step towards improving accessibility in crowdwork, which is an increasingly important avenue for work, given its potential benefts for users with disabilities, such as work fexibility, additional income, avoiding work commutes and increasing work-from-home opportunities-a necessary option during the current Covid-19 pandemic.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "This work was supported by the EPSRC (grants EP/R004471/1 and EP/S027432/1). Supporting data for this publication is available at https://doi.org/10.17863/CAM.62937.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Cognitively inspired task design to improve user performance on crowdsourcing platforms", "journal": "ACM Press", "year": "2014", "authors": "Rajeev Harini Alagarai Sampath; Bipin Rajeshuni;  Indurkhya"}, {"title": "Amazon Mechanical Turk", "journal": "", "year": "2020-09-11", "authors": ""}, {"title": "Evaluation in the Crowd: An Introduction", "journal": "Springer International Publishing", "year": "2017", "authors": "Daniel Archambault; Helen C Purchase; Tobias Hobfeld"}, {"title": "Testability and validity of WCAG 2.0: the expertise efect", "journal": "ACM Press", "year": "2010", "authors": "Giorgio Brajnik; Yeliz Yesilada; Simon Harper"}, {"title": "Is accessibility conformance an elusive property? A study of validity and reliability of WCAG 2.0", "journal": "ACM Transactions on Accessible Computing", "year": "2012-03", "authors": "Giorgio Brajnik; Yeliz Yesilada; Simon Harper"}, {"title": "Americans With Disabilities", "journal": "", "year": "2010", "authors": "Matthew W Brault"}, {"title": "Work experiences on MTurk: Job satisfaction, turnover, and information sharing", "journal": "Computers in Human Behavior", "year": "2016-01", "authors": "Alice M Brawley; Cynthia L S Pury"}, {"title": "Why anybody do this?\": Understanding Older Adults' Motivations and in Crowd Work", "journal": "ACM", "year": "2016", "authors": "Robin Brewer; Meredith Ringel Morris; Anne Marie Piper"}, {"title": "Evaluating the accessibility of crowdsourcing tasks on Amazon's mechanical turk", "journal": "ACM Press", "year": "2014", "authors": "Rocío Calvo; Shaun K Kane; Amy Hurst"}, {"title": "Separate but equal? A comparison of participants and data gathered via Amazon's MTurk, social media, and face-to-face behavioral testing", "journal": "Computers in Human Behavior", "year": "2013-11", "authors": "Krista Casler; Lydia Bickel; Elizabeth Hackett"}, {"title": "Conducting Clinical Research Using Crowdsourced Convenience Samples", "journal": "Annual Review of Clinical Psychology", "year": "2016-03", "authors": "Jesse Chandler; Danielle Shapiro"}, {"title": "Inductive Coding", "journal": "Springer", "year": "2019", "authors": "Yanto Chandra; Liang Shang"}, {"title": "The Cint Platform", "journal": "", "year": "2020-09-11", "authors": " Cint"}, {"title": "Clickworker Website", "journal": "", "year": "2020-09-11", "authors": " Clickworker"}, {"title": "The Wide Range of Abilities and Its Impact on Computer Technology", "journal": "Forrester Research Inc", "year": "2003", "authors": ""}, {"title": "Demographics and Dynamics of Mechanical Turk Workers", "journal": "ACM Press", "year": "2018", "authors": "Djellel Difallah; Elena Filatova; Panos Ipeirotis"}, {"title": "Demonstrating Rigor Using Thematic Analysis: A Hybrid Approach of Inductive and Deductive Coding and Theme Development", "journal": "International Journal of Qualitative Methods", "year": "2006-03", "authors": "Jennifer Fereday; Eimear Muir-Cochrane"}, {"title": "Inattentive Responding in MTurk and Other Online Samples", "journal": "Industrial and Organizational Psychology", "year": "2015-06", "authors": "Avi Fleischer; Alan D Mead; Jialin Huang"}, {"title": "The Role of MTurk in Education Research: Advantages, Issues, and Future Directions", "journal": "Educational Researcher", "year": "2017-08", "authors": "D ; Jake Follmer; Rayne A Sperling; Hoi K Suen"}, {"title": "Amazon Mechanical Turk: Gold Mine or Coal Mine?", "journal": "Computational Linguistics", "year": "2011-06", "authors": "Karën Fort; Gilles Adda; K Bretonnel Cohen"}, {"title": "A taxonomy of microtasks on the web", "journal": "ACM Press", "year": "2014", "authors": "Ujwal Gadiraju; Ricardo Kawase; Stefan Dietze"}, {"title": "Crowdsourcing Versus the Laboratory: Towards Human-Centered Experiments Using the Crowd", "journal": "Springer International Publishing", "year": "2017", "authors": "Ujwal Gadiraju; Sebastian Müller; Martin Nöllenburg; Dietmar Saupe; Sebastian Egger-Lampl; Daniel Archambault; Brian Fisher"}, {"title": "Turk-Life in India", "journal": "ACM Press", "year": "2014", "authors": "Neha Gupta; David Martin; Benjamin V Hanrahan; Jacki O' Neill"}, {"title": "A Data-Driven Analysis of Workers' Earnings on Amazon Mechanical Turk", "journal": "ACM Press", "year": "2018", "authors": "Kotaro Hara; Abigail Adams; Kristy Milland; Saiph Savage; Chris Callison-Burch; Jefrey P Bigham"}, {"title": "Worker Demographics and Earnings on Amazon Mechanical Turk: An Exploratory Analysis", "journal": "", "year": "2019", "authors": "Kotaro Hara; Abigail Adams; Kristy Milland; Saiph Savage; Benjamin V Hanrahan; Jefrey P Bigham; Chris Callison-Burch"}, {"title": "", "journal": "", "year": "", "authors": "Glasgow Acm;  Scotland Uk"}, {"title": "Combining crowdsourcing and google street view to identify street-level accessibility problems", "journal": "ACM Press", "year": "2013", "authors": "Kotaro Hara; Vicki Le; Jon Froehlich"}, {"title": "Attentive Turkers: MTurk participants perform better on online attention checks than do subject pool participants", "journal": "Behavior Research Methods", "year": "2016-03", "authors": "J David; Norbert Hauser;  Schwarz"}, {"title": "Crowdworking als Phanomen der Koordination digitaler Erwerbsarbeit -Eine interdisziplinare Perspektive", "journal": "Industrielle Beziehungen", "year": "2016", "authors": "Isabell Hensel; Jochen Koch; Eva Kocher"}, {"title": "Crowdsourcing Technology to Support Academic Research", "journal": "Springer International Publishing", "year": "2017", "authors": "Matthias Hirth; Jason Jacques; Peter Rodgers; Ognjen Scekic; Michael Wybrow"}, {"title": "Research in the Crowdsourcing Age, a Case Study: How Scholars, Companies and Workers are Using Mechanical Turk, a \"gig Economy\" Platform, for Tasks Computers Can't Handle", "journal": "Pew Research Center", "year": "2016", "authors": "Paul Hitlin"}, {"title": "Investigating the use of circles in social networks to support independence of individuals with autism", "journal": "ACM Press", "year": "2013", "authors": "Hwajung Hong; Svetlana Yarosh; Jennifer G Kim; Gregory D Abowd; Rosa I Arriaga"}, {"title": "The Rise of Crowdsourcing", "journal": "Wired Magazine", "year": "2006", "authors": " Howe"}, {"title": "Demographics vs Internet Demographics", "journal": "", "year": "2009-09-11", "authors": ""}, {"title": "Design Strategies for Efcient Access to Mobile Device Users via Amazon Mechanical Turk", "journal": "ACM Press", "year": "2017", "authors": "Jason T Jacques; Per Ola Kristensson"}, {"title": "Crowdworker Economics in the Gig Economy", "journal": "ACM Press", "year": "2019", "authors": "Jason T Jacques; Per Ola Kristensson"}, {"title": "Evaluating and improving the usability of Mechanical Turk for low-income workers in India", "journal": "ACM Press", "year": "2010", "authors": "Shashank Khanna; Aishwarya Ratan; James Davis; William Thies"}, {"title": "Crowdsourcing user studies with Mechanical Turk", "journal": "ACM Press", "year": "2008", "authors": "Aniket Kittur; Ed H Chi; Bongwon Suh"}, {"title": "Question-Answer Cards for an Inclusive Micro-tasking Framework for the Elderly", "journal": "Springer", "year": "2013", "authors": "Masatomo Kobayashi; Tatsuya Ishihara; Akihiro Kosugi; Hironobu Takagi; Chieko Asakawa ; David Hutchison; Takeo Kanade; Josef Kittler; Jon M Kleinberg; Friedemann Mattern; John C Mitchell; Moni Naor"}, {"title": "The Global Opportunity in Online Outsourcing", "journal": "", "year": "2015", "authors": "Cecilia Siou Chew Kuek;  Paradi-Guildford"}, {"title": "The relationship between motivation, monetary compensation, and data quality among US-and India-based workers on Mechanical Turk", "journal": "Behavior Research Methods", "year": "2015-06", "authors": "Leib Litman; Jonathan Robinson; Cheskie Rosenzweig"}, {"title": "Distinction without a diference? An assessment of MTurk Worker types", "journal": "Research & Politics", "year": "2020-01", "authors": "Eric Loepp; Jarrod T Kelly"}, {"title": "Using Amazon Mechanical Turk to Recruit Participants With Disabilities. SAGE Research Methods Cases in", "journal": "Psychology", "year": "2018", "authors": "Emily M Lund; Michael R Nadorf; Kate Galbraith; Katie B Thomas"}, {"title": "Crowdsourced Data Management: Industry and Academic Perspectives", "journal": "Foundations and Trends in Databases", "year": "2015", "authors": "Adam Marcus; Aditya Parameswaran"}, {"title": "Being a turker", "journal": "ACM Press", "year": "2014", "authors": "David Martin; Benjamin V Hanrahan; Jacki O Neill; Neha Gupta"}, {"title": "Conducting behavioral research on Amazon's Mechanical Turk", "journal": "Behavior Research Methods", "year": "2012-03", "authors": "Winter Mason; Siddharth Suri"}, {"title": "Coding issues in grounded theory", "journal": "Issues in Educational Research", "year": "2006-01", "authors": "A Moghaddam"}, {"title": "Inside the Turk: Understanding Mechanical Turk as a Participant Pool", "journal": "Current Directions in Psychological Science", "year": "2014-06", "authors": "Gabriele Paolacci; Jesse Chandler"}, {"title": "Running experiments on Amazon Mechanical Turk", "journal": "Decision Making", "year": "2010", "authors": "Gabriele Paolacci; Jesse Chandler; Panagiotis G Ipeirotis"}, {"title": "How Well Do My Results Generalize? Comparing Security and Privacy Survey Results from MTurk, Web, and Telephone Samples", "journal": "", "year": "2019", "authors": "Elissa M Redmiles; Sean Kross; Michelle L Mazurek"}, {"title": "", "journal": "IEEE", "year": "", "authors": ""}, {"title": "Web Content Accessibility Guidelines 2.0: A further step towards accessible digital information", "journal": "Program", "year": "2009-09", "authors": "Mireia Ribera; Merce Porras; Marc Boldu; Miquel Termens; Andreu Sule; Pilar Paris"}, {"title": "Who are the crowdworkers?: shifting demographics in mechanical turk", "journal": "ACM Press", "year": "2010", "authors": "Joel Ross; Lilly Irani; M Six; Andrew Silberman; Bill Zaldivar;  Tomlinson"}, {"title": "Privacy, Power, and Invisible Labor on Amazon Mechanical Turk", "journal": "ACM Press", "year": "2019", "authors": "Shruti Sannon; Dan Cosley"}, {"title": "MTurk Character Misrepresentation: Assessment and Solutions", "journal": "Journal of Consumer Research", "year": "2017-06", "authors": "Kathryn Sharpe Wessling; Joel Huber; Oded Netzer"}, {"title": "A multi-group analysis of online survey respondent data quality: Comparing a regular USA consumer panel to MTurk samples", "journal": "Journal of Business Research", "year": "2016-08", "authors": "M Scott; Catherine A Smith; Linda L Roster; Gerald S Golden;  Albaum"}, {"title": "Cheap and Fast -But is it Good? Evaluating Non-Expert Annotations for Natural Language Tasks", "journal": "", "year": "2020-09-11", "authors": "Rion Snow; Daniel Jurafsky; Andrew Y Ng"}, {"title": "Utility data annotation with Amazon Mechanical Turk", "journal": "", "year": "2008", "authors": "Alexander Sorokin; David Forsyth"}, {"title": "The average laboratory samples a population of 7,300 Amazon Mechanical Turk workers", "journal": "Judgment and Decision Making", "year": "2015", "authors": "Neil Stewart; Christoph Ungemach; J L Adam; Daniel M Harris; Ben R Bartels; Gabriele Newell; Jesse Paolaccik;  Chandler"}, {"title": "", "journal": "", "year": "", "authors": " Uzor"}, {"title": "The Crowd Work Accessibility Problem", "journal": "ACM Press", "year": "2017", "authors": "Saiganesh Swaminathan; Kotaro Hara; Jefrey P Bigham"}, {"title": "Accessible Crowdwork?: Understanding the Value in and Challenge of Microtask Employment for People with Disabilities", "journal": "ACM Press", "year": "2015", "authors": "Kathryn Zyskowski; Meredith Ringel Morris; Jefrey P Bigham; Mary L Gray; Shaun K Kane"}], "figures": [{"figure_label": "", "figure_type": "", "figure_id": "fig_0", "figure_caption": "[...] I also used a tool called Cubicle and it's beautiful. It's practically earned me triple what I made before. I have to pay $20 a month or it, but it allows me to get to where I want to be [fnancially]. \" P5 (female, 35, cognition)", "figure_data": ""}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "• Hearing: Do you have serious difculty hearing? (yes, no) • Cognition/Mental: Because of a physical, mental or emotional condition, do you have serious difculty concentrating, remembering things or making decisions? (yes, no) • Reading: Do you have difculty reading text on the screen, without an assistive device (for example, screen reader / magnifer)? (yes, no)", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Example questions from individual disability dimensions in Survey 2 Dimension Question Cognition/Mental Do you frequently get confused about what day or time it is or where you are? (Binary)", "figure_data": "VisionDo you fnd the AMT interface difcult to navigate? (Binary & Open-ended)HearingCan you understand loud speech in a quiet room? (Binary)Do you have any difculties completing an audio transcription HIT? (Binary & Open-ended)ReadingAre there any HITs that you fnd difcult due to reading limitations (Binary)Motor/DexterityCan you tie a bow in laces or string without difculty? (Binary)How easy/ difcult do you fnd plugging in a USB cable? (Likert scale 1-5)"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_2", "figure_caption": "Number of respondents who reported having a disability in each of the explored dimensions.", "figure_data": "Note: in the motor"}, {"figure_label": "3", "figure_type": "table", "figure_id": "tab_3", "figure_caption": "Age distribution in Survey 1 (General survey)", "figure_data": "AgeAll respondents (%)Respondents with 1+disability (%)Mean34.634.8Median3231SD10.210.8"}, {"figure_label": "4", "figure_type": "table", "figure_id": "tab_4", "figure_caption": "Distribution of Gender in Survey 1 (General survey)", "figure_data": "Gender All respondents (%)Respondents with 1+disability (%)Male57.855.4Female 4244.4Other0.20.2"}, {"figure_label": "5", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "Distribution of Race in Survey 1 (General survey)", "figure_data": "RaceAll respondents (%)Respondents with 1+disability (%)White75.772.6Black13.917.2Asian3.73.7Native3.73.1Hispanic2.21.68Mixed0.80.3Other0.30.37Undeclared 0.30.19US Census Bureau, with the exception of the Hispanic population,which represents about 18.5% of the US population [9]."}, {"figure_label": "6", "figure_type": "table", "figure_id": "tab_6", "figure_caption": "Distribution of Education in Survey 1 (General survey)", "figure_data": "Education LevelAll respondents Respondents with(%)1+ disability (%)Bachelor's77.583.4degree or higherCollege14.712.1High school7.33.9Other0.30.37Primary school0.10None0.10"}, {"figure_label": "7", "figure_type": "table", "figure_id": "tab_7", "figure_caption": "Distribution of Employment in Survey 1 (General survey)", "figure_data": "Employment typeAll respondents Respondents with(%)1+ disability (%)Employed <35 hours 40.544.2Employed 35+ hours 3831.9Self employed16.920.5Unemployed2.20.9Other1.50.9Unable to work0.81.3Retired0.10"}, {"figure_label": "8", "figure_type": "table", "figure_id": "tab_8", "figure_caption": "Total time per week spent completing HITs on AMT in Survey 1 (General survey)", "figure_data": "Number of hours All respondents Respondents with(%)1+ disability (%)Less than 56.16.05 -1029.835.311 -2028.527.821 -3521.117.9More than 3514.512.9"}, {"figure_label": "9", "figure_type": "table", "figure_id": "tab_9", "figure_caption": "Most common HITs completed on AMT in Survey 1 (General survey)", "figure_data": "Employment TypeAll respondents Respondents with(%)1+ disability (%)Survey81.969.4Information42.639.9findingVerification and 40.141.4validationInterpretation and 38.929.9analysisContent creation21.515.5Content access18.89.5"}, {"figure_label": "10", "figure_type": "table", "figure_id": "tab_10", "figure_caption": "Respondents in each category, who report having other issues-difculty completing HITs due to time, perceived anxiety and perceived depression.", "figure_data": "CategoryDifculty Completing HITs (%) Perceived Anxiety (%) Perceived Depression (%)Cognition/Mental474544Vision595654Hearing585654Motor/Dexterity373732Reading483842"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_11", "figure_caption": "requesters] that you are a crappy worker, because this one person decided to reject you. It's really stressful because I could use the extra money [in my current circumstances]. \" P5 (female, 35, cognition)", "figure_data": ""}], "doi": "10.1145/3411764.3445291"}