{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.619998931884766,
      "x2": 298.7433776855469,
      "y1": 338.8651123046875,
      "y2": 553.2130126953125
    },
    "text": "ABSTRACT C-Space is an interactive prototyping platform for collabora tive spatial design exploration. Spatial design projects often begin with conceptualization that includes abstract diagram ming, zoning, and massing to provide a foundation for making design decisions. Specifically, abstract diagrams guide design ers to explore alternative designs without thinking prematurely about the details. However, complications arise when commu nicating ambiguous and incomplete designs to collaborators. To overcome this drawback, designers devote considerable amounts of time and resources into searching for design refer ences and creating rough prototypes to explicate their design concepts better. Therefore, this study proposes C-Space, a novel design support system that integrates the abstract dia gram with design reference retrieval and prototyping through a tangible user interface and augmented reality. Through a user study with 12 spatial designers, we verify that C-Space promotes rapid and robust spatial design exploration, inducing collaborative discussions and motivating users to interact with designs."
  },
  "figures": [{
    "caption": "Figure 12. Inner wall detection algorithm.",
    "captionBoundary": {
      "x1": 104.125,
      "x2": 246.8057098388672,
      "y1": 261.1074523925781,
      "y2": 266.2919921875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "12",
    "page": 5,
    "regionBoundary": {
      "x1": 54.0,
      "x2": 297.0,
      "y1": 172.0,
      "y2": 254.0
    }
  }, {
    "caption": "Figure 14. Design alternative management: (a) checking the 3D model on GUI; (b) guide projection on the grid board.",
    "captionBoundary": {
      "x1": 321.093994140625,
      "x2": 564.1661987304688,
      "y1": 396.66046142578125,
      "y2": 410.8113708496094
    },
    "figType": "Figure",
    "imageText": [],
    "name": "14",
    "page": 5,
    "regionBoundary": {
      "x1": 321.0,
      "x2": 565.0,
      "y1": 322.0,
      "y2": 391.0
    }
  }, {
    "caption": "Figure 13. Material simulation: (a) material selection GUI; (b) projec tion mapping of the materials and real-time rotation.",
    "captionBoundary": {
      "x1": 321.093994140625,
      "x2": 565.4892578125,
      "y1": 284.8714599609375,
      "y2": 299.0223693847656
    },
    "figType": "Figure",
    "imageText": [],
    "name": "13",
    "page": 5,
    "regionBoundary": {
      "x1": 321.0,
      "x2": 565.0,
      "y1": 62.0,
      "y2": 280.0
    }
  }, {
    "caption": "Figure 11. Corner and outer wall detection process.",
    "captionBoundary": {
      "x1": 88.10099792480469,
      "x2": 262.8294677734375,
      "y1": 145.00941467285156,
      "y2": 150.1939697265625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "11",
    "page": 5,
    "regionBoundary": {
      "x1": 54.0,
      "x2": 297.0,
      "y1": 62.0,
      "y2": 138.0
    }
  }, {
    "caption": "Figure 15. Exporting to the BIM format: (a) 3D model created on CSpace; (b) 3D model imported on Autodesk Revit.",
    "captionBoundary": {
      "x1": 53.92900085449219,
      "x2": 298.32403564453125,
      "y1": 135.79042053222656,
      "y2": 149.94134521484375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "15",
    "page": 6,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 298.0,
      "y1": 62.0,
      "y2": 131.0
    }
  }, {
    "caption": "Figure 16. C-Space configuration.",
    "captionBoundary": {
      "x1": 385.2330017089844,
      "x2": 500.02630615234375,
      "y1": 248.34645080566406,
      "y2": 253.531005859375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "16",
    "page": 6,
    "regionBoundary": {
      "x1": 322.0,
      "x2": 564.0,
      "y1": 62.0,
      "y2": 241.0
    }
  }, {
    "caption": "Figure 19. Design outcomes produced by the participants using C-Space.",
    "captionBoundary": {
      "x1": 185.7469940185547,
      "x2": 432.3498229980469,
      "y1": 362.9034729003906,
      "y2": 368.0880126953125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "19",
    "page": 9,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 565.0,
      "y1": 62.0,
      "y2": 356.0
    }
  }, {
    "caption": "Figure 2. Physical modeling components and dimensions: (a) modular building blocks; (b) room marker blocks; (c) a numbering interface; (d) a grid board with an AR marker.",
    "captionBoundary": {
      "x1": 321.093994140625,
      "x2": 564.7001953125,
      "y1": 124.6754379272461,
      "y2": 147.792724609375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "2",
    "page": 2,
    "regionBoundary": {
      "x1": 321.0,
      "x2": 565.0,
      "y1": 62.0,
      "y2": 119.0
    }
  }, {
    "caption": "Figure 17. Analysis of user behaviors using C-Space.",
    "captionBoundary": {
      "x1": 219.86599731445312,
      "x2": 398.2288818359375,
      "y1": 272.6944885253906,
      "y2": 277.8790283203125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "17",
    "page": 7,
    "regionBoundary": {
      "x1": 65.0,
      "x2": 553.0,
      "y1": 62.0,
      "y2": 265.0
    }
  }, {
    "caption": "Figure 4. Floor plan shape analysis.",
    "captionBoundary": {
      "x1": 382.125,
      "x2": 503.1349792480469,
      "y1": 212.22645568847656,
      "y2": 217.4110107421875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "4",
    "page": 3,
    "regionBoundary": {
      "x1": 322.0,
      "x2": 564.0,
      "y1": 62.0,
      "y2": 205.0
    }
  }, {
    "caption": "Figure 5. The main page of C-Space GUI: (a) navigation bar; (b) re trieved design references; (c) selected reference; (d) archived references; (e) design alternatives created by a user.",
    "captionBoundary": {
      "x1": 320.83099365234375,
      "x2": 565.4891967773438,
      "y1": 400.77545166015625,
      "y2": 423.8927307128906
    },
    "figType": "Figure",
    "imageText": [],
    "name": "5",
    "page": 3,
    "regionBoundary": {
      "x1": 321.0,
      "x2": 565.0,
      "y1": 241.0,
      "y2": 396.0
    }
  }, {
    "caption": "Figure 3. Analyzing design reference data.",
    "captionBoundary": {
      "x1": 103.60700225830078,
      "x2": 247.32383728027344,
      "y1": 152.18641662597656,
      "y2": 157.3709716796875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "3",
    "page": 3,
    "regionBoundary": {
      "x1": 54.0,
      "x2": 297.0,
      "y1": 62.0,
      "y2": 145.0
    }
  }, {
    "caption": "Figure 18. User responses in C-Space evaluation survey.",
    "captionBoundary": {
      "x1": 214.32699584960938,
      "x2": 403.7682800292969,
      "y1": 250.04542541503906,
      "y2": 255.22998046875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "18",
    "page": 8,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 565.0,
      "y1": 62.0,
      "y2": 243.0
    }
  }, {
    "caption": "Figure 8. Pseudo-code for calculating similarity value.",
    "captionBoundary": {
      "x1": 350.95001220703125,
      "x2": 534.3102416992188,
      "y1": 164.72242736816406,
      "y2": 169.906982421875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "8",
    "page": 4,
    "regionBoundary": {
      "x1": 322.0,
      "x2": 564.0,
      "y1": 62.0,
      "y2": 158.0
    }
  }, {
    "caption": "Figure 6. Design constraint mapping: (a) image of the surrounding en vironment on screen; (b) projection mapping building site on the grid board.",
    "captionBoundary": {
      "x1": 53.7297477722168,
      "x2": 298.32403564453125,
      "y1": 148.3544464111328,
      "y2": 171.47174072265625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "6",
    "page": 4,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 298.0,
      "y1": 62.0,
      "y2": 143.0
    }
  }, {
    "caption": "Figure 7. Shape-based retrieval method: (a) IR camera-based wall detec tion interface; (b) projection mapping retrieved design reference on the grid board; (c) comparison of retrieved references between two different weighting values.",
    "captionBoundary": {
      "x1": 53.6420783996582,
      "x2": 298.32415771484375,
      "y1": 360.22247314453125,
      "y2": 392.3061218261719
    },
    "figType": "Figure",
    "imageText": [],
    "name": "7",
    "page": 4,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 298.0,
      "y1": 194.0,
      "y2": 355.0
    }
  }, {
    "caption": "Figure 9. Number of rooms-based retrieval method: (a) input interface; (b) retrieved reference samples.",
    "captionBoundary": {
      "x1": 320.83099365234375,
      "x2": 564.9632568359375,
      "y1": 267.1704406738281,
      "y2": 281.32135009765625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "9",
    "page": 4,
    "regionBoundary": {
      "x1": 321.0,
      "x2": 565.0,
      "y1": 193.0,
      "y2": 262.0
    }
  }, {
    "caption": "Figure 10. Room connectivity-based retrieval: (a) input interface; (b) retrieved reference samples.",
    "captionBoundary": {
      "x1": 321.093994140625,
      "x2": 564.7002563476562,
      "y1": 689.220458984375,
      "y2": 703.371337890625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "10",
    "page": 4,
    "regionBoundary": {
      "x1": 321.0,
      "x2": 565.0,
      "y1": 614.0,
      "y2": 684.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.92900085449219,
        "x2": 293.03131103515625,
        "y1": 588.988525390625,
        "y2": 616.90869140625
      },
      "text": "Spatial design; design support system; design collaboration; prototyping; tangible user interface; augmented reality; human-computer interaction."
    }, {
      "page": 0,
      "region": {
        "x1": 55.38298797607422,
        "x2": 295.888427734375,
        "y1": 641.7852783203125,
        "y2": 725.697509765625
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. CHI ’20, April 25–30, 2020, Honolulu, HI, USA. © 2020 Association of Computing Machinery. ACM ISBN 978-1-4503-6708-0/20/04 ...$15.00. http://dx.doi.org/10.1145/3313831.3376452"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 53.92900085449219,
        "x2": 127.75833892822266,
        "y1": 577.902099609375,
        "y2": 583.5330200195312
      },
      "text": "Author Keywords"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 320.5660095214844,
        "x2": 564.1614990234375,
        "y1": 349.1485595703125,
        "y2": 366.911865234375
      },
      "text": "•Human-centered computing → Interactive systems and tools;"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 321.093994140625,
        "x2": 383.3656921386719,
        "y1": 338.8651123046875,
        "y2": 344.4960021972656
      },
      "text": "CCS Concepts"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.9131469726562,
        "y1": 393.10052490234375,
        "y2": 673.0750122070312
      },
      "text": "The most important spatial design ideas, project principles, and fundamental design decisions are developed in the earliest design phase [16, 36]. Spatial design projects such as those of architecture and interior design often begin with the concep tualization that includes abstract diagramming, zoning, and massing to provide a foundation for making design decisions. Specifically, abstract diagrams guide designers to explore al ternative designs without focusing excessively on details [13]. According to Goldschmidt [11], abstraction is a prerequisite to aid design creativity, and it helps designers in transferring only the essential relationships of the design properties. However, ambiguous and incomplete designs can cause communication issues when presented to collaborators. Therefore, designers devote significant amounts of time and resources into search ing for design references and developing rough prototypes to refine their design concepts. The prototyping process also involves communicating design ideas to team members and customers, besides collaborating with other designers [15]. Specifically, in the field of spatial design, the prototyping process is crucial because the design cannot be experienced di rectly until the space is constructed. Hence, designers conduct design explorations to identify better solutions by repeating a quick review via reference searching, conceptualization, and prototyping to address a given design problem. However, three limitations exist for the current design exploration process in spatial design."
    }, {
      "page": 0,
      "region": {
        "x1": 321.093994140625,
        "x2": 564.1660766601562,
        "y1": 684.0095825195312,
        "y2": 700.9710083007812
      },
      "text": "First, the lack of a physical model makes it difficult to share spatial information intuitively. According to Chiu [6], design"
    }, {
      "page": 0,
      "region": {
        "x1": 325.5780029296875,
        "x2": 410.7498474121094,
        "y1": 708.9287109375,
        "y2": 714.3309936523438
      },
      "text": "* Corresponding author"
    }, {
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 1"
    }, {
      "page": 1,
      "region": {
        "x1": 53.92900085449219,
        "x2": 298.6584777832031,
        "y1": 66.32254791259766,
        "y2": 346.296875
      },
      "text": "communication is crucial to the design process for facilitating accurate delivery of information. However, abstract diagram sketches in the early stages of design cannot convey the intent of the designer effectively. Moreover, spatial design utilizes 3D models; therefore, communicating it to design collabora tors is difficult, with ambiguous and incomplete 2D representa tions. Second, creating a physical prototype of a spatial design requires time and resources. Physical models facilitate not only the communication to design collaborators and customers, but also the examination of design ideas and decision-making [10]. Additionally, designers utilize prototypes to refine 3D space design concepts [9, 10], verify constructability [37], and clarify design credibility [10]. Prototyping is necessary during designing; however, it is time-consuming and resourceintensive, which hinders its potential use as a design aid [10], and a prolonged prototyping process may lead to design fixa­ tion [44]. Third, traditional design reference search methods are unsuitable for obtaining spatial design data. Spatial design ers must consider various elements such as user requirements, room properties, and connectivity. Currently, designers pri marily use relevant textual terms to search for references. For example, designers use keywords to search for design refer ences via online search engines such as Google and Pinterest; however, spatial design data is multi-type data with visual in formation. Relevant literatures have identified the limitations of textual search [4, 7, 25, 41] as insufficient and fuzzy [1]."
    }, {
      "page": 1,
      "region": {
        "x1": 53.18199920654297,
        "x2": 298.7369689941406,
        "y1": 357.2315368652344,
        "y2": 538.5759887695312
      },
      "text": "Therefore, this study proposes C-Space, an interactive plat form that assists users in exploring spatial design ideas through a tangible user interface (TUI) and augmented reality (AR). Researchers have developed tools to help users in prototyping the landscape and urban designs through TUI [34, 38] but have not provided features for merging previous references to create new designs. Studies based on AR prototyping con centrate on assisting users in creating a working prototype of an AR application [18, 19, 26, 31, 32]. Unlike previous studies, we propose an interactive and collaborative platform to create new designs with existing references through AR and prototyping features. The interactive design process through C-Space involves the following steps (please refer to Figure 1): 1) retrieving references, 2) discussing and altering references through projection mapping, 3) prototyping design alterna tives with a TUI. With C-Space, users can collaboratively alter sections of design references to create a new design."
    }, {
      "page": 1,
      "region": {
        "x1": 53.599998474121094,
        "x2": 298.6561279296875,
        "y1": 549.5105590820312,
        "y2": 708.93701171875
      },
      "text": "C-Space has three key features. First, it provides relevant building floor plan references from the database. The system uses building shape, number of rooms, and room connectivity for prioritizing the retrievals. The retrieved references are pro jections mapped on a shared platform. A large-scale dataset (N=13,312) of building floor plans was collected for such refer ence retrieval. Second, it provides a tangible experience to the user and facilitates physical manipulation. According to Kim and Maher [21], TUI and physical actions aid spatial cognition by reducing cognitive load for designers during mental visual reasoning. Furthermore, multi-view user participation enables the interactive and rapid exploration of design alternatives in a collaborative environment. Third, it allows users to assess various finishing materials via projection mapping. Although material testing is typically conducted in the later stages, the"
    }, {
      "page": 1,
      "region": {
        "x1": 320.7860107421875,
        "x2": 565.8209228515625,
        "y1": 66.32254791259766,
        "y2": 138.0780029296875
      },
      "text": "system allows material consideration in the early phase. Also, The results of C-Space can be exported in a building informa tion modeling (BIM)-compatible file format. Spatial design projects require multidisciplinary collaboration, necessitating the connection of design knowledge acquired from the early through the later design phases. Thus, the results of C-Space can be seamlessly linked to a later design process."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 321.093994140625,
        "x2": 389.65118408203125,
        "y1": 382.0151062011719,
        "y2": 387.64599609375
      },
      "text": "INTRODUCTION"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 1,
      "region": {
        "x1": 321.093994140625,
        "x2": 399.3079528808594,
        "y1": 158.1551055908203,
        "y2": 163.7860107421875
      },
      "text": "RELATED WORKS"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 320.7860107421875,
        "x2": 565.90869140625,
        "y1": 188.97152709960938,
        "y2": 468.9460144042969
      },
      "text": "Studies based on spatial design support systems focus on the generation of optimized design variations based on predefined objectives at an early stage [8]. However, it is difficult to establish a clear design objective because the design concept, in the early stage, only exists in an abstract form. Min et al. [28] developed a design support system to aid the early spatial design phase by implementing a rule-based approach. Users input abstract properties, and the system recommends design adjustments. However, such a system requires a set of predefined design rules, and thus, it requires extensive prior research. It is suitable when the designer creates a design with similar constraints and objectives but not ideal in conceptual development with abstract diagrams. Furthermore, objectivebased design-generation methods create design starting points instead of the final design outcome [5]. To the best of our knowledge, the design support system for the early design phase in spatial design, utilizing the abstract intentions of the designer and providing an interface to find appropriate design alternatives, has not been investigated yet [27]. It is crucial to utilize abstraction to enhance the understanding of source properties, which plays a key in aiding design creativity [11]. Therefore, identifying an appropriate design reference from a large number of design alternatives is a challenging task. Thus, we propose three design reference retrieval methods to identify a design reference that meets the design requirements of the user from a large dataset."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 321.093994140625,
        "x2": 554.1575317382812,
        "y1": 177.89015197753906,
        "y2": 183.52105712890625
      },
      "text": "Spatial Design Support System for Early Design Phase"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.823974609375,
        "y1": 500.1085205078125,
        "y2": 714.3309936523438
      },
      "text": "In spatial design such as architectural design, physical models are utilized to test and refine design ideas [12]. Additionally, architectural designers utilize physical models to communicate and share design ideas [35]. According to Steffanny [43], digi tal models cannot replace physical models for spatial design because the act of creating a physical model itself is the act of recording and interpreting the design, and design decisions can be taken accordingly [47]. Scale is a crucial factor in ar chitectural design [40]. A scaled physical model provides the designer with highly intuitive and clear relationships between spaces in scale. Therefore, imagining space using a scaled physical model is natural for spatial designers. Yaneva [47] explained the importance of the prototyping a physical model by observing the design process of architects in a professional architecture firm. The architects communicated using a phys ical model and refined the design, and during this process, they naturally experienced the space. Physical modeling on a scale with greater accuracy is required to test the relation ship between spaces and their nuances; however, this activity increases time and resource consumption. Testing finishing"
    }, {
      "page": 1,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 2"
    }, {
      "page": 2,
      "region": {
        "x1": 53.68000030517578,
        "x2": 298.6493225097656,
        "y1": 66.32254791259766,
        "y2": 149.0369873046875
      },
      "text": "materials on the prototype further increases the cost. RoomA live [17] transforms any room into immersive experience by projection mapping the digital contents to the planar surfaces like walls and floors. In this respect, AR can be utilized to test various finishing material on design prototypes. Therefore, this study proposes the C-Space, which enables TUI and AR based intuitive modeling and material simulation features such that designers can explore a vast design space."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 321.093994140625,
        "x2": 445.9690856933594,
        "y1": 489.0231018066406,
        "y2": 494.65399169921875
      },
      "text": "Prototyping in Spatial Design"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.46099853515625,
        "x2": 298.74053955078125,
        "y1": 179.10653686523438,
        "y2": 426.2040100097656
      },
      "text": "TUI is an interaction method that affects digital representation through physical manipulation by the user, enabling better understanding and application of data [30]. MiniStudio, pro posed by Kim et al. [20], used miniature models and AR to design ubicomp spaces. Spatiality is an element that is diffi­ cult to experience without a prototype. MiniStudio enabled designers to better capture the design constraint and domain. Wakita et al. [45] developed SMAAD Surface, a TUI-based tool for prototyping organic forms of architectural mass to help designers in modeling complex shapes intuitively. Another example of the use of TUI in spatial design is the daylight prototyping tool, Heliodon [30], that allows users to under stand daylighting by simulating daylight conditions in built environments using a TUI. Heliodon utilizes TUI to prototype objects that would otherwise be difficult to visualize without physical models. According to Zuckerman and Gal-Oz [49], TUI not only enables intuitive use, but also aids collabora tion. Gu et al. [14] also mentioned that TUI amplifies the effect of design collaboration in the same space by sharing the design changes through tangible interaction. Therefore, applying TUI in spatial design prototyping processes can lead to more intuitive and effective collaborations and improve the understanding of space that designers design."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.92900085449219,
        "x2": 263.3841552734375,
        "y1": 168.0200958251953,
        "y2": 173.6510009765625
      },
      "text": "Tangible User Interface and Design Collaboration"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.56999969482422,
        "x2": 298.7402648925781,
        "y1": 456.2735290527344,
        "y2": 714.3309936523438
      },
      "text": "In the early stages of designing, designers use existing design outcomes as a reference. By exploring similar design cases, they can utilize knowledge from previous examples in current design problems. In this respect, research has been conducted on the development of floor plan retrieval algorithms based on the case-based reasoning (CBR) concept [4, 7, 23, 25, 41]. CBR is a concept wherein a novel solution can be obtained by exploring similar problem cases [22]. The most advanced form of CBR for spatial design is the one that uses semantic fingerprints of buildings. Semantic information of buildings refers to the concept of indexing the numbers and functions of rooms and the connectivity and accessibility of each room by using the hierarchical structure of the building data [24]. For example, a.SCatch is a sketch-based tool that retrieves floor plan images similar to the plan values entered by the user [1, 46]. They introduced an algorithm for searching similar draw ings using the input sketch values and the method of forming a repository by extracting spatial semantics from existing design references. In contrast, MetisCBR uses multiple agents to provide a description of the search process to the user, along with the retrieved outcome [2, 3]. Although the floor plan retrieval method of these state-of-the-art graph-based seman tic fingerprint studies is very powerful, these methods cannot process the floor plan’s shape information. In other words, in"
    }, {
      "page": 2,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.821533203125,
        "y1": 186.28952026367188,
        "y2": 290.9219970703125
      },
      "text": "these methods, similar floor plan drawings can be searched by determining a relationship and functions of spaces, but the shape of the floor plan itself cannot be considered. However, as shape is an important feature of human cognitive activity [48], shape similarity-based floor plan retrieval methods must be developed [42]. Therefore, we propose a novel floor plan search system, and an interface consisting of semantic finger­ print and shape similarity-based retrieval features to better capture and connect abstract intention entered by the user to a design reference created by other designers."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.92900085449219,
        "x2": 169.63145446777344,
        "y1": 445.1881103515625,
        "y2": 450.8190002441406
      },
      "text": "Design Reference Retrieval"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.8204345703125,
        "y1": 326.7605285644531,
        "y2": 387.5580139160156
      },
      "text": "C-Space is a design support system that stands for \"collab orative space\" and \"see [si:] space.\" It consists of six major components: 1) physical modeling components; 2) design reference data analysis; 3) three design reference retrieval methods and interfaces; 4) material simulation; 5) design al ternative management; 6) export to BIM format."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 321.093994140625,
        "x2": 360.18756103515625,
        "y1": 315.67510986328125,
        "y2": 321.3059997558594
      },
      "text": "C-SPACE"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.9118041992188,
        "y1": 423.3965148925781,
        "y2": 714.3309936523438
      },
      "text": "C-Space supports a TUI environment for physical modeling in architectural design, scaled down to 1/30. The physical modeling components consist of modular building blocks, room marker blocks, numbering interface, and grid board. The modular building blocks are used to assemble walls and rooms, and room marker blocks are used to indicate the room types. As illustrated in Figure 2-a, we created three different wall types (20 mm, 40 mm, and 80 mm wide) and three corner types (L, T, and + shaped blocks). A magnet with diameter 3 mm was installed at the bottom of the blocks to prevent them from falling apart. The building blocks have infrared (IR) reflective stickers on the top to enable automatic wall detection. The room markers have color stickers (Figure 2-b). Each color indicates a room type (balcony = green; bathroom = blue; living room = red; entrance = pink; bedroom = yellow). The grid board was made of a steel plate with a total area of 800 mm × 800 mm (Figure 2-d). A single grid unit measured 20 mm × 20 mm, and such units were arranged in 25 rows and columns. The unit size in real scale (600 mm) followed the minimum size of human movement [29, 33]. The grid board could be rotated 360°, and the AR marker on the grid board was used to detect the rotational angle to responsively map design reference and finishing material on the rotating grid board in real time. The numbering interface left to the grid board consists of ’1’, ’2’, ’3’, and ’4 and more’ areas (Figure 2-c). Once the room marker blocks are placed in the number area, C-Space recognizes the number of the input room type."
    }, {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 3"
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 321.093994140625,
        "x2": 456.43292236328125,
        "y1": 412.31109619140625,
        "y2": 417.9419860839844
      },
      "text": "Physical Modeling Components"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.59967803955078,
        "x2": 298.65850830078125,
        "y1": 200.00851440429688,
        "y2": 469.0249938964844
      },
      "text": "The residential building design references were used as re trieval data. We collected 13,312 floor plans of residen tial spaces in Seoul from a web-based real-estate database (r114.co.kr) using a custom-written software in Python. A total of 7,555 floor plans with reliable resolutions were used for the study (Figure 3-a). The collected data were analyzed to index semantic information of the floor plans. The floor plan analysis was performed using Python, OpenCV, and NetworkX libraries. As illustrated in Figure 3, first, a morphological trans formation was performed to remove unnecessary contour lines such as text, hatches, and furniture from the drawing images, and only the wall lines were extracted (Figure 3-a). Then, the edge points that share the same x or y coordinates within the specified threshold were drawn, and each room was extracted in the form of a closed polygon. The room type was classified based on the color detected at the center of each room (Figure 3-b) because the source data was already colored according to the room type. Thereafter, room nodes were created in accordance with the number of rooms. The nodes had their own room type as attributes. The room connectivity was deter mined by room nodes and door connection (Figure 3-c). When a room node is connected to a door, which is also connected to another room node, then the edge between the rooms is assigned. Later, the floor plan shape was extracted though shape analysis (Figure 3-d)."
    }, {
      "page": 3,
      "region": {
        "x1": 53.58000183105469,
        "x2": 298.7437438964844,
        "y1": 479.9585266113281,
        "y2": 661.302978515625
      },
      "text": "The bounding box is defined by connecting the outermost corner points of the building silhouette (Figure 4-a, b), and it is used to determine the aspect ratio of the floor plan shape. Thereafter, we divided the bounding box into 16 grids (Figure 4-c). Then, the shape’s area occupying ratio for each of the 16 grids was calculated. The floor plans were classified into seven types based on the aspect ratio and the 16 area ratios. The classification criteria are variations of those used by Rodrigues et al. [39] (Figure 4-d). The 16 area ratios also used for the shape-based retrieval method to calculate floor plan similarity. The room location is obtained by converting the room center to its relative position using the horizontal and vertical lengths, as shown in equations 1 and 2. The relative coordinates x and y are calculated by subtracting room center coordinate Rx and Ry from the top left corner coordinates, (Tx,Ty). Then, this result is divided by the difference of the bottom-right corner coordinates, (Bx,By), and (Tx,Ty)."
    }, {
      "page": 3,
      "region": {
        "x1": 107.69715118408203,
        "x2": 297.0064697265625,
        "y1": 687.0762329101562,
        "y2": 693.9205322265625
      },
      "text": "Relative x = |Rx − T x|/ |Bx − T x| (1)"
    }, {
      "page": 3,
      "region": {
        "x1": 108.51411437988281,
        "x2": 297.0065002441406,
        "y1": 707.4796752929688,
        "y2": 714.323974609375
      },
      "text": "Relative y = |Ry − Ty|/ |By − Ty| (2)"
    }, {
      "page": 3,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.81494140625,
        "y1": 459.11810302734375,
        "y2": 574.8359985351562
      },
      "text": "System Interface Figure 5 illustrates the main page of C-Space’s GUI. Users can utilize C-Space functions through the navigation bar (Figure 5-a). The retrieved design references are displayed next to the navigation bar (Figure 5-b). When a reference is clicked, the corresponding image is displayed in the center of the GUI and is also simultaneously projected on the grid board (Figure 5-c, Figure 7-b). When the \"Use\" button is clicked, C-Space archives the reference (Figure 5-d). Additionally, users can save and load the design alternatives that they previously cre ated (Figure 5-e)."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.92900085449219,
        "x2": 190.7383575439453,
        "y1": 188.92311096191406,
        "y2": 194.55401611328125
      },
      "text": "Design Reference Data Analysis"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 320.7359924316406,
        "x2": 564.167236328125,
        "y1": 600.2245483398438,
        "y2": 650.06298828125
      },
      "text": "As users start designing with C-Space, the first function that they use is design constraint mapping. Users can check the design constraints both on the monitor and on the grid board (Figure 6). The design constraints consist of information of the building site and the surrounding environment."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 321.093994140625,
        "x2": 429.1391296386719,
        "y1": 589.2243041992188,
        "y2": 594.77001953125
      },
      "text": "Design Constraint Mapping"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.9017333984375,
        "y1": 675.4515380859375,
        "y2": 714.3308715820312
      },
      "text": "C-Space supports three retrieval methods: 1) shape-based, 2) number of rooms-based, and 3) room connectivity-based meth ods. These three retrieval algorithms can be used in parallel. Users can use two or more search methods simultaneously"
    }, {
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 4"
    }, {
      "page": 4,
      "region": {
        "x1": 53.92900085449219,
        "x2": 298.2390441894531,
        "y1": 426.0205383300781,
        "y2": 464.8999938964844
      },
      "text": "depending on the desired conditions. The search results do not include floor plans with full details; instead, we simplified the floor plan image to focus on the visualizations of the shape, type, location, area, and connectivity between rooms."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 321.093994140625,
        "x2": 506.9226379394531,
        "y1": 664.4512939453125,
        "y2": 669.9970092773438
      },
      "text": "Design Reference Retrieval Interface Overview"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.56999969482422,
        "x2": 298.7369689941406,
        "y1": 489.1505432128906,
        "y2": 714.3309936523438
      },
      "text": "A C-Space user can search for a floor plan reference with a similar shape by assembling the outer walls on the grid board using building blocks (Figure 7). In this case, users do not need to complete the outer walls of the desired shape; users only need to assemble the corners of the desired shape on the grid board (Figure 7-a). Additionally, when the corners are correctly recognized, the surface area (m2) is calculated and provided to the user. Unlike other reference retrieval methods, the shape-based method enables users to input the weighting value through the slider GUI to retrieve the floor plan references based on the degree of similarity. The higher the weighting value, the higher the is degree of similarity of the retrieved floor plan (Figure 7-c). The shape-based reference retrieval method is performed in three steps. First, filtering is performed using the shape classification method. Secondly, the references with a similarity degree lower than the weighting value are filtered out. The similarity value is calculated by comparing the averaged differences of the 16 grids between the input floor plan and reference in the dataset (Figure 8). Finally, the references were retrieved based on the similarity values."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.92900085449219,
        "x2": 232.71900939941406,
        "y1": 478.1492919921875,
        "y2": 483.69500732421875
      },
      "text": "Shape-Based Retrieval Method and Interface"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 320.7860107421875,
        "x2": 565.9117431640625,
        "y1": 326.8225402832031,
        "y2": 398.5790100097656
      },
      "text": "To search for references using the number of rooms-based method, users must input the number of rooms per room type by placing the room marker blocks on the numbering interface. Then, the webcam detects the room marker and processes the number of rooms-based retrieval method (Figure 9-a). The system compares the entire dataset with the input information and provides only the matching data to the user (Figure 9-b)."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 321.093994140625,
        "x2": 546.70654296875,
        "y1": 315.8222961425781,
        "y2": 321.3680114746094
      },
      "text": "Number of Rooms-Based Retrieval Method and Interface"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.4038696289062,
        "y1": 423.1585388183594,
        "y2": 593.5440063476562
      },
      "text": "In this method, users can input the relative position of the room by placing a room marker on the grid board. The webcam detects the marker, and if there is an input shape data created with TUI, the relative position of the marker is calculated using the width and length of the floor plan in the dataset. Users can assign the room connectivity by selecting the rooms using the GUI (Figure 10-a). In the room-connectivity search, the entire dataset is first filtered based on connectivity. The purpose of this filtering operation is not to perform graph matching to obtain data identical to the user input but to perform subgraph matching to obtain data including the user input. Therefore, users can retrieve design references that partially match the input room connectivity. Also, the room connectivity-based retrieval method is integrated with the location of the room to sort the retrieved results. This method calculates the sum of distances between the location of the input room and rooms in"
    }, {
      "page": 4,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 5"
    }, {
      "page": 5,
      "region": {
        "x1": 53.92900085449219,
        "x2": 297.0008544921875,
        "y1": 299.75152587890625,
        "y2": 360.5480041503906
      },
      "text": "the database. A shorter distance between the rooms infers that a room of the same type is located near the input room. The sum of distances is sorted in ascending order and displayed to the user. If the connectivity input is not provided, the room location retrieval algorithm operates as a stand-alone algorithm."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 321.093994140625,
        "x2": 549.19921875,
        "y1": 412.15728759765625,
        "y2": 417.7030029296875
      },
      "text": "Room Connectivity-Based Retrieval Method and Interface"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.599998474121094,
        "x2": 298.7382507324219,
        "y1": 384.54254150390625,
        "y2": 587.8049926757812
      },
      "text": "To simulate materials on the physical model, users must com plete the assembly of the building blocks. Then, the pre installed IR camera detects the IR Sticker on the building block, and the system reconstructs a digital 3D model of the building block assembly. To achieve this, C-Space detects the corner, outer, and inner walls of the completed model. Corners are detected using an algorithm that distinguishes between the inner and outer walls based on their areas by examining the surrounding eight grids (Figure 11). Then, the order of the corners is sorted to form a continuous line, and the outer walls are automatically assigned between the corners. For accurate modeling, corners are offset by 8 pixels (7.071 mm) to account for the thickness of the wall. The intersection points of three or more walls are set as starting points for the detection of the inner space. The search process begins from a starting point, and inner corners are identified. Then, other corners of the same space are eliminated to prevent redundant searching. Finally, every corner of the inner space is offset by 26 pixels (21.213 mm)."
    }, {
      "page": 5,
      "region": {
        "x1": 53.92900085449219,
        "x2": 298.6584167480469,
        "y1": 598.7395629882812,
        "y2": 714.3309936523438
      },
      "text": "Users can select and apply finishing materials by using C Space’s GUI (Figure 13-a). The source images for material simulation were collected from an online texture database (tex ture.com). We collected 91 material textures (11 brick, 10 concrete, 11 fabric, 6 plaster, 14 stone, 14 tile, 6 wallpaper, 9 wood, and 10 wood flooring textures). When the \"Map ping\" button on the GUI is pressed, the system reconstructs 3D walls by using two adjacent points among the assembled model input, and a floor is created based on all the corners of each room. We calculated the wall length to crop the selected materials to the real-life scale on each face of the wall. Then,"
    }, {
      "page": 5,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.822265625,
        "y1": 444.988525390625,
        "y2": 516.7449951171875
      },
      "text": "the preinstalled projectors map the reconstructed 3D model with the material texture to the assembled building blocks by adjusting camera FOV, viewpoint location, and rotation. Three projectors (Figure 13-b) were calibrated for material simula tion (two projectors for the walls and one for the floor). The real-time rotation was supported by calculating the rotation angle through the AR marker recognition on the grid board."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.92900085449219,
        "x2": 130.2061767578125,
        "y1": 373.54229736328125,
        "y2": 379.0880126953125
      },
      "text": "Material Simulation"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.7755737304688,
        "y1": 541.4575805664062,
        "y2": 602.2550048828125
      },
      "text": "Users can save the design alternatives that they create; 3D model, material data, floor plan references used to complete the design are saved. Additionally, users can track design generation history through the retrieval tags. Furthermore, C-Space supports guide projection on the grid board to help users in remodeling the saved design alternatives (Figure 14)."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 321.093994140625,
        "x2": 418.2718811035156,
        "y1": 530.457275390625,
        "y2": 536.0029907226562
      },
      "text": "Alternative Management"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 320.7860107421875,
        "x2": 565.90478515625,
        "y1": 631.6155395507812,
        "y2": 714.3309936523438
      },
      "text": "The design alternative created with C-Space can be exported to a BIM file format (Figure 15). The design outcome can be exported as an rvt file, an extension of Autodesk Revit, through the Autodesk Dynamo Studio environment. When the alternative is saved in C-Space, the room types and inner and outer wall information are immediately exported to a csv file. Next, the wall shape is reconstructed in the form of a set of curves comprising the coordinates of the start and end points"
    }, {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 6"
    }, {
      "page": 6,
      "region": {
        "x1": 53.56999969482422,
        "x2": 297.00311279296875,
        "y1": 182.18154907226562,
        "y2": 232.02001953125
      },
      "text": "that are again modeled in curves on Revit and converted into walls using a custom-written Dynamo code. The properties of each room, including the coordinates of the center point and the room type, are subsequently used to assign and define the room after reconstructing the wall in Revit."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 321.093994140625,
        "x2": 412.4347229003906,
        "y1": 620.5300903320312,
        "y2": 626.1610107421875
      },
      "text": "Export to BIM Format"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.18199920654297,
        "x2": 298.37957763671875,
        "y1": 258.9335021972656,
        "y2": 374.5249938964844
      },
      "text": "We implemented C-Space in the predefined lab test condition (Figure 16). Our configuration required the custom-developed C-Space software written in Java and the following hardware: three projectors (NEC NP-3150 with 5000 lumens; Optoma HD65 with 1600 lumen; Panasonic PT-VX420 with 4500 lumens), an IR light, a high-definition (HD) camera, and a custom-made HD IR camera. To detect modular building blocks, we created an HD IR camera with Logitech C920 and a negative film for high resolution images. All the devices were connected to a computer (i7-7800; Nvidia GTX 1660Ti; 16 GB DDR4 RAM) with a 32\" monitor (1920 × 1080)."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.92900085449219,
        "x2": 185.51092529296875,
        "y1": 247.8480987548828,
        "y2": 253.47900390625
      },
      "text": "IMPLEMENTATION & RESULTS"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.599998474121094,
        "x2": 298.7369689941406,
        "y1": 401.43951416015625,
        "y2": 538.948974609375
      },
      "text": "For an objective evaluation of the experiments, two groups of participants were invited: novice designers and professional designers. Then, the participants were grouped into teams. Each team comprised three members, and a total of four teams participated in the experiment (professional team, a and b; novice team, a and b). Participants majoring in interior ar chitecture design were invited as novices and those currently practicing as spatial designers were recruited as professionals (working experience: M=30.667 month, SD=15.946). A total of five males and seven females (P1–P12) in the age range of 22–29 years were recruited; among them, six were novice and the rest were professional designers. Every participant was very familiar with the traditional spatial design process."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.92900085449219,
        "x2": 101.12812805175781,
        "y1": 390.3540954589844,
        "y2": 395.9849853515625
      },
      "text": "User Study"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.56999969482422,
        "x2": 298.74517822265625,
        "y1": 565.862548828125,
        "y2": 714.33056640625
      },
      "text": "The experiment lasted for approximately 4 h. The first 50 min were dedicated to a tutorial session that consisted of a summary of our research and instructions for using C-Space. Participants were given 20–30 min to familiarize themselves with the system. Thereafter, each group performed a design task based on a design brief. The participants aimed to design a residential building based on the design brief that consisted of specific design requirements including site, target user, and user requirements. There were two types of design briefs: the first type for teams \"Professional a\" and \"Novice b,\" and the second type for teams \"Professional b\" and \"Novice a.\" In the first type, a house was to be designed for a retired couple, who use wheelchairs, and their two daughters. In the second type, a house was to be designed for a young"
    }, {
      "page": 6,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.9152221679688,
        "y1": 287.529541015625,
        "y2": 468.8739929199219
      },
      "text": "couple and their little son who requires a room for piano practice. The participants were asked to submit more than one design. They were given approximately 2 h to complete the task. Upon completion, each participant was asked to answer questionnaires. Two indicators were measured in this experiment: system performance and system usability scale (SUS) in the 7-point Likert scale. Then, an in-depth interview was conducted with each participant for approximately 40 min. During the interview, we inquired about the effectiveness of collaboration with their team members using C-Space, which is different from the existing design methods, the role and importance of reference exploration and prototyping in the design process, pros and cons of C-Space compared to the traditional methods. Specifically, participants were asked to compare traditional design approaches (e.g., sketching and 3D tools) with C-Space in terms of time efficiency, usability, and quality."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.92900085449219,
        "x2": 135.1466522216797,
        "y1": 554.777099609375,
        "y2": 560.4080200195312
      },
      "text": "Experiment Design"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 6,
      "region": {
        "x1": 321.093994140625,
        "x2": 422.2439880371094,
        "y1": 486.881103515625,
        "y2": 492.5119934082031
      },
      "text": "Results and Discussion"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.8239135742188,
        "y1": 511.0675354003906,
        "y2": 714.3309936523438
      },
      "text": "As illustrated in Figure 17, the participants consistently used the TUI and GUI. Both novice and professional teams actively discussed and collaborated with their team members during the experiment. It was also observed that the participant behav ior varied across different teams and working processes. This is because C-Space supports both parallel and iterative design processes and not sequential processes. Interestingly, novice and professional groups exhibited significantly different de sign behaviors. The novice group conducted short design brief analysis (light yellow bar) sessions throughout the experiment (Figure 17). In contrast, the professional designers conducted an extensive design brief analysis session at the beginning of the experiment. Additionally, the novice group searched approximately 7,500 references throughout the experiment sessions when the professional group focused on searching for references in the very beginning of the session. This is be cause the professional designers are familiar with developing designs with specific requirements and constraints. During the in-depth interview, professional designers commented that"
    }, {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 7"
    }, {
      "page": 7,
      "region": {
        "x1": 53.674957275390625,
        "x2": 298.65777587890625,
        "y1": 310.73052978515625,
        "y2": 535.9110107421875
      },
      "text": "they thoroughly analyzed design briefs at the beginning of the session to fully understand the design objectives. Then, they focused on searching for and archiving the design refer ences that satisfy their objectives. However, the novice group seemed to understand the design objective as they were de veloping the design concepts. Unlike the professionals, the novices retrieved references with loosely defined filters. We observed that the novice groups primarily used one retrieval method at a time, whereas the professionals used multiple retrieval methods to filter out the unnecessary references. The interview with the novice group revealed that they exhibited a tendency to create aesthetically novel design concepts rather than meeting the design constraints. Despite the different de sign approaches, both novice and professional groups shared positive responses to the impact of C-Space. According to the in-depth interviews with the 12 participants, the contribution of C-Space were categorized as follows: 1) assisting rapid spatial design exploration and development; 2) experiencing space and scale; 3) developing details in the early stage; 4) in ducing collaborative discussion; 5) integration of early design phase to later design phases."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 321.093994140625,
        "x2": 417.4379577636719,
        "y1": 500.0661926269531,
        "y2": 505.6119079589844
      },
      "text": "User Behavior Overview"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.56999969482422,
        "x2": 298.65570068359375,
        "y1": 565.862548828125,
        "y2": 714.3309936523438
      },
      "text": "As per the responses evident in Figure 18, the participants provided a positive assessment of C-Space. In terms of the time required to complete the design outcome, it took 85 min to complete the first design and approximately 20 min to com plete the next one. In other words, it took only 24.09% of the initial design development time to complete the consec utive designs. P9 commented, \"Even in the early stages of the design, there is a shared visual representation, so team design decisions are much faster than traditional methods.\" This is supported by the user response on the system, which significantly helped in making design decisions (Figure 18 Q4: M=5.583, SD=0.900). The participants also gave high scores for satisfaction with the time required to complete the task question (Q2: 6.000, 0.426). P6 commented, \"traditional"
    }, {
      "page": 7,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.5460815429688,
        "y1": 310.78533935546875,
        "y2": 426.3219909667969
      },
      "text": "process requires designers to search, print and lay over the reference on a desk, but C-Space conveniently integrates the separate tasks in a single process.\" Most importantly, the participants were satisfied with the results of C-Space (Q1: 5.250, 1.055). P3 commented, \"I believe that the C-Space is so intuitive and convenient, that anyone can use it right away with a 20-minutes of the tutorial.\" This was well reflected in the ease-of-use questions (Q10: 5.250, 1.215; Q14: 6.167, 0.835). This indicates that C-Space can be easily learned in a single trial, and this allowed for rapid design development with satisfactory design outcomes (Figure 19)."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.92900085449219,
        "x2": 295.5376281738281,
        "y1": 554.8623046875,
        "y2": 560.4080200195312
      },
      "text": "Assisting Rapid Spatial Design Exploration and Development"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.8270263671875,
        "y1": 449.2555236816406,
        "y2": 575.8060302734375
      },
      "text": "The design outcome assembled with modular building blocks was effective in communicating and modifying designs among the team members. The physical model also enabled the partic ipants to experience spatiality when compared with 2D works such as sketches and floor plan drawings. P4 commented, \"The task was to design a space for the disabled, and it was easy to predict the room size with the modular building blocks.\" P5 said, \"the modular building blocks made it easy to measure the size of the room along with wall thickness and the width of the corridor.\" This is well reflected in the user response; users believed that the TUI facilitates the design development process (Q5: 5.417, 1.311)."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 321.093994140625,
        "x2": 443.33294677734375,
        "y1": 438.2552795410156,
        "y2": 443.8009948730469
      },
      "text": "Experiencing Space and Scale"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.9134521484375,
        "y1": 598.7395629882812,
        "y2": 714.3309936523438
      },
      "text": "C-Space can assist the designers in developing design ideas in the early design phase without a concrete design concept. P8 commented, \"It is difficult to develop design concept in the early phase due to lack of concrete idea, but the C-Space was helpful to set the design direction by interacting with the refer ence retrieval system.\" According to user responses, they were highly satisfied with the information provided by the system to complete the task (Q3: 5.583, 1.505). P9 commented that the reference retrieval was especially helpful because they were from the existing design that provided a realistic space layout. P9 also added that they did not utilize the reference directly"
    }, {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 8"
    }, {
      "page": 8,
      "region": {
        "x1": 53.57333755493164,
        "x2": 298.7453918457031,
        "y1": 288.08251953125,
        "y2": 524.2219848632812
      },
      "text": "but used partial layouts from various references. Thus, they were able to create a novel and realistic space layout. Addi tionally, after the design direction was defined, the designers used the three retrieval methods as needed to selectively uti lize the appropriate information among the vast references. P12 responded, \"It was helpful to be able to search gradually, depending on the input condition.\" P8 said, \"C-Space was timeefficient because the reference search using visual language was simpler and faster than keyword search through Pinterest or Google which is widely used reference search process.\" This was well reflected in the user response regarding the im pact of retrieval on design development (Q6: 6.000, 0.853). Further, evaluating the finishing materials through projection mapping allowed users to explore the variations in materials, determining the overall nuance of the design. The participants agreed that material simulation helps in embodying the design concept. However, it was pointed out that the limitation of C-Space was that the windows and doors cannot be articulated, and the performance of the projector used to simulate the ma terial was sub-optimal. Therefore, the user response regarding the material simulation on design concept development was lower than other performance measures. (Q7: 4.250, 1.712)."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 321.093994140625,
        "x2": 468.7436828613281,
        "y1": 587.7393188476562,
        "y2": 593.2850341796875
      },
      "text": "Developing Details in the Early Stage"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.46099853515625,
        "x2": 298.6584777832031,
        "y1": 554.903564453125,
        "y2": 714.3309936523438
      },
      "text": "We observed that discussions were actively conducted in all the four teams. These discussions accounted for 73% of the entire design experiment in the four teams (Figure 17). The in-depth interviews also revealed that C-Space promoted the collaboration, regardless of the relationships among the partic ipants. P10 said, \"I was working with the stranger, and it was awkward in the tutorial. However, we felt like we were getting closer as if we were assembling modular building blocks to gether like Lego.\" P11 replied, \"It was possible to design and evaluate models together without knowing the personality or working style of team members, so there was no problem in col laboration.\" Thus, C-Space is helpful even when unacquainted people collaborate; it promotes multi-user participation. P7 commented, \"It was good that the design idea led to a physical model, which could be shared and modified directly with the"
    }, {
      "page": 8,
      "region": {
        "x1": 320.7860107421875,
        "x2": 565.9105834960938,
        "y1": 288.0861511230469,
        "y2": 425.5920104980469
      },
      "text": "team.\" P10 said, \"Because it is much easier than hand draw ing, anyone can understand it, and it seems to be excellent in communication with non-designers. It was also great to be able to quickly come up with ideas through modeling and instantly modify them.\" We observed users embody design ideas by exploring references in the dataset through C-Space. For example, P10 said, \"I like this reference, but the room is small, let’s combine the two rooms or move the porch,\" and the collaborators started to assemble building blocks to test the new designs over the references projected on the grid board. Thus, C-Space motivates multiple users to collaboratively de velop design ideas by modifying retrieved design references partially or entirely during the early design phase."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.92900085449219,
        "x2": 188.15602111816406,
        "y1": 543.9032592773438,
        "y2": 549.448974609375
      },
      "text": "Inducing Collaborative Discussion"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 320.7359924316406,
        "x2": 565.823974609375,
        "y1": 456.2735290527344,
        "y2": 714.3309936523438
      },
      "text": "According to participant responses, the design alternative man agement feature to archive design references and concepts was helpful. P8 and P10 added that this feature could be signifi­ cantly helpful in the later design phase when designers review previous concepts for reference. Therefore, creating a large set of possible and reliable design alternatives and references was useful to assimilate knowledge acquired from the early design phase to use the same in later design phases. Furthermore, every participant said yes to the question, \"Will the design outcome of the C-Space be exported to a BIM file and run on Autodesk Revit, help with the mid and late design phase?\" P11 said, \"Even when using Revit, there’s a big difference between starting with no initial concept, no site and import ing predefined early design concept. The design development process will be much faster by utilizing the C-Space and Revit together.\" P8 replied, \"Because we have defined the fundamen tals of floor plan through the C-Space, we can further develop details like the position of the door in Revit.\" In the spatial design, BIM is a leading technology helping designers in the mid to late design phases. However, designers still utilize tex tual reference search, sketching, and foam boards for the early design phase. Thus, C-Space can be used to assist designers in the early design phase to allow them to achieve better design outcomes in the later phase of design."
    }, {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 561.5982055664062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 9"
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 321.093994140625,
        "x2": 550.3020629882812,
        "y1": 445.2732849121094,
        "y2": 450.8190002441406
      },
      "text": "Integration of Early Design Phase to Later Design Phases"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 53.619998931884766,
        "x2": 298.73699951171875,
        "y1": 412.3965148925781,
        "y2": 440.3169860839844
      },
      "text": "This study proposed C-Space, a novel design support system for interactive and collaborative spatial design exploration. The contributions of this study are as follows:"
    }, {
      "page": 9,
      "region": {
        "x1": 53.56999969482422,
        "x2": 298.65838623046875,
        "y1": 451.25152587890625,
        "y2": 632.5960083007812
      },
      "text": "First, we created an interactive platform on the collaborative spatial design exploration; the designers were enthusiastic about using C-Space in their practice. C-Space offers a novel way of exploring design spaces. We believe that C-Space represents a novel contribution in the area of interactive ex ploration of large collections of design references, particularly those with information on spatial layout, connectivity, and shape. Second, C-Space offers a collaborative design platform with the integration of useful features, including design ref erence exploration using AR and prototyping using TUI that could enhance collaborative processes and produce satisfac tory design outcomes. The individual features of C-Space may not be novel, but to the best of our knowledge, it is the first to integrate the features into an intuitive system and enable better optimization of formerly conducted design processes. Thus, CSpace can be an example of an integrated collaborative system that motivates designers to interact with designs."
    }, {
      "page": 9,
      "region": {
        "x1": 53.92900085449219,
        "x2": 298.74639892578125,
        "y1": 643.5305786132812,
        "y2": 704.3270263671875
      },
      "text": "However, we identified some limitations of the current CSpace; it only supports orthogonal modeling and a single floor building. These limitations can be overcome in further studies. For example, implementation of tabletop-based shapechanging displays can significantly improve the responsive ness and resolution of the model in the process of prototyping."
    }, {
      "page": 9,
      "region": {
        "x1": 320.6260070800781,
        "x2": 565.9093627929688,
        "y1": 400.93951416015625,
        "y2": 527.489990234375
      },
      "text": "Further, it can resolve the flooring issue, wherein it is difficult to create multiple floors in the current version. Also, the scope of the research can be widened to other types of spaces such as commercial, exhibition, and office spaces. Most importantly, C-Space can be applied to any dataset with spatial layout, con nectivity, and shapes. It can be used in spatial design domains such as urban planning, landscape design, and interior space design for both professional and educational purposes. For future work, C-Space can also be developed as a prototyping tool to design projector-based responsive spaces as RoomA live [17] by adding the AR content information to spatial data. We hope this study inspires future research in this area."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 53.92900085449219,
        "x2": 114.20114135742188,
        "y1": 401.31109619140625,
        "y2": 406.9419860839844
      },
      "text": "CONCLUSION"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 320.7860107421875,
        "x2": 564.1646118164062,
        "y1": 556.6695556640625,
        "y2": 584.5899658203125
      },
      "text": "This work was supported by the Ministry of Education of the Republic of Korea and the National Research Foundation of Korea (NRF-2019S1A5A8034285)."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 321.093994140625,
        "x2": 417.913330078125,
        "y1": 545.5840454101562,
        "y2": 551.2149658203125
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 326.07598876953125,
        "x2": 535.5995483398438,
        "y1": 613.2705688476562,
        "y2": 619.2730102539062
      },
      "text": "[1] Sheraz Ahmed, Markus Weber, Marcus Liwicki,"
    }, {
      "page": 9,
      "region": {
        "x1": 341.89599609375,
        "x2": 564.1692504882812,
        "y1": 624.2294311523438,
        "y2": 674.0679931640625
      },
      "text": "Christoph Langenhan, Andreas Dengel, and Frank Petzold. 2014. Automatic analysis and sketch-based retrieval of architectural floor plans. Pattern Recognition Letters 35 (2014), 91–100. DOI: http://dx.doi.org/10.1016/j.patrec.2013.04.005"
    }, {
      "page": 9,
      "region": {
        "x1": 326.07598876953125,
        "x2": 564.1227416992188,
        "y1": 686.4105834960938,
        "y2": 714.3309936523438
      },
      "text": "[2] Viktor Ayzenshtadt. 2017. Current State and Further Development of a Case-Based Framework for Early Phases of Architectural Conceptual Design. In M. Leyer"
    }, {
      "page": 9,
      "region": {
        "x1": 54.0,
        "x2": 561.5972290039062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 10"
    }, {
      "page": 10,
      "region": {
        "x1": 74.34200286865234,
        "x2": 278.78448486328125,
        "y1": 66.3773422241211,
        "y2": 94.24273681640625
      },
      "text": "(Ed.): Proceedings of the LWDA 2017 Workshops: KDML, FGWM, IR, and FGDB. http://ceur-ws.org, Aachen, Germany, 224–228."
    }, {
      "page": 10,
      "region": {
        "x1": 58.909942626953125,
        "x2": 295.83050537109375,
        "y1": 104.1604995727539,
        "y2": 197.83001708984375
      },
      "text": "[3] Viktor Ayzenshtadt, Christian Espinoza-Stapelfeld, Christoph Langenhan, and Klaus-Dieter Althoff. 2018. Multi-Agent-Based Generation of Explanations for Retrieval Results Within a Case-Based Support Framework for Architectural Design. In Proceedings of the 10th International Conference on Agents and Artificial Intelligence 2018 (ICAART ’18). SCITEPRESS, Setúbal, Portugal, 103–114. DOI: http://dx.doi.org/10.5220/0006650201030114"
    }, {
      "page": 10,
      "region": {
        "x1": 58.90999984741211,
        "x2": 298.7421875,
        "y1": 207.74453735351562,
        "y2": 301.4179992675781
      },
      "text": "[4] Viktor Ayzenshtadt, Christoph Langenhan, Johannes Roith, Saqib Bukhari, Klaus-Dieter Althoff, Frank Petzold, and Andreas Dengel. 2016. Comparative evaluation of rule-based and case-based retrieval coordination for search of architectural building designs. In International Conference on Case-Based Reasoning (ICCBR ’16). Springer, Cham, New York, NY, USA, 16–31. DOI: http://dx.doi.org/10.1007/978-3-319-47096-2_2"
    }, {
      "page": 10,
      "region": {
        "x1": 58.90999984741211,
        "x2": 297.0081481933594,
        "y1": 311.33251953125,
        "y2": 383.0880126953125
      },
      "text": "[5] Erin Bradner, Francesco Iorio, and Mark Davis. 2014. Parameters Tell the Design Story: Ideation and Abstraction in Design Optimization. In Proceedings of the Symposium on Simulation for Architecture & Urban Design (SimAUD ’14). Society for Computer Simulation International, San Diego, CA, USA, Article Article 26, 8 pages."
    }, {
      "page": 10,
      "region": {
        "x1": 58.910438537597656,
        "x2": 294.515869140625,
        "y1": 393.0057678222656,
        "y2": 431.8819885253906
      },
      "text": "[6] Mao-Lin Chiu. 2002. An organizational view of design communication in design collaboration. Design studies 23, 2 (2002), 187–210. DOI: http://dx.doi.org/10.1016/S0142-694X(01)00019-9"
    }, {
      "page": 10,
      "region": {
        "x1": 58.90999984741211,
        "x2": 294.166748046875,
        "y1": 441.7955322265625,
        "y2": 513.552001953125
      },
      "text": "[7] Simon Daum, Andre Borrmann, Christoph Langenhan, and Frank Petzold. 2014. Automated generation of building fingerprints using a spatio-semantic query language for building information models. eWork and eBusiness in Architecture, Engineering and Construction: ECPPM (2014), 87–97. DOI: http://dx.doi.org/10.1201/b17396-18"
    }, {
      "page": 10,
      "region": {
        "x1": 58.90999984741211,
        "x2": 292.7221984863281,
        "y1": 523.465576171875,
        "y2": 562.344970703125
      },
      "text": "[8] Ipek Gursel Dino. 2016. An evolutionary approach for 3D architectural space layout design exploration. Automation in Construction 69 (2016), 131–150. DOI: http://dx.doi.org/10.1016/j.autcon.2016.05.020"
    }, {
      "page": 10,
      "region": {
        "x1": 58.90999984741211,
        "x2": 298.47064208984375,
        "y1": 572.259521484375,
        "y2": 600.1796875
      },
      "text": "[9] Nick Dunn. 2014. Architectural modelmaking (2nd ed.). Laurence King, London, UK, Chapter Why we make models, 6–13."
    }, {
      "page": 10,
      "region": {
        "x1": 53.9286994934082,
        "x2": 290.35107421875,
        "y1": 610.0975341796875,
        "y2": 648.9730224609375
      },
      "text": "[10] Ian Gibson, Thomas Kvan, and Ling Wai Ming. 2002. Rapid prototyping for architectural models. Rapid prototyping journal 8, 2 (2002), 91–95. DOI: http://dx.doi.org/10.1108/13552540210420961"
    }, {
      "page": 10,
      "region": {
        "x1": 53.92900085449219,
        "x2": 298.142822265625,
        "y1": 658.8865356445312,
        "y2": 708.7249755859375
      },
      "text": "[11] Gabriela Goldschmidt. 2011. Avoiding design fixation: transformation and abstraction in mapping from source to target. The Journal of Creative Behavior 45, 2 (2011), 92–100. DOI: http://dx.doi.org/10.1002/j.2162-6057.2011.tb01088.x"
    }, {
      "page": 10,
      "region": {
        "x1": 53.92900085449219,
        "x2": 297.0004577636719,
        "y1": 717.2285766601562,
        "y2": 734.1900024414062
      },
      "text": "[12] Scott D Greenhalgh. 2009. Rapid prototyping in design education: a comparative study of rapid prototyping and"
    }, {
      "page": 10,
      "region": {
        "x1": 342.17498779296875,
        "x2": 552.6248168945312,
        "y1": 66.32254791259766,
        "y2": 83.28387451171875
      },
      "text": "traditional model construction. Master’s thesis. Utah State University, Logan, UT, USA."
    }, {
      "page": 10,
      "region": {
        "x1": 321.0941162109375,
        "x2": 564.165771484375,
        "y1": 93.8193130493164,
        "y2": 165.57501220703125
      },
      "text": "[13] Mark D. Gross and Ellen Yi-Luen Do. 1996. Ambiguous Intentions: A Paper-like Interface for Creative Design. In Proceedings of the 9th Annual ACM Symposium on User Interface Software and Technology (UIST ’96). Association for Computing Machinery, New York, NY, USA, 183–192. DOI: http://dx.doi.org/10.1145/237091.237119"
    }, {
      "page": 10,
      "region": {
        "x1": 321.093994140625,
        "x2": 566.775390625,
        "y1": 176.11050415039062,
        "y2": 236.90802001953125
      },
      "text": "[14] Ning Gu, Mi Jeong Kim, and Mary Lou Maher. 2011. Technological advancements in synchronous collaboration: The effect of 3D virtual worlds and tangible user interfaces on architectural design. Automation in Construction 20, 3 (2011), 270–278. DOI: http://dx.doi.org/10.1016/j.autcon.2010.10.004"
    }, {
      "page": 10,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.2076416015625,
        "y1": 247.44351196289062,
        "y2": 341.11700439453125
      },
      "text": "[15] Björn Hartmann, Scott R. Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective Physical Prototyping through Integrated Design, Test, and Analysis. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST ’06). Association for Computing Machinery, New York, NY, USA, 299–308. DOI: http://dx.doi.org/10.1145/1166253.1166300"
    }, {
      "page": 10,
      "region": {
        "x1": 321.093994140625,
        "x2": 564.0917358398438,
        "y1": 351.65252685546875,
        "y2": 412.4490051269531
      },
      "text": "[16] Jiang Hui. 2015. Approach to the Interior Design Using Augmented Reality Technology. In 2015 Sixth International Conference on Intelligent Systems Design and Engineering Applications (ISDEA). IEEE, Piscataway, NJ, USA, 163–166. DOI: http://dx.doi.org/10.1109/ISDEA.2015.50"
    }, {
      "page": 10,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.8762817382812,
        "y1": 422.9845275878906,
        "y2": 516.6589965820312
      },
      "text": "[17] Brett Jones, Rajinder Sodhi, Michael Murdock, Ravish Mehra, Hrvoje Benko, Andrew Wilson, Eyal Ofek, Blair MacIntyre, Nikunj Raghuvanshi, and Lior Shapira. 2014. RoomAlive: Magical Experiences Enabled by Scalable, Adaptive Projector-Camera Units. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST ’14). Association for Computing Machinery, New York, NY, USA, 637–644. DOI:http://dx.doi.org/10.1145/2642918.2647383"
    }, {
      "page": 10,
      "region": {
        "x1": 321.093994140625,
        "x2": 562.48779296875,
        "y1": 527.194580078125,
        "y2": 620.8679809570312
      },
      "text": "[18] Seokbin Kang, Leyla Norooz, Elizabeth Bonsignore, Virginia Byrne, Tamara Clegg, and Jon E. Froehlich. 2019. PrototypAR: Prototyping and Simulating Complex Systems with Paper Craft and Augmented Reality. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC ’19). Association for Computing Machinery, New York, NY, USA, 253–266. DOI: http://dx.doi.org/10.1145/3311927.3323135"
    }, {
      "page": 10,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.4154052734375,
        "y1": 631.403564453125,
        "y2": 714.1179809570312
      },
      "text": "[19] Annie Kelly, R. Benjamin Shapiro, Jonathan de Halleux, and Thomas Ball. 2018. ARcadia: A Rapid Prototyping Platform for Real-Time Tangible Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article Paper 409, 8 pages. DOI: http://dx.doi.org/10.1145/3173574.3173983"
    }, {
      "page": 10,
      "region": {
        "x1": 54.0,
        "x2": 561.5972290039062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 11"
    }, {
      "page": 11,
      "region": {
        "x1": 53.92900085449219,
        "x2": 296.3089904785156,
        "y1": 66.32254791259766,
        "y2": 138.0780029296875
      },
      "text": "[20] Han-Jong Kim, Ju-Whan Kim, and Tek-Jin Nam. 2016. MiniStudio: Designers’ Tool for Prototyping Ubicomp Space with Interactive Miniature. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16). Association for Computing Machinery, New York, NY, USA, 213–224. DOI: http://dx.doi.org/10.1145/2858036.2858180"
    }, {
      "page": 11,
      "region": {
        "x1": 53.92900085449219,
        "x2": 295.5419006347656,
        "y1": 147.89950561523438,
        "y2": 197.73797607421875
      },
      "text": "[21] Mi Jeong Kim and Mary Lou Maher. 2008. The impact of tangible user interfaces on designers’ spatial cognition. Human Computer Interaction 23, 2 (2008), 101–137. DOI: http://dx.doi.org/10.1080/07370020802016415"
    }, {
      "page": 11,
      "region": {
        "x1": 53.92900085449219,
        "x2": 292.9715270996094,
        "y1": 207.55953979492188,
        "y2": 235.47998046875
      },
      "text": "[22] Janet L Kolodner. 1992. An introduction to case-based reasoning. Artificial Intelligence Review 6, 1 (1992), 3–34. DOI:http://dx.doi.org/10.1007/BF00155578"
    }, {
      "page": 11,
      "region": {
        "x1": 53.92900085449219,
        "x2": 293.5793151855469,
        "y1": 245.30154418945312,
        "y2": 317.05718994140625
      },
      "text": "[23] Christoph Langenhan, Weber Markus, Petzold Frank, and Dengel Andreas Liwicki Marcus. 2011. Sketch-based methods for researching building layouts through the semantic fingerprint of architecture. In Proceedings of the International Conference on Computer Aided Architectural Design Futures 2011. CUMINCAD, 85–102."
    }, {
      "page": 11,
      "region": {
        "x1": 53.92899703979492,
        "x2": 296.9981384277344,
        "y1": 326.8753356933594,
        "y2": 387.67498779296875
      },
      "text": "[24] Christoph Langenhan and Frank Petzold. 2010. The fingerprint of architecture-sketch-based design methods for researching building layouts through the semantic fingerprinting of floor plans. International electronic scientific-educational journal: Architecture and Modern Information Technologies 4, 13 (2010), 1–8."
    }, {
      "page": 11,
      "region": {
        "x1": 53.92950439453125,
        "x2": 296.9014892578125,
        "y1": 397.4931335449219,
        "y2": 458.29400634765625
      },
      "text": "[25] Christoph Langenhan, Markus Weber, Marcus Liwicki, Frank Petzold, and Andreas Dengel. 2013. Graph-based retrieval of building information models for supporting the early design stages. Advanced Engineering Informatics 27, 4 (2013), 413–426. DOI: http://dx.doi.org/10.1016/j.aei.2013.04.005"
    }, {
      "page": 11,
      "region": {
        "x1": 53.92900085449219,
        "x2": 297.4747009277344,
        "y1": 468.11553955078125,
        "y2": 550.8300170898438
      },
      "text": "[26] Blair MacIntyre, Maribeth Gandy, Steven Dow, and Jay David Bolter. 2004. DART: A Toolkit for Rapid Design Exploration of Augmented Reality Experiences. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST ’04). Association for Computing Machinery, New York, NY, USA, 197–206. DOI: http://dx.doi.org/10.1145/1029632.1029669"
    }, {
      "page": 11,
      "region": {
        "x1": 53.92900085449219,
        "x2": 296.9833068847656,
        "y1": 560.6515502929688,
        "y2": 654.3250122070312
      },
      "text": "[27] Justin Matejka, Michael Glueck, Erin Bradner, Ali Hashemi, Tovi Grossman, and George Fitzmaurice. 2018. Dream Lens: Exploration and Visualization of Large-Scale Generative Design Datasets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article Paper 369, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173943"
    }, {
      "page": 11,
      "region": {
        "x1": 53.92900085449219,
        "x2": 298.2494812011719,
        "y1": 664.1465454101562,
        "y2": 722.7869873046875
      },
      "text": "[28] Deedee Aram Min, Kyung Hoon Hyun, Sun-Joong Kim, and Ji-Hyun Lee. 2017. A rule-based servicescape design support system from the design patterns of theme parks. Advanced Engineering Informatics 32 (2017), 77–91. DOI: http://dx.doi.org/10.1016/j.aei.2017.01.005"
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.4112548828125,
        "y1": 66.32254791259766,
        "y2": 138.07757568359375
      },
      "text": "[29] Amartuvshin Narengerel, Sukjoo Hong, Chae-Seok Lee, and Ji-Hyun Lee. 2018. FBSMAP: The Spatial Representation Method for Intelligent Semantic Service in Indoor Environment. In Proceedings of the International Conference of the Association for Computer-Aided Architectural Design Research in Asia 2018 (CAADRIA ’18). CUMINCAD, 587–596."
    }, {
      "page": 11,
      "region": {
        "x1": 321.0941467285156,
        "x2": 564.16162109375,
        "y1": 148.61300659179688,
        "y2": 198.4520263671875
      },
      "text": "[30] Joshua Nasman and Barbara Cutler. 2013. Evaluation of user interaction with daylighting simulation in a tangible user interface. Automation in Construction 36 (2013), 117–127. DOI: http://dx.doi.org/10.1016/j.autcon.2013.08.018"
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 563.4741821289062,
        "y1": 208.98751831054688,
        "y2": 280.7430114746094
      },
      "text": "[31] Michael Nebeling and Katy Madier. 2019. 360proto: Making Interactive Virtual Reality & Augmented Reality Prototypes from Paper. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article Paper 596, 13 pages. DOI:http://dx.doi.org/10.1145/3290605.3300826"
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 565.912841796875,
        "y1": 291.2785339355469,
        "y2": 373.9939880371094
      },
      "text": "[32] Michael Nebeling, Janet Nebeling, Ao Yu, and Rob Rumble. 2018. ProtoAR: Rapid Physical-Digital Prototyping of Mobile Augmented Reality Applications. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article Paper 353, 12 pages. DOI: http://dx.doi.org/10.1145/3173574.3173927"
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 564.6597290039062,
        "y1": 384.529541015625,
        "y2": 401.4908752441406
      },
      "text": "[33] Ernst Neufert and Peter Neufert. 2012. Architects’ data. John Wiley & Sons, Oxford, UK, 447."
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 558.5926513671875,
        "y1": 412.02630615234375,
        "y2": 450.9049987792969
      },
      "text": "[34] Ariel Noyman, Yasushi Sakai, and Kent Larson. 2019. Cityscopear: urban design and crowdsourced engagement platform. (2019). https://arxiv.org/abs/1907.08586"
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 553.2125854492188,
        "y1": 461.4405212402344,
        "y2": 500.32000732421875
      },
      "text": "[35] Chengzhi Peng. 1994. Exploring communication in collaborative design: co-operative architectural modelling. Design studies 15, 1 (1994), 19–44. DOI: http://dx.doi.org/10.1016/0142-694X(94)90037-X"
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 561.760498046875,
        "y1": 510.8555603027344,
        "y2": 560.6929931640625
      },
      "text": "[36] Hannu Penttila. 2007. Early architectural design and BIM. In Computer-Aided Architectural Design Futures (CAADFutures ’07). Springer, Dordrecht, Netherlands, 291–302. DOI: http://dx.doi.org/10.1007/978-1-4020-6528-6_22"
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 564.166015625,
        "y1": 571.2285766601562,
        "y2": 632.0260009765625
      },
      "text": "[37] Roberto Pietroforte, Paolo Tombesi, and Daniel D Lebiedz. 2011. Are physical mock-ups still necessary to complement visual models for the realization of design intents? Journal of Architectural Engineering 18, 1 (2011), 34–41. DOI: http://dx.doi.org/10.1061/(ASCE)AE.1943-5568.0000060"
    }, {
      "page": 11,
      "region": {
        "x1": 321.093994140625,
        "x2": 563.0755615234375,
        "y1": 642.5615234375,
        "y2": 714.3170166015625
      },
      "text": "[38] Ben Piper, Carlo Ratti, and Hiroshi Ishii. 2002. Illuminating Clay: A 3-D Tangible Interface for Landscape Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’02). Association for Computing Machinery, New York, NY, USA, 355–362. DOI: http://dx.doi.org/10.1145/503376.503439"
    }, {
      "page": 11,
      "region": {
        "x1": 54.0,
        "x2": 561.5972290039062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 12"
    }, {
      "page": 12,
      "region": {
        "x1": 53.92900085449219,
        "x2": 296.3787841796875,
        "y1": 66.32254791259766,
        "y2": 138.0780029296875
      },
      "text": "[39] Eugenio Rodrigues, David Sousa-Rodrigues, Mafalda Teixeira de Sampayo, Adelio Rodrigues Gaspar, Alvaro Gomes, and Carlos Henggeler Antunes. 2017. Clustering of architectural floor plans: A comparison of shape representations. Automation in Construction 80 (2017), 48–65. DOI: http://dx.doi.org/10.1016/j.autcon.2017.03.017"
    }, {
      "page": 12,
      "region": {
        "x1": 53.92900085449219,
        "x2": 298.0823974609375,
        "y1": 148.61355590820312,
        "y2": 198.4520263671875
      },
      "text": "[40] Gerard Ryder, Bill Ion, Graham Green, David Harrison, and Bruce Wood. 2002. Rapid design and manufacture tools in architecture. Automation in Construction 11, 3 (2002), 279–290. DOI: http://dx.doi.org/10.1016/S0926-5805(00)00111-4"
    }, {
      "page": 12,
      "region": {
        "x1": 53.92900085449219,
        "x2": 298.2423400878906,
        "y1": 208.98751831054688,
        "y2": 302.6610107421875
      },
      "text": "[41] Qamer Uddin Sabri, Johannes Bayer, Viktor Ayzenshtadt, Syed Saqib Bukhari, Klaus-Dieter Althoff, and Andreas Dengel. 2018. Semi-automated testing of an architectural floor plan retrieval framework: Quantitative and qualitative comparison of semantic pattern-based matching approaches. In International Conference on Pattern Recognition Applications and Methods. Springer, Cham, Germany, 169–189. DOI: http://dx.doi.org/10.1007/978-3-319-93647-5_10"
    }, {
      "page": 12,
      "region": {
        "x1": 53.92900085449219,
        "x2": 296.5980224609375,
        "y1": 313.196533203125,
        "y2": 395.9110107421875
      },
      "text": "[42] David Sousa-Rodrigues, Mafalda Teixeira de Sampayo, Eugenio Rodrigues, Adelio Rodrigues Gaspar, and Alvaro Gomes. 2015. Crowdsourced clustering of computer generated floor plans. In International Conference on Cooperative Design, Visualization and Engineering 2015 (CDVE ’15). Springer, Cham, Germany, 142–151. DOI: http://dx.doi.org/10.1007/978-3-319-24132-6_17"
    }, {
      "page": 12,
      "region": {
        "x1": 53.92900085449219,
        "x2": 296.81707763671875,
        "y1": 406.446533203125,
        "y2": 445.3255920410156
      },
      "text": "[43] Elaine Steffanny. 2009. Design communication through model making: A taxonomy of physical models in interior design education. Master’s thesis. Iowa State University, Ames, IA."
    }, {
      "page": 12,
      "region": {
        "x1": 321.0960388183594,
        "x2": 564.1326904296875,
        "y1": 66.32254791259766,
        "y2": 116.15997314453125
      },
      "text": "[44] Vimal K Viswanathan and Julie S Linsey. 2013. Role of sunk cost in engineering idea generation: an experimental investigation. Journal of Mechanical Design 135, 12 (2013), 121002. DOI: http://dx.doi.org/10.1115/1.4025290"
    }, {
      "page": 12,
      "region": {
        "x1": 321.093994140625,
        "x2": 563.9623413085938,
        "y1": 126.6955337524414,
        "y2": 187.4923095703125
      },
      "text": "[45] Akira Wakita, Akito Nakano, and Michihiko Ueno. 2011. SMAAD surface: A tangible interface for smart material aided architectural design. In Proceedings of the International Conference on Computer Aided Architectural Design Research in Asia 2011 (CAADRIA ’11). CUMINCAD, 355–364."
    }, {
      "page": 12,
      "region": {
        "x1": 321.093994140625,
        "x2": 562.2288208007812,
        "y1": 198.02774047851562,
        "y2": 280.7430114746094
      },
      "text": "[46] Markus Weber, Christoph Langenhan, Thomas Roth-Berghofer, Marcus Liwicki, Andreas Dengel, and Frank Petzold. 2010. a.SCatch: Semantic Structure for Architectural Floor Plan Retrieval. In International Conference on Case-Based Reasoning (ICCBR ’10). Springer, Berlin, Heidelberg, Berlin, Heidelberg, Germany, 510–524. DOI: http://dx.doi.org/10.1007/978-3-642-14274-1_37"
    }, {
      "page": 12,
      "region": {
        "x1": 321.093994140625,
        "x2": 563.2152099609375,
        "y1": 291.2785339355469,
        "y2": 330.1579895019531
      },
      "text": "[47] Albena Yaneva. 2005. Scaling up and down: Extraction trials in architectural design. Social Studies of Science 35, 6 (2005), 867–894. DOI: http://dx.doi.org/10.1177/0306312705053053"
    }, {
      "page": 12,
      "region": {
        "x1": 321.093994140625,
        "x2": 559.9473876953125,
        "y1": 339.28253173828125,
        "y2": 378.1615905761719
      },
      "text": "[48] Dengsheng Zhang and Guojun Lu. 2001. Shape Retrieval Using Fourier Descriptors. In Proceedings of 2nd IEEE Pacific Rim Conference on Multimedia. Springer, 1–9."
    }, {
      "page": 12,
      "region": {
        "x1": 321.093994140625,
        "x2": 556.888916015625,
        "y1": 388.697021484375,
        "y2": 449.4939880371094
      },
      "text": "[49] Oren Zuckerman and Ayelet Gal-Oz. 2013. To TUI or not to TUI: Evaluating performance and preference in tangible vs. graphical user interfaces. International Journal of Human-Computer Studies 71, 7-8 (2013), 803–820. DOI: http://dx.doi.org/10.1016/j.ijhcs.2013.04.003"
    }, {
      "page": 12,
      "region": {
        "x1": 54.0,
        "x2": 561.5972290039062,
        "y1": 750.361572265625,
        "y2": 756.8056030273438
      },
      "text": "Paper 325 Page 13"
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 321.093994140625,
        "x2": 382.3704528808594,
        "y1": 602.6830444335938,
        "y2": 608.31396484375
      },
      "text": "REFERENCES"
    }
  }]
}