{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 54.0,
      "x2": 295.35089111328125,
      "y1": 333.9960021972656,
      "y2": 563.523681640625
    },
    "text": "ABSTRACT We present a new handheld haptic device, Thor’s Hammer, which uses propeller propulsion to generate ungrounded, 3- DOF force feedback. Thor’s Hammer has six motors and propellers that generates strong thrusts of air without the need for physical grounding or heavy air compressors. With its location and orientation tracked by an optimal tracking system, the system can exert forces in arbitrary directions regardless of the device’s orientation. Our technical evaluation shows that Thor’s Hammer can apply up to 4 N of force in arbitrary directions with less than 0.11 N and 3.9° of average magnitude and orientation errors. We also present virtual reality applications that can benefit from the force feedback provided by Thor’s Hammer. Using these applications, we conducted a preliminary user study and participants felt the experience more realistic and immersive with the force feedback. Author Keywords Haptic feedback; ungrounded force feedback; virtual reality; propeller-based feedback."
  },
  "figures": [{
    "caption": "Figure 2. (a) The Thor’s Hammer prototype. (b) Each motor has a three-blade propeller generating an outwards airflow. (c) Thor’s Hammer drive board.",
    "captionBoundary": {
      "x1": 73.91999816894531,
      "x2": 537.4473266601562,
      "y1": 200.20196533203125,
      "y2": 216.84295654296875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "2",
    "page": 2,
    "regionBoundary": {
      "x1": 52.0,
      "x2": 559.0,
      "y1": 61.0,
      "y2": 192.0
    }
  }, {
    "caption": "Figure 8. Four VR applications. (a) Feeling the water, (b) herding a sheep, (c) pushing buttons with different stiffness, and (d) feeling gravity on different planets.",
    "captionBoundary": {
      "x1": 323.4059753417969,
      "x2": 552.7979736328125,
      "y1": 680.56201171875,
      "y2": 707.2830200195312
    },
    "figType": "Figure",
    "imageText": [],
    "name": "8",
    "page": 5,
    "regionBoundary": {
      "x1": 317.0,
      "x2": 559.0,
      "y1": 229.0,
      "y2": 673.0
    }
  }, {
    "caption": "Figure 7. Noise level in room by force magnitude",
    "captionBoundary": {
      "x1": 81.12000274658203,
      "x2": 267.8700256347656,
      "y1": 394.9620056152344,
      "y2": 400.9200134277344
    },
    "figType": "Figure",
    "imageText": [],
    "name": "7",
    "page": 5,
    "regionBoundary": {
      "x1": 54.0,
      "x2": 296.0,
      "y1": 325.0,
      "y2": 393.0
    }
  }, {
    "caption": "Figure 4. (a) Raw force measurements in three axes. (b) Mean force measurements in three axes, starting from 0 N to 4 N with 0.5 N intervals. The line indicates the linear graph y = x.",
    "captionBoundary": {
      "x1": 55.923004150390625,
      "x2": 299.56207275390625,
      "y1": 361.84197998046875,
      "y2": 388.56298828125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "4",
    "page": 4,
    "regionBoundary": {
      "x1": 54.0,
      "x2": 301.0,
      "y1": 60.0,
      "y2": 359.0
    }
  }, {
    "caption": "Figure 5. (a) Measuring acceleration / deceleration time. (b) Acceleration, (c) deceleration time by axis and force change.",
    "captionBoundary": {
      "x1": 55.925994873046875,
      "x2": 299.6009826660156,
      "y1": 587.802001953125,
      "y2": 604.0830078125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "5",
    "page": 4,
    "regionBoundary": {
      "x1": 56.0,
      "x2": 300.0,
      "y1": 400.0,
      "y2": 586.0
    }
  }, {
    "caption": "Figure 6. Intended vs measured force, projected on the (left) X-Z and (right) X-Y plane. Circles denote the intended force vector points red vectors show error.",
    "captionBoundary": {
      "x1": 321.4859924316406,
      "x2": 553.3439331054688,
      "y1": 474.281982421875,
      "y2": 500.5169677734375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "6",
    "page": 4,
    "regionBoundary": {
      "x1": 316.0,
      "x2": 559.0,
      "y1": 346.0,
      "y2": 473.0
    }
  }, {
    "caption": "Figure 3. (a) Measurement setup built with aluminum extrusions and six load cells. (b) Thor’s Hammer prototype was stringed to load cells with steel wires with tensioners.",
    "captionBoundary": {
      "x1": 323.9940185546875,
      "x2": 550.695068359375,
      "y1": 544.4819946289062,
      "y2": 571.0859985351562
    },
    "figType": "Figure",
    "imageText": [],
    "name": "3",
    "page": 3,
    "regionBoundary": {
      "x1": 316.0,
      "x2": 558.0,
      "y1": 417.0,
      "y2": 540.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 198.92796325683594,
        "y1": 584.886474609375,
        "y2": 591.47998046875
      },
      "text": "H.5.2. [User Interfaces]: Haptic I/O."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 181.03497314453125,
        "y1": 573.635986328125,
        "y2": 580.0800170898438
      },
      "text": "ACM Classification Keywords"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 558.0880126953125,
        "y1": 345.13116455078125,
        "y2": 714.8399658203125
      },
      "text": "Virtual reality (VR) allows users to engage with compelling experiences in ways that are otherwise not possible. Advances in graphical processing, displays, IMU integration, and other technologies have enabled highly compelling visual and audio experiences in commodity hardware, even on mobile devices. Despite these recent improvements in visual and auditory output, haptic feedback has yet to see the same degree of adoption. While some VR technologies use vibrotactile actuators to induce tactile haptic feedback, these technologies fail to elicit the experience of continuous force, such as feeling an object’s weight or an otherwise tugging of the hand. This feeling of the continuous force is sensed through a kinesthetic sensation, and the classes of haptic devices that can simulate continuous forces are generally referred to as force feedback or kinesthetic haptic devices. While there has been extensive research on developing force feedback devices, enabling force feedback in immersive VR environments is still challenging. This is because most force feedback devices require grounding, i.e., they need to be attached to a heavy object or otherwise fixed in place in order to be able to produce the forces needed and withstand reciprocal kickback [18,37,42,43]. Approaches to grounded force feedback include the use of mechanical joints [5,9,12,42,43], wires that are pulled [3,18], air jet actuators [30,31,34] or electromagnets [35,37]. While such methods can provide realistic and compelling force feedback in place, we are interested in exploring ungrounded force feedback to enable more mobile use cases. Grounded devices enable the administering of strong and accurate forces, but come with the caveat that they have to be located in the vicinity of the grounded structure. Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from Permissions@acm.org. CHI 2018, April 21–26, 2018, Montreal, QC, Canada. Copyright is held by the owner/author(s). Publication rights licensed to ACM. ACM. ISBN 978-1-4503-5620-6/18/04…$15.00 DOI: https://doi.org/10.1145/3173574.3174099"
    }, {
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 1"
    }, {
      "page": 1,
      "region": {
        "x1": 54.0,
        "x2": 295.3309326171875,
        "y1": 63.72648620605469,
        "y2": 592.463134765625
      },
      "text": "Researchers have previously developed several ways to create ungrounded force feedback by, for example, making the grounding structure worn on the back [19,27], producing haptic illusions via asynchronous oscillations [4,28], or using electrical muscle stimulation (EMS) [14,23–25]. These methods, however, have several limitations. Creating force feedback by pushing against a frame worn on the body requires users to wear a large and heavy device [19,27] and creates an unintended kickback in reaction to the intended feedback force. Simulating force feedback via haptic illusions [4,28] severely limits the strength of the perceived forces (< 0.3 N), which may further diminish when such methods are used for multidimensional forces [28]. As EMS methods [14,23,25] require users to attach electrodes to their body, they require a calibration procedure prior to use, and their output is limited to forces in the direction of one’s muscular alignment. This paper presents Thor’s Hammer, an ungrounded 3-DOF force feedback device that can create large and continuous forces using propeller propulsion (Figure 1a). Propeller propulsion is a method of creating thrust by pushing air using a rotating propeller. Thor’s Hammer orients its propulsion force with three degrees of freedom, by using three pairs of opposing propellers that have been mounted onto the device and oriented orthogonally to one another (Figure 1b). Each propeller may be rotated to provide force in one of the cardinal directions, or in arbitrary force vectors by coordinating their propulsion. A technical evaluation of Thor’s Hammer demonstrated that it can create 4 N of force in three dimensions with an RMSE of less than 0.11 N. Force vectors may be oriented arbitrarily, with an RMSE of less than 3.9°. Despite these advantages, there are disadvantages to the approach: the reliance on propellers for generating force provides latency (309.4 ms on average), and the arrangement requires an apparatus that is physically larger than typical VR controllers. We developed VR scenarios where a user experiences the buoyancy and drag of the water flow, the tugging of a leashed animal, the resistance of a button that has been pressed, and the weight of an object. We also conducted a user study to examine users’ impressions of the force feedback provided by Thor’s Hammer in enhancing these experiences. Participants found the device’s force feedback to be realistic and improved the immersive experience of the VR. In this paper, we thus make the following contributions:"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 316.79998779296875,
        "x2": 385.6860656738281,
        "y1": 333.9960021972656,
        "y2": 340.44000244140625
      },
      "text": "INTRODUCTION"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 1,
      "region": {
        "x1": 54.059906005859375,
        "x2": 295.22137451171875,
        "y1": 601.3474731445312,
        "y2": 619.4647216796875
      },
      "text": "1. A demonstration of a propeller-based 3-DOF ungrounded force-feedback device."
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 1,
      "region": {
        "x1": 54.05987548828125,
        "x2": 255.97909545898438,
        "y1": 625.35107421875,
        "y2": 631.944580078125
      },
      "text": "2. A technical evaluation of our implementation."
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 1,
      "region": {
        "x1": 54.05987548828125,
        "x2": 295.43060302734375,
        "y1": 637.8309326171875,
        "y2": 655.9481811523438
      },
      "text": "3. A discussion of design considerations given the technical tradeoffs of our device."
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 72.05760192871094,
        "x2": 190.95013427734375,
        "y1": 673.3582763671875,
        "y2": 679.9517822265625
      },
      "text": "in enhancing VR experiences."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 54.05987548828125,
        "x2": 295.1517028808594,
        "y1": 661.8345336914062,
        "y2": 668.4280395507812
      },
      "text": "4. A user study demonstrating the role of Thor’s Hammer"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 316.79998779296875,
        "x2": 558.1109008789062,
        "y1": 73.80650329589844,
        "y2": 114.2540283203125
      },
      "text": "To place Thor’s Hammer within the context of existing literature, we focus our review on techniques for inducing body-grounded and ungrounded force feedback that allow moving with the device."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 316.79998779296875,
        "x2": 390.1409912109375,
        "y1": 62.915985107421875,
        "y2": 69.3599853515625
      },
      "text": "RELATED WORK"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 316.7999572753906,
        "x2": 558.1206665039062,
        "y1": 135.00645446777344,
        "y2": 242.903076171875
      },
      "text": "Wearable force feedback devices create force against a wearer’s body, allowing the workspace to move with the wearer. Torso-grounded devices [19,27] are worn on a user’s back and use motors to pull tension wires attached to a haptic handle through a rigid frame that extends around the workspace in front of the wearer’s body. The use of wires makes the device lighter than using a robotic linkage, however, it requires a frame larger than the required workspace, making it cumbersome to wear because the wires can only pull the haptic feedback handle."
    }, {
      "page": 1,
      "region": {
        "x1": 316.800048828125,
        "x2": 558.0909423828125,
        "y1": 253.5664520263672,
        "y2": 339.023193359375
      },
      "text": "Hand-grounded force feedback devices [8,10,13,20,44,45] allow users to experience the sensation of grasping. Some haptic gloves [8,13] provide passive force feedback by using a brake instead of a motor to stop movement of the fingers, thus making the device lighter and more robust to strong grasping. While these gloves are small and lightweight, they can only create forces that act upon the hand, unless of course, used in combination with other grounded devices."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 316.79998779296875,
        "x2": 464.364013671875,
        "y1": 124.11599731445312,
        "y2": 130.55999755859375
      },
      "text": "Wearable Force Feedback Devices"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 316.78997802734375,
        "x2": 558.0909423828125,
        "y1": 359.7664794921875,
        "y2": 467.79254150390625
      },
      "text": "Gyroscopic effects, in which a spinning wheel tries to conserve energy by rotating the wheel perpendicular to the spinning axis, can also be used to create force feedback. As gyroscopic effects can be made without any grounding structure, they have been used to provide haptic feedback on mobile devices [6,26], handheld haptic controller [38,40], and VR head-mounted displays [16]. Winfree et al. [38] implemented a handheld device with motors controlling two gimbals and showed that it could create torque in arbitrary directions on two axes with a maximum torque of 1.2 Nm."
    }, {
      "page": 1,
      "region": {
        "x1": 316.79998779296875,
        "x2": 558.0211791992188,
        "y1": 478.4796447753906,
        "y2": 552.6517333984375
      },
      "text": "Using gyroscope-based force feedback techniques, however, can only create torque in up to two axes, as the flywheel rotation cannot be used to create torque. An additional complication of the approach is that increasing the torque magnitude without increasing the weight or the size of device can also be challenging as the moment of inertia is determined by the weight and the radius of the flywheel."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 316.79998779296875,
        "x2": 546.4441528320312,
        "y1": 348.8760070800781,
        "y2": 355.32000732421875
      },
      "text": "Ungrounded Force Feedback with Gyroscopic Effects"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 316.78997802734375,
        "x2": 558.0510864257812,
        "y1": 573.3665161132812,
        "y2": 670.1079711914062
      },
      "text": "Researchers have demonstrated the use of asynchronous periodic oscillation to create the sense of pulling or pushing due to the nonlinear nature of our tactile perception [2,19,22]. As vibrotactile actuators are small and ungrounded, the use of haptic illusions may be a viable solution for mobile force feedback scenarios. However, illusion-based force feedback is limited, as perceived force magnitudes are small (< 0.3 N) and often diminish for multidimensional forces [28]."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 316.79998779296875,
        "x2": 480.9058837890625,
        "y1": 562.35595703125,
        "y2": 568.7999877929688
      },
      "text": "Force Feedback using Haptic Illusions"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 316.79998779296875,
        "x2": 557.971435546875,
        "y1": 687.8464965820312,
        "y2": 716.8798828125
      },
      "text": "Instead of creating actual forces to act on muscles, researchers have found that stimulating the muscles themselves using electric signals can be a viable way to"
    }, {
      "page": 1,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 2"
    }, {
      "page": 2,
      "region": {
        "x1": 53.97010803222656,
        "x2": 295.29095458984375,
        "y1": 228.7264862060547,
        "y2": 291.6138916015625
      },
      "text": "create the perception of force feedback [14,23] and enable weight perception [24,25]. EMS-based techniques have the benefits of being small and lightweight, however, these methods cannot generate standardized force feedback, e.g., simulating 2 N of force or 300 g of weight. They also require users to wear electrodes on their body."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 316.79998779296875,
        "x2": 441.3329162597656,
        "y1": 676.8360595703125,
        "y2": 683.280029296875
      },
      "text": "Electro-Muscular Stimulation"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.95024108886719,
        "x2": 295.17144775390625,
        "y1": 312.60650634765625,
        "y2": 443.07244873046875
      },
      "text": "Of greatest relevance to our work are devices that generate forces by releasing high-pressure air through nozzles. AirWand [29] is a pen-shaped device with two air nozzles aligned on a single axis facing opposite directions. The device can generate up to 3.16 N of continuous force along one axis by releasing compressed air through a nozzle. Furthermore, AirGlove [17] is a hand-worn device that has six air nozzles that can exert up to 7.3 N of force in three dimensions. However, the air jets used in such devices require a heavy air compressor to produce high-pressure compressed air, which makes it difficult for them to be mobile and worn by users."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 179.5139923095703,
        "y1": 301.71600341796875,
        "y2": 308.1600036621094
      },
      "text": "Force Feedback using Air Jet"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.99005126953125,
        "x2": 295.281005859375,
        "y1": 464.0465087890625,
        "y2": 628.3665771484375
      },
      "text": "With the recent proliferation of drone technology, there has been a growing interest in using them to provide haptic feedback. While rotating propellers can be a potential hazard in drones, a study by Abtahi et al. [2] found that more than half of participants would touch a flying drone to interact with it if it was equipped with a protective mesh. While drones could provide passive haptic feedback when being touched or moved by the user’s hand [15], researchers demonstrated that drones could provide active haptic feedback by flying towards the user’s hand [21,39], although the feedback can only create up to 0.118 N of force [39]. Furthermore, Abdullah et al. [1] showed that when using drones to generate force feedback on a single axis aligned with the propeller orientation, it could exert up to 1.53 N for upward and 2.97 N for downward forces."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 182.60098266601562,
        "y1": 453.156005859375,
        "y2": 459.6000061035156
      },
      "text": "Force Feedback using Drones"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 295.2112731933594,
        "y1": 646.0864868164062,
        "y2": 708.9739379882812
      },
      "text": "Benko et al. [7] developed the NormalTouch controller to enable users to perceive the shape of physical objects in VR. NormalTouch uses three servo motors that move a small platform to provide force feedback. Given its size, this device can only create force feedback on a finger. Weightshifting has also been explored for ungrounded force"
    }, {
      "page": 2,
      "region": {
        "x1": 316.79461669921875,
        "x2": 558.1549072265625,
        "y1": 228.74253845214844,
        "y2": 291.62994384765625
      },
      "text": "feedback. TorqueBAR [32] is a handheld device with horizontal rails that a motor slides along. The device creates torque by moving the center of mass via the left and right movement of a motor. Shifty [41] is a rod-shaped handheld device that moves a weight along the rod, thus changing its rotational inertia."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 244.6110382080078,
        "y1": 635.196044921875,
        "y2": 641.6400146484375
      },
      "text": "Other Ungrounded Force Feedback Methods"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 316.7900695800781,
        "x2": 558.0309448242188,
        "y1": 309.3664855957031,
        "y2": 383.5385437011719
      },
      "text": "While extensive research has explored creating ungrounded force feedback, there has yet to be an ungrounded method that can create a large physical force in an arbitrary threedimensional direction without the use of large and heavy equipment. Thor’s Hammer overcomes this by using propellers to push an ungrounded material, air, to create forces."
    }, {
      "page": 2,
      "region": {
        "x1": 316.7801513671875,
        "x2": 558.0410766601562,
        "y1": 393.635986328125,
        "y2": 467.77532958984375
      },
      "text": "THOR’S HAMMER: FORCE FEEDBACK DEVICE USING PROPELLER PROPULSION This work proposes the use of propeller propulsion to create 3-DOF force feedback. We demonstrate this approach with our prototype device, dubbed Thor’s Hammer. The device was implemented using off-the-shelf materials and 3Dprinted parts from an FDM printer."
    }, {
      "page": 2,
      "region": {
        "x1": 316.7701416015625,
        "x2": 558.0411376953125,
        "y1": 477.8760070800781,
        "y2": 622.121826171875
      },
      "text": "Hardware Implementation Thor’s Hammer is constructed using a series of propellers mounted within a carbon fiber pipe cage (Figure 2). Thor’s Hammer has six 2600KV T-Motor F40 III brushless motors (and accompanying tri-blade propellers) to generate bidirectional thrust in three axes. Each tri-blade propeller has a length of 127 mm, a pitch of 114.3 mm, and creates an outward airflow, away from the carbon fiber frame. Instead of rotating one propeller in two directions to create pushing and pulling forces, the device uses two propellers, which push the air to change the direction of the force by controlling the throttle to minimize latency when inverting the rotating direction of each motor."
    }, {
      "page": 2,
      "region": {
        "x1": 316.7502746582031,
        "x2": 558.021240234375,
        "y1": 633.0479736328125,
        "y2": 708.6642456054688
      },
      "text": "Surrounding the motors and propellers is a motor frame that was built using 10 mm-diameter carbon fiber pipes. This frame allows each motor to be mounted in its necessary location. External to this frame was a cage frame that was assembled with 8 mm-diameter carbon fiber pipes and have a badminton string weaved mesh with 10 mm spacing surrounding it. This frame and mesh provides structural"
    }, {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 3"
    }, {
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 295.25115966796875,
        "y1": 63.72648620605469,
        "y2": 173.7945556640625
      },
      "text": "support for the device and acts as a safety mechanism, while still maximizing the airflow from the device and also minimizing device weight. A handle is wrapped with a hightraction racket grip and affixed to the outside of the frame and mesh to enable a user to hold the device. All joints, motor mounts, and the handle were 3D printed. The resulting dimensions of the device are 208 mm × 208 mm × 208 mm (without a handle, whose length is 120 mm and diameter 34 mm). The total weight of the device is 692 g, excluding the wires necessary to connect the motors to the drive board."
    }, {
      "page": 3,
      "region": {
        "x1": 53.99009704589844,
        "x2": 295.24114990234375,
        "y1": 184.72068786621094,
        "y2": 294.90826416015625
      },
      "text": "Six ES30 HV electronic speed controllers (ESC) are used to power the motors and are placed on a drive board to reduce the weight of the device. Due to the electrical requirements, two 14V 350W power supplies are used to run the prototype device. Because stopping the brushless motors can result in a high-voltage current back flow, SR1050 Schottky diodes have been added between the ESCs and power supplies. An Arduino Leonardo installed on the drive board controls the ESCs using PWM signals and communicates with a PC through a USB connection."
    }, {
      "page": 3,
      "region": {
        "x1": 53.99003601074219,
        "x2": 295.2511291503906,
        "y1": 305.7148742675781,
        "y2": 547.1107177734375
      },
      "text": "We used a VICON optical tracking system to track the device’s position and orientation in a virtual environment. Position and orientation of the device are essential to locate it in the virtual environment and to enable force vectors in environment space rather than relative to the orientation of the device. For example, if a user puts a virtual wooden stick into the water, the buoyancy force should change by the stick location and should remain ‘upward’ relative to the real world regardless of the device orientation. Virtual environments were simulated using an Oculus Rift headmounted display. Software Implementation The device control software was written in C# and the VR applications were implemented in Unity. A force-control API for Unity was implemented and used to calculate a device-based force vector by rotating the global force vector in a direction opposite to the device’s rotation, and to send the force vector to the device control software via UDP communication. The device control software calculates the throttle for each motor and sends motor control messages to the Arduino."
    }, {
      "page": 3,
      "region": {
        "x1": 53.98008728027344,
        "x2": 295.2710266113281,
        "y1": 558.0368041992188,
        "y2": 656.7005615234375
      },
      "text": "When the device starts, all motors begin rotating at a minimum speed of 1200 rpm, to minimize the latency of subsequently applying a propeller force. As single axis force is created by combining the throttles of two motors, the device produces a 3-DOF force by combining the three force vectors created by the three pairs of motors. The throttleforce function for each motor was calibrated using quadratic fitting functions to have a linear relation with an actual force between 0 - 4 N."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 316.79998779296875,
        "x2": 358.0379333496094,
        "y1": 298.47601318359375,
        "y2": 304.9200134277344
      },
      "text": "Summary"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 295.291015625,
        "y1": 677.886474609375,
        "y2": 707.4078979492188
      },
      "text": "As this work is one of the first to investigate the use of propeller propulsion to create force feedback, it was essential to empirically evaluate the force characteristics that Thor’s"
    }, {
      "page": 3,
      "region": {
        "x1": 316.79461669921875,
        "x2": 558.0655517578125,
        "y1": 63.73295593261719,
        "y2": 139.349365234375
      },
      "text": "Hammer produces. To quantify the capabilities of our prototype, we conducted a technical evaluation of its performance by measuring the force control accuracy (both strength and direction), responsiveness (latency), noise level, and power consumption of the device. We begin by presenting our measurement rig, and then describe the results of the evaluation."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 166.93202209472656,
        "y1": 666.7559814453125,
        "y2": 673.2000122070312
      },
      "text": "TECHNICAL EVALUATION"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 316.78997802734375,
        "x2": 558.1007080078125,
        "y1": 160.5664520263672,
        "y2": 247.70660400390625
      },
      "text": "An aluminum extrusion measurement frame was created to evaluate the prototype (Figure 3). The frame measured 610 mm × 610 mm × 610 mm, allowing for 201 mm of space between each face of the prototype and the aluminium extrusion frame. Attached to each center of the frame, were six calibrated load cells that could measure up to 5 kg of force (CZL635). The frame was raised 300 mm above the ground."
    }, {
      "page": 3,
      "region": {
        "x1": 316.7998962402344,
        "x2": 557.981201171875,
        "y1": 258.51324462890625,
        "y2": 322.725341796875
      },
      "text": "The prototype was suspended within the aluminum frame using six steel wires to minimize the probable effect of the aluminum frame magnifying the force magnitude. Each wire connected a motor mount to a load cell and had a plastic tensioner to tighten the wire. The handle and weaved mesh were removed during the entire measurement process."
    }, {
      "page": 3,
      "region": {
        "x1": 316.7899169921875,
        "x2": 558.0509643554688,
        "y1": 333.5319519042969,
        "y2": 409.2677307128906
      },
      "text": "The load cells were connected to HX711 load cell amplifiers that amplify and digitize the sensor values with 24-bit Analog-Digital converters. An Arduino Uno sampled the load cell measurements at 82 FPS and sent them to a PC. An experimental program written in C# generated force feedback via Thor’s Hammer and recorded the resulting force measurements."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 316.79998779296875,
        "x2": 389.8619689941406,
        "y1": 149.43600463867188,
        "y2": 155.8800048828125
      },
      "text": "Evaluation Setup"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 316.7900390625,
        "x2": 557.971435546875,
        "y1": 591.9664916992188,
        "y2": 656.05908203125
      },
      "text": "To test the accuracy of the forces created by the prototype, force patterns that increased in magnitude along a single axis, from 0.5 N to 4 N with 0.5 N increments, were designed. Each force feedback pattern was activated for 3 seconds and tested in both directions on all three axes. There were 3 second breaks between each direction and axis change."
    }, {
      "page": 3,
      "region": {
        "x1": 316.79998779296875,
        "x2": 557.9813232421875,
        "y1": 666.9851684570312,
        "y2": 708.0303344726562
      },
      "text": "The average output force as a relation of the input force was calculated from the measurements, for all three axes (Figure 4b). The device was able to exert force at 4 N in each of the six directions on three axes, which is comparable to a"
    }, {
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 4"
    }, {
      "page": 4,
      "region": {
        "x1": 54.0,
        "x2": 295.291015625,
        "y1": 614.16650390625,
        "y2": 666.7353515625
      },
      "text": "commercial grounded 3-DOF force feedback device, Geomagic Touch [42], which can exert force up to 3.3 N. Root-mean-square error (RMSE) values of the output force against the input force for X, Y, and Z-axes were 0.077 N, 0.084 N, and 0.148 N, respectively."
    }, {
      "page": 4,
      "region": {
        "x1": 54.00004577636719,
        "x2": 295.1814880371094,
        "y1": 677.6614990234375,
        "y2": 707.3024291992188
      },
      "text": "To investigate the stability of the force during a constant force exertion, the standard deviation of the force magnitudes were calculated using the axes and force levels."
    }, {
      "page": 4,
      "region": {
        "x1": 316.76495361328125,
        "x2": 558.0758056640625,
        "y1": 63.74699401855469,
        "y2": 196.862548828125
      },
      "text": "As our focus was to measure the fluctuations while exerting a constant force, we excluded force measurements for the first 500 ms, which may have included measurements before the force reached its target level. Thus, only the measurements during the latter 2500 ms were used to compute the standard deviations (Figure 4c). Based on the measurements, there appears to be a tendency for the force fluctuations to increase as the exertion force increases. The standard deviation was lower than 0.05 N, except for a positive z-axis force, which was measured to be 0.08 N. This trend can also be observed in the raw measurement graph (Figure 4a)."
    }, {
      "page": 4,
      "region": {
        "x1": 316.71539306640625,
        "x2": 558.0061645507812,
        "y1": 207.5496063232422,
        "y2": 338.01556396484375
      },
      "text": "To measure the latency of increasing and decreasing the force, we wrote a program that would exert forces with different magnitudes along the three axes for 2 seconds, then immediately reducing the force magnitude to 0 N. Acceleration and deceleration time were obtained by measuring the time between the signal trigger moment and the moment when the force reached within ± 0.15 N of the target force (Figure 5a). The results demonstrated that the acceleration time remained similar regardless of the force change, and the deceleration time was shorter when a smaller amount of force was reduced (Figure 5bc). In all cases, deceleration was faster than acceleration."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 316.79400634765625,
        "x2": 447.9059143066406,
        "y1": 580.842041015625,
        "y2": 587.2860107421875
      },
      "text": "Force Control on a Single Axis"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 316.7599792480469,
        "x2": 558.0609130859375,
        "y1": 520.8065185546875,
        "y2": 696.2817993164062
      },
      "text": "As Thor’s Hammer can create force feedback in an arbitrary direction by combining force vectors on three-axes, 212 force vectors were used to measure its directional control, each pointing toward the points along the surface of a sphere with a radius of 2 N. The vectors had an 18° interval spacing along the longitudinal and latitudinal directions (Figure 6). For each force vector, the device exerted a constant force for 3 seconds. The force measurements were converted to force vectors for analysis. The RMSE of angles between the target and measured vectors was 3.86° (SD: 1.75°) with a magnitude RMSE of 0.05 N (SD: 0.02 N; Figure 6). The force vectors were the most accurate when only a single axis force was used. When a force was made by combining two or more single axis force vectors, there was a tendency for the resulting vector to be slightly off-target, towards the origin of the weaker axis."
    }, {
      "page": 4,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 5"
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 316.80596923828125,
        "x2": 481.2900085449219,
        "y1": 509.9129333496094,
        "y2": 516.35693359375
      },
      "text": "Force Control in an Arbitrary Direction"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.999900817871094,
        "x2": 295.3306884765625,
        "y1": 73.56645202636719,
        "y2": 319.757568359375
      },
      "text": "We measured the amount of noise generated by the propellers that is used by the device to create the ungrounded force feedback. A sound level meter was positioned 1-meter away from Thor’s Hammer and measured peak noise levels while the device was exerting a constant force. The measurements were made in an indoor location where the ambient noise level was 32.4 dB. Initially providing power to the device caused the ambient noise to increase to 35.6 dB. The noise level increased as the force magnitude increased, with a maximum of 80.7 dB when exerting 4 N of force (Figure 7). The power consumption of Thor’s Hammer depends on several factors, including the amount of force created by the device and the load applied to the device. The power consumption of the device was measured while it was stationary. The device drew 2.52 W of power while idling and as the applied force increased, so did the power consumed (e.g., 10.5 W at 0.5 N, 27.0 W at 1 N, 49.3 W at 1.5 N, 75.7 W at 2 N, 130.8 W at 3 N, and 204.7 W at 4 N). Based on the measurements, we can expect it to continuously apply 2 N of force for about 19 minutes on a typical 4S 1800mA LiPo battery that weights around 200 grams."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 232.04701232910156,
        "y1": 62.675994873046875,
        "y2": 69.1199951171875
      },
      "text": "Operating Noise and Power Consumption"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.99003601074219,
        "x2": 295.2410583496094,
        "y1": 422.2864990234375,
        "y2": 489.2475280761719
      },
      "text": "Previous studies on ungrounded force feedback techniques have illustrated several haptic interaction scenarios for VR applications [7,16,25,39,41]. Thor’s Hammer can create uniquely strong, precise, and continuous force feedback in a mobile form factor. In this section, we demonstrate VR scenarios for which the device might be useful (Figure 8)."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.993988037109375,
        "x2": 270.47998046875,
        "y1": 410.676025390625,
        "y2": 417.1200256347656
      },
      "text": "USING FORCE FEEDBACK IN VR ENVIRONMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.99003601074219,
        "x2": 295.1515197753906,
        "y1": 511.5665283203125,
        "y2": 626.893310546875
      },
      "text": "This scenario takes advantage of the fact that Thor’s Hammer is ungrounded, as the scene is large and would require the user to move around, and the movement of the waves can be matched to the device’s latency, since the force continuously changes as the stick moves through the water. In the scenario, the sensation of water flowing is felt when users place a virtual stick into a stream of water. To simulate water flow, we used Thor’s Hammer to generate forces that change in magnitude according to the strength of the waves, and an upward force to simulate buoyancy (Figure 8a)."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 205.67703247070312,
        "y1": 500.07598876953125,
        "y2": 506.5199890136719
      },
      "text": "Holding an Object in Flowing Water"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.999977111816406,
        "x2": 295.2510070800781,
        "y1": 649.2064819335938,
        "y2": 704.0462646484375
      },
      "text": "The purpose of this scenario is to demonstrate the ability of Thor’s Hammer to continuously and accurately simulate forces of various directions and magnitudes. In this scenario, users herd a leashed lamb. As the lamb tries to move around the field, Thor’s Hammer creates a tugging force based on"
    }, {
      "page": 5,
      "region": {
        "x1": 316.8045349121094,
        "x2": 557.806640625,
        "y1": 63.72782897949219,
        "y2": 82.44268798828125
      },
      "text": "the direction that the lamb is pulling and the position and orientation of the device (Figure 8b)."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 125.14498901367188,
        "y1": 637.595947265625,
        "y2": 644.0399780273438
      },
      "text": "Herding a Sheep"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 316.7801513671875,
        "x2": 558.0010986328125,
        "y1": 104.76646423339844,
        "y2": 219.9739990234375
      },
      "text": "The haptic sensations that Thor’s Hammer produces can be used to simulate active touch scenarios when users explore the physical properties of an object. In this scenario, buttons with various rigidities are felt by pushing them with a virtual stick (Figure 8c). When a button is pushed, Thor’s Hammer creates different reaction forces that vary depending on the stiffness of the button. This scenario not only requires precise and continuous force control, but also the ability to specify forces in different directions, as users may use any side of the stick to push the buttons."
    }, {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 6"
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 316.79998779296875,
        "x2": 388.8719177246094,
        "y1": 93.15597534179688,
        "y2": 99.5999755859375
      },
      "text": "Pushing Buttons"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.990020751953125,
        "x2": 295.2711181640625,
        "y1": 74.64646911621094,
        "y2": 201.975341796875
      },
      "text": "In this scenario, we demonstrate how object weights can be dynamically simulated using the force vector control of Thor’s Hammer, which can increase or decrease by up to 4 N, i.e., 408 g, in opposite directions. The scenario entails transporting users to various planets with different gravitational forces (Figure 8d). Inspired by Thor’s Hammer in Norse mythology [22], users experience the sensation of gravity by holding a hammer whose weight changes from planet to planet. This scenario requires precise, continuous, and directional force control as users should feel a downward gravitational force regardless of the orientation of the device."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 176.95802307128906,
        "y1": 63.035980224609375,
        "y2": 69.47998046875
      },
      "text": "Simulating Different Weights"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 295.410400390625,
        "y1": 223.68650817871094,
        "y2": 276.375
      },
      "text": "We conducted an informal user study to gain insights into user perceptions of using Thor’s Hammer for VR applications. In the study, participants were placed into each of the four VR scenarios described above and provided feedback about their experiences."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 174.36599731445312,
        "y1": 212.55599975585938,
        "y2": 219.0
      },
      "text": "QUALITATIVE USER STUDY"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.999969482421875,
        "x2": 295.2909240722656,
        "y1": 297.60650634765625,
        "y2": 384.7464904785156
      },
      "text": "Six participants with an average age of 22.5 were recruited through university Facebook groups (2 males, aged 19–27). Apart from one participant who had previously used Google Cardboard for a period of one year, other participants did not have experience in using VR. Furthermore, all participants were right-handed and had not previously used force feedback devices. Participants were compensated with $8 for the 40-minute experiment."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 105.56100463867188,
        "y1": 286.47601318359375,
        "y2": 292.9200134277344
      },
      "text": "Participants"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 295.1514892578125,
        "y1": 405.96649169921875,
        "y2": 447.0116271972656
      },
      "text": "The study was conducted indoors. Participants stood while holding the device with their dominant hand, and wore an Oculus Rift VR headset and active noise cancelling headphones."
    }, {
      "page": 6,
      "region": {
        "x1": 53.970123291015625,
        "x2": 295.2412414550781,
        "y1": 457.9377746582031,
        "y2": 533.5540771484375
      },
      "text": "Prior to the start of each scenario, the experimenter briefly described the VR environment and demonstrated ways one could interact with it. Participants were then placed into the scenario and freely explored the environment. Participants experienced each scenario with and without haptic feedback for at least 30 seconds. Each scenario began without haptic feedback."
    }, {
      "page": 6,
      "region": {
        "x1": 53.94019317626953,
        "x2": 295.2113037109375,
        "y1": 544.4801635742188,
        "y2": 666.0718383789062
      },
      "text": "After each scenario, participants filled out a questionnaire. The questionnaire entailed rating, on a 7-point Likert scale (1: strongly disagree - 7: strongly agree), three statements regarding each participant’s thoughts on the force feedback and whether it improved their sense of immersion in VR. The questionnaire also included open-ended questions inquiring on what participants liked and disliked about the force feedback, and how it fared in comparison to real life experiences. After having experienced all scenarios, participants selected the scenario they liked the most and justified their choice."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 98.60399627685547,
        "y1": 394.83599853515625,
        "y2": 401.2799987792969
      },
      "text": "Procedure"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 295.0916748046875,
        "y1": 687.2464599609375,
        "y2": 705.3637084960938
      },
      "text": "Participants were able to use the techniques without problems and were positive about the force feedback."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 86.5979995727539,
        "y1": 676.115966796875,
        "y2": 682.5599975585938
      },
      "text": "Results"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 316.7999572753906,
        "x2": 557.9813842773438,
        "y1": 74.04649353027344,
        "y2": 126.7349853515625
      },
      "text": "In this scenario, the questionnaire items included the following: “It felt like the stick was moving in the water”, “I could feel the differences in the water as I moved differently”, and “Being able to feel the water’s resistance made the virtual environment more immersive”."
    }, {
      "page": 6,
      "region": {
        "x1": 316.7799072265625,
        "x2": 558.12060546875,
        "y1": 137.54161071777344,
        "y2": 293.70458984375
      },
      "text": "The results indicate that participants felt that Thor’s Hammer made the stick seem as though it was actually moving through water (all answered 6: agree) and that they all could feel the differences in the water’s resistance as they moved the stick with varying speeds and directions (M:6.5). Participants remarked that the feedback felt similar to how flowing water should feel: “It kind of reminded me of playing in the water at a pool, like when you move your hand around in the water it's a similar feeling”, “It was pretty similar as real life”. Participants also reported that the haptic feedback made the virtual environment more immersive (all answered 6). For instance, one participant commented, “I like that it gave a feeling of depth to the water, this made it feel less fake”."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 316.79998779296875,
        "x2": 387.9630126953125,
        "y1": 63.52648162841797,
        "y2": 69.47998046875
      },
      "text": "Feeling the Water"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 316.79998779296875,
        "x2": 557.9415893554688,
        "y1": 314.8865051269531,
        "y2": 367.4553527832031
      },
      "text": "The questionnaire for this scenario included the following items: “I could feel like the lamb was actually pulling my hand”, “I could feel the direction that the lamb pulls in”, and “the feeling of the pulling force made me feel more immersed in the virtual environment”."
    }, {
      "page": 6,
      "region": {
        "x1": 316.7900695800781,
        "x2": 558.0809936523438,
        "y1": 378.3815002441406,
        "y2": 661.0660400390625
      },
      "text": "Responses to this scenario were mixed. The responses showed that the force feedback felt as though the lamb was actually tugging their hand (M:6), and participants were able to correctly identify the direction of the force (M:6). However, one participant felt that the device was a bit slow to respond when he moved it around quickly, and another participant felt that the scenario was unrealistic since her actions had no influence on the sheep’s movement. In spite of this, some participants appreciated the directional pulling force and gave positive feedback: “It was very precise and accurate. The direction the sheep would go to was easy to identify just by the pull”. Furthermore, participants reported that the force felt “like a string was being tugged” and as though “I was really being pulled around”. In light of the feedback given by participants, the virtual leash should be made visibly elastic to account for latency in haptic response, and that the virtual animal should be made responsive to user input. In summary, most participants reported that the haptic device made the virtual environment more immersive (M:5.5). The two participants who did not feel this way, also did not agree with the other items in the questionnaire. Two participants reportedly expressed disliking the noise produced by device’s fan. Further, one participant felt that the forces were too strong. Two participants mentioned that wind generated by the propellers felt uncomfortable."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 316.79998779296875,
        "x2": 384.4530334472656,
        "y1": 304.36651611328125,
        "y2": 310.32000732421875
      },
      "text": "Herding a Sheep"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 316.79998779296875,
        "x2": 557.9813842773438,
        "y1": 682.2064819335938,
        "y2": 711.847412109375
      },
      "text": "In this scenario, participants were asked to rate their agreement to: “I was able to feel each button’s rigidity”, “The rigidity of each button felt different”, and “Being able to feel"
    }, {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 7"
    }, {
      "page": 7,
      "region": {
        "x1": 53.99998474121094,
        "x2": 295.18145751953125,
        "y1": 63.72648620605469,
        "y2": 81.84375
      },
      "text": "the rigidity of the buttons made the virtual environment more immersive”."
    }, {
      "page": 7,
      "region": {
        "x1": 53.99998474121094,
        "x2": 295.4104919433594,
        "y1": 92.65037536621094,
        "y2": 179.79052734375
      },
      "text": "Participants indicated that they could feel the rigidity of each button (M:6.5) and that each button felt different (M:5.5). Two commented that, “as I pushed on the button, they appeared to have springs between them” and “it made some buttons easier / harder to press”. All participants agreed that the haptic feedback made the environment more immersive (M:6.5). Two participants noted that they did not like the noise generated by the device’s fan."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 316.79998779296875,
        "x2": 382.3829650878906,
        "y1": 671.6865234375,
        "y2": 677.6400146484375
      },
      "text": "Pushing Buttons"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.99004364013672,
        "x2": 295.2609558105469,
        "y1": 201.00645446777344,
        "y2": 265.21868896484375
      },
      "text": "The questions relating to weight perception included: “The haptic feedback made it feel like the weight was changing”, “I felt that the weight of the hammer changed depending on the planet I was on”, and “The fact that [the] hammer’s weight would change made me feel more immersed in the virtual environment”."
    }, {
      "page": 7,
      "region": {
        "x1": 53.99005889892578,
        "x2": 295.3209228515625,
        "y1": 276.0252990722656,
        "y2": 420.6643371582031
      },
      "text": "Participants reported that they could feel changes in the weight of the hammer from planet to planet (M:6.5, “Changing it makes my hand feel of changing its weight”) and feel the changes that occurred on different planets (M:6.5, “Each gravitational pull was clearly different”). One participant said, “I felt more like I was floating midair”. Participants also felt that the weight change was accurate: “It's very accurate and precise”, “you could tell the difference between planets”. All except one participant felt that the feedback made the virtual environment (M:6.5) more immersive. The one participant who did not feel immersed had expressed that “It [the scenario] wasn’t very interactive, so not as immersive”."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 114.54299926757812,
        "y1": 190.4864959716797,
        "y2": 196.44000244140625
      },
      "text": "Feeling Gravity"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.97015380859375,
        "x2": 295.2611083984375,
        "y1": 441.84649658203125,
        "y2": 540.5101928710938
      },
      "text": "Overall, the feedback from participants was positive. Based on the responses, Thor’s Hammer could simulate forces to a high degree of strength—to enable feeling the resistance of water flow and tugging forces, continuity—to simulate the flow of water and leash-pulling from different directions, and precision—to feel various weights buttons of different rigidities. The feedback also helped participants feel more immersed in each of the VR scenarios (M:6, 5.5, 6.5, 6.5, respectively)."
    }, {
      "page": 7,
      "region": {
        "x1": 53.93028259277344,
        "x2": 295.19140625,
        "y1": 551.4363403320312,
        "y2": 661.5042724609375
      },
      "text": "Despite this, subjective responses from participants revealed some of the hammer’s shortcomings. Notably, many participants remarked that the noise produced by the device’s fan was distracting, which reduced their sense of immersion. Moreover, for the sheep-herding scenario, two participants reported disliking the wind that was generated by the propellers. One participant reporting that the force feedback was not responsive enough to properly react when he was the device quickly, and another participant expressed that the force was too strong."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 92.46599578857422,
        "y1": 431.3265075683594,
        "y2": 437.2799987792969
      },
      "text": "Summary"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 295.1514892578125,
        "y1": 682.6865234375,
        "y2": 712.3274536132812
      },
      "text": "The technical validation and informal user study identified advantages and disadvantages of the force feedback provided by Thor’s Hammer. While the device can generate strong and"
    }, {
      "page": 7,
      "region": {
        "x1": 316.8045654296875,
        "x2": 557.9359130859375,
        "y1": 63.73222351074219,
        "y2": 104.77740478515625
      },
      "text": "accurate force feedback without grounding, it also has some sound and perceptual limitations that were found to diminish user experience. In this section, we discuss potential issues and future directions."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 191.99697875976562,
        "y1": 671.5560302734375,
        "y2": 678.0
      },
      "text": "DISCUSSION AND LIMITATIONS"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 316.78021240234375,
        "x2": 558.1207275390625,
        "y1": 126.00645446777344,
        "y2": 282.1694641113281
      },
      "text": "In the user study, noise was a frequently mentioned drawback of Thor’s Hammer. Like other devices that generate strong airflow, such as drones and hair dryers, Thor’s Hammer creates a substantial amount of noise. The noise levels for 2 N of force were approximately 70 dB, which is similar to the noise heard when taking a shower, and for 4N was approximately 80.7 dB, which is similar to the noise of garbage disposal. Although users may wear headphones when using VR, the noise created by Thor’s Hammer is a limitation of the device. While eliminating all noise would be impossible, future work could consider using methods developed for noise reduction in other devices, such as drones. This includes active noise cancellation [36] or using sound damping material."
    }, {
      "page": 7,
      "region": {
        "x1": 316.78021240234375,
        "x2": 558.05126953125,
        "y1": 293.0956115722656,
        "y2": 357.18817138671875
      },
      "text": "Another important issue is safety. We used a weaved mesh to prevent hand and finger injury due to contact with the spinning propeller blades. However, there is still a possibility that some small objects may pass through the mesh, hit a propeller blade, and fly back through the mesh. To avoid this, we ensured that the workplace was free of debris."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 316.79998779296875,
        "x2": 389.6009521484375,
        "y1": 114.87600708007812,
        "y2": 121.32000732421875
      },
      "text": "Noise and Safety"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 316.77008056640625,
        "x2": 558.1008911132812,
        "y1": 378.3664855957031,
        "y2": 615.07568359375
      },
      "text": "Another concern is the latency of the haptic feedback. While our device can create continuous and strong force feedback, the device’s 300 milliseconds latency may not be appropriate for haptic scenarios that require instantaneous or highly responsive feedback, such as hitting a rigid surface. This concern was brought up by one participant in the user study, who noted that the feedback was not responsive enough to follow his movements for the sheep-herding scenario. The latency can also make a disparity between the intended and actual force orientation, e.g., if a user rotates the device at a rotational speed of 90°/sec, a user may experience approx. 27° of orientation disparity between what they expect and feel. In prior work, Lopes, Ion, and Baudisch found that using a blend of haptic feedback techniques with different characteristics can complement the limitations of each technique [24]. Future iterations of Thor’s Hammer could also utilize a blend of different haptic feedback techniques and motion prediction to reduce latency. We also believe that building a closed control loop by adding force sensors under each motor could enable PID control of the force feedback for a more precise and responsive force feedback."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 316.79998779296875,
        "x2": 431.9640197753906,
        "y1": 367.2359924316406,
        "y2": 373.67999267578125
      },
      "text": "Feedback Responsiveness"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 316.7900390625,
        "x2": 558.0609130859375,
        "y1": 636.2464599609375,
        "y2": 711.86279296875
      },
      "text": "The off-the-shelf and 3D-printed nature of Thor’s Hammer enables it to be easily replicated. Since the force created along each axis is independent from the other axes, calibration can be performed on a per-axis basis. We expect this to be easily replicated by researchers and designers. We will make the drawings, CAD files, firmware source code, force control software, and force control Unity API available"
    }, {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 8"
    }, {
      "page": 8,
      "region": {
        "x1": 53.99568176269531,
        "x2": 295.2866516113281,
        "y1": 62.55026626586914,
        "y2": 81.84375
      },
      "text": "online1, so that those who want to use the force feedback can build and use this device."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 316.79998779296875,
        "x2": 399.9329528808594,
        "y1": 625.115966796875,
        "y2": 631.5599975585938
      },
      "text": "Ease of Replication"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 295.2810974121094,
        "y1": 103.08647155761719,
        "y2": 213.154541015625
      },
      "text": "While the present implementation uses a cubic frame that is 208 mm in each dimension, the frame can be built in a number of different shapes and sizes by changing the size of motors and propellers, and by reducing the number of propellers based on the desired types of forces. The present implementation is handheld, but if smaller propellers and motors were used, it could be miniaturized such that it could be attached on a bracelet or armband. It could also be attached to another physical prop such as a gun game controller to augment it with a force feedback."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 178.9920196533203,
        "y1": 91.95602416992188,
        "y2": 98.4000244140625
      },
      "text": "Extensibility to Other Shapes"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 295.1514892578125,
        "y1": 234.3665008544922,
        "y2": 309.9828796386719
      },
      "text": "Making Thor’s Hammer truly mobile requires many considerations, with power consumption being of utmost concern. Our estimation showed that it could exert 2 N of continuous force for 19 minutes on a 4s 1800mA battery, which might not be sufficient to support long periods of use. Limiting the force magnitude and using components that draw less power may lengthen the untethered use time."
    }, {
      "page": 8,
      "region": {
        "x1": 54.00001525878906,
        "x2": 295.42047119140625,
        "y1": 320.9090270996094,
        "y2": 373.4778747558594
      },
      "text": "Although we used a VICON optical tracking system to track the device, using inside-out tracking [46] or inertia-sensor based tracking methods [47] would enable the device to be used without any external tracking system installed in the environment."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 151.02899169921875,
        "y1": 223.23599243164062,
        "y2": 229.67999267578125
      },
      "text": "Untethered and Mobile"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 295.28106689453125,
        "y1": 394.6864929199219,
        "y2": 562.3729248046875
      },
      "text": "This paper introduced Thor’s Hammer, an ungrounded force feedback device that can create 3-DOF force feedback. The technical evaluation demonstrated that the device can generate up to 4 N of continuous and precise force feedback in arbitrary directions. The informal user study showed promise in the device, provided insights regarding how users experienced the force feedback, and identified areas for which the device could be improved. Together with the results from the technical evaluation and the user study, we believe that the new device may open up many possibilities in creating more realistic experiences in virtual environments. Due to the 3D printed nature of the device, and its use of off-the-shelf components, the device can be easily replicated and operated without any grounding structures."
    }, {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 295.2709655761719,
        "y1": 573.299072265625,
        "y2": 683.3670043945312
      },
      "text": "Since the use of propeller propulsion for 3-DOF force feedback had not been investigated prior to this work, our focus was to build a proof-of-concept device. The device currently has several limitations and future work should seek to address them. For instance, while there was no mention of fatigue in the user study, the device is larger and heavier than most VR controllers and a prolonged use could cause fatigue. High latency of the feedback also limits the use of the device to scenarios with gradually changing force feedback. Future work could also include an expansion to a 6-DOF force"
    }, {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 239.82679748535156,
        "y1": 703.8302612304688,
        "y2": 711.5999755859375
      },
      "text": "1 https://github.com/seongkook/ThorsHammer"
    }, {
      "page": 8,
      "region": {
        "x1": 316.797607421875,
        "x2": 558.168212890625,
        "y1": 63.72184753417969,
        "y2": 139.3382568359375
      },
      "text": "feedback device by using rotor configurations that support omnidirectional actuation [11] and a more controlled psychophysical study investigating how users perceive the force created by propeller propulsion compared to a grounded force feedback device and the effect of unintended haptic sensations such as vibration and torque on perception of the force."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 206.531982421875,
        "y1": 383.5559997558594,
        "y2": 390.0
      },
      "text": "CONCLUSION AND FUTURE WORK"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 316.79998779296875,
        "x2": 557.9714965820312,
        "y1": 160.5664520263672,
        "y2": 201.61163330078125
      },
      "text": "We would like to thank the anonymous reviewers for their suggestions and the members of the DGP Lab at the University of Toronto for their valuable feedback. The research was supported by NSERC."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 316.79998779296875,
        "x2": 414.72003173828125,
        "y1": 149.43600463867188,
        "y2": 155.8800048828125
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 316.79998779296875,
        "x2": 544.6644897460938,
        "y1": 222.8464813232422,
        "y2": 229.44000244140625
      },
      "text": "1. Muhammad Abdullah, Minji Kim, Waseem Hassan,"
    }, {
      "page": 8,
      "region": {
        "x1": 336.00286865234375,
        "x2": 548.5890502929688,
        "y1": 234.37022399902344,
        "y2": 309.9866027832031
      },
      "text": "Yoshihiro Kuroda, and Seokhee Jeon. 2017. HapticDrone: An Encountered-Type Kinesthetic Haptic Interface with Controllable Force Feedback: Initial Example for 1D Haptic Feedback. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST ’17), 115–117. https://doi.org/10.1145/3131785.3131821"
    }, {
      "page": 8,
      "region": {
        "x1": 316.7998352050781,
        "x2": 557.9613037109375,
        "y1": 314.91680908203125,
        "y2": 678.1478881835938
      },
      "text": "2. Parastoo Abtahi, David Y. Zhao, L. E. Jane, and James A. Landay. 2017. Drone Near Me: Exploring TouchBased Human-Drone Interaction. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3: 34:1–34:8. https://doi.org/10.1145/3130899 3. Michael L. Agronin. 1987. The design of a nine-string six-degree-of-freedom force-feedback joystick for telemanipulation. In Proceedings of the Workshop on Space Telerobotics. 4. Tomohiro Amemiya, Hideyuki Ando, and Taro Maeda. 2005. Virtual force display: direction guidance using asymmetric acceleration via periodic translational motion. In First Joint Eurohaptics Conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics Conference, 619–622. https://doi.org/10.1109/WHC.2005.146 5. Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’16), 218–226. https://doi.org/10.1145/2839462.2839484 6. Akash Badshah, Sidhant Gupta, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. GyroTab: A Handheld Device That Provides Reactive Torque Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12), 3153–3156. https://doi.org/10.1145/2207676.2208731 7. Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. NormalTouch and TextureTouch: High-"
    }, {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 557.9979858398438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 9"
    }, {
      "page": 9,
      "region": {
        "x1": 73.19999694824219,
        "x2": 291.6526794433594,
        "y1": 63.72648620605469,
        "y2": 116.29541015625
      },
      "text": "fidelity 3D Haptic Shape Rendering on Handheld Virtual Reality Controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST ’16), 717–728. https://doi.org/10.1145/2984511.2984526"
    }, {
      "page": 9,
      "region": {
        "x1": 53.977264404296875,
        "x2": 295.01934814453125,
        "y1": 121.22563171386719,
        "y2": 714.4531860351562
      },
      "text": "8. Jonathan Blake and Hakan B. Gurocak. 2009. Haptic Glove With MR Brakes for Virtual Reality. IEEE/ASME Transactions on Mechatronics 14, 5: 606–615. https://doi.org/10.1109/TMECH.2008.2010934 9. Diego Borro, Joan Savall, Aiert Amundarain, Jorge Juan Gil, Alejandro Garcia-Alonso, and Luis Matey. 2004. A large haptic device for aircraft engine maintainability. IEEE Computer Graphics and Applications 24, 6: 70–74. https://doi.org/10.1109/MCG.2004.45 10. Mourad Bouzit, Grigore Burdea, George Popescu, and Rares Boian. 2002. The Rutgers Master II-new design force-feedback glove. IEEE/ASME Transactions on Mechatronics 7, 2: 256–263. https://doi.org/10.1109/TMECH.2002.1011262 11. D. Brescianini and R. D’Andrea. 2016. Design, modeling and control of an omni-directional aerial vehicle. In 2016 IEEE International Conference on Robotics and Automation (ICRA), 3261–3266. https://doi.org/10.1109/ICRA.2016.7487497 12. Frederick P. Brooks Jr., Ming Ouh-Young, James J. Batter, and P. Jerome Kilpatrick. 1990. Project GROPEHaptic Displays for Scientific Visualization. In Proceedings of the 17th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH ’90), 177–185. https://doi.org/10.1145/97879.97899 13. Inrak Choi and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST ’16 Adjunct), 117–119. https://doi.org/10.1145/2984751.2985725 14. Tim Duente, Max Pfeiffer, and Michael Rohs. 2017. Zap++: A 20-channel Electrical Muscle Stimulation System for Fine-grained Wearable Force Feedback. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI ’17), 1:1–1:13. https://doi.org/10.1145/3098279.3098546 15. Antonio Gomes, Calvin Rubens, Sean Braley, and Roel Vertegaal. 2016. BitDrones: Towards Using 3D Nanocopter Displays As Interactive Self-Levitating Programmable Matter. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), 770–780. https://doi.org/10.1145/2858036.2858519 16. Jan Gugenheimer, Dennis Wolf, Eythor R. Eiriksson, Pattie Maes, and Enrico Rukzio. 2016. GyroVR: Simulating Inertia in Virtual Reality Using Head Worn Flywheels. In Proceedings of the 29th Annual"
    }, {
      "page": 9,
      "region": {
        "x1": 335.9946594238281,
        "x2": 510.1851806640625,
        "y1": 63.93571472167969,
        "y2": 93.4571533203125
      },
      "text": "Symposium on User Interface Software and Technology (UIST ’16), 227–232. https://doi.org/10.1145/2984511.2984535"
    }, {
      "page": 9,
      "region": {
        "x1": 316.79168701171875,
        "x2": 557.5348510742188,
        "y1": 98.38737487792969,
        "y2": 714.6624145507812
      },
      "text": "17. Hakan Gurocak, Sankar Jayaram, Benjamin Parrish, and Uma Jayaram. 2003. Weight sensation in virtual environments using a haptic device with air jets. Journal of Computing and Information Science in Engineering 3, 2: 130–135. 18. Yukihiro Hirata and Makoto Sato. 1992. 3-dimensional Interface Device For Virtual Work Space. In Proceedings of the IEEE/RSJ International Conference on Intelligent Robots and Systems, 889–896. https://doi.org/10.1109/IROS.1992.594498 19. Michitaka Hirose, Koichi Hirota, Tetsuro Ogi, Hiroaki Yano, Naoyuki Kakehi, Makoto Saito, and Mutsuhiro Nakashige. 2001. HapticGEAR: the development of a wearable force display system for immersive projection displays. In Proceedings IEEE Virtual Reality 2001, 123–129. https://doi.org/10.1109/VR.2001.913778 20. Han-Pang Huang and Ya-Fu Wei. 1998. Control of dexterous hand master with force feedback. In Proceedings. 1998 IEEE International Conference on Robotics and Automation (Cat. No.98CH36146), 687– 692 vol.1. https://doi.org/10.1109/ROBOT.1998.677052 21. Pascal Knierim, Thomas Kosch, Valentin Schwind, Markus Funk, Francisco Kiss, Stefan Schneegass, and Niels Henze. 2017. Tactile Drones - Providing Immersive Tactile Feedback in Virtual Reality Through Quadcopters. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17), 433–436. https://doi.org/10.1145/3027063.3050426 22. John Lindow. 2002. Norse Mythology: A Guide to Gods, Heroes, Rituals, and Beliefs. Oxford University Press. 23. Pedro Lopes and Patrick Baudisch. 2013. Musclepropelled Force Feedback: Bringing Force Feedback to Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 2577–2580. https://doi.org/10.1145/2470654.2481355 24. Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST ’15), 11–19. https://doi.org/10.1145/2807442.2807443 25. Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 1471–1482. https://doi.org/10.1145/3025453.3025600"
    }, {
      "page": 9,
      "region": {
        "x1": 54.0,
        "x2": 557.9970092773438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 10"
    }, {
      "page": 10,
      "region": {
        "x1": 53.98005676269531,
        "x2": 294.0659484863281,
        "y1": 63.72648620605469,
        "y2": 702.9295043945312
      },
      "text": "26. Martin Murer, Bernhard Maurer, Hermann Huber, Ilhan Aslan, and Manfred Tscheligi. 2015. TorqueScreen: Actuated Flywheels for Ungrounded Kinaesthetic Feedback in Handheld Devices. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’15), 161–164. https://doi.org/10.1145/2677199.2680579 27. Kazuki Nagai, Soma Tanoue, Katsuhito Akahane, and Makoto Sato. 2015. Wearable 6-DoF Wrist Haptic Device “SPIDAR-W.” In SIGGRAPH Asia 2015 Haptic Media And Contents Design (SA ’15), 19:1– 19:2. https://doi.org/10.1145/2818384.2818403 28. Jun Rekimoto. 2013. Traxion: A Tactile Interaction Device with Virtual Force Sensation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST ’13), 427–432. https://doi.org/10.1145/2501988.2502044 29. J. M. Romano and K. J. Kuchenbecker. 2009. The AirWand: Design and characterization of a largeworkspace haptic device. In 2009 IEEE International Conference on Robotics and Automation, 1461–1466. https://doi.org/10.1109/ROBOT.2009.5152339 30. Yuriko Suzuki and Minoru Kobayashi. 2005. Air jet driven force feedback in virtual reality. IEEE Computer Graphics and Applications 25, 1: 44–47. https://doi.org/10.1109/MCG.2005.1 31. Yuriko Suzuki, Minoru Kobayashi, and Satoshi Ishibashi. 2002. Design of Force Feedback Utilizing Air Pressure Toward Untethered Human Interface. In CHI ’02 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’02), 808–809. https://doi.org/10.1145/506443.506608 32. Colin Swindells, Alex Unden, and Tao Sang. 2003. TorqueBAR: An Ungrounded Haptic Feedback Device. In Proceedings of the 5th International Conference on Multimodal Interfaces (ICMI ’03), 52– 59. https://doi.org/10.1145/958432.958445 33. Takeshi Tanabe, Hiroaki Yano, and Hiroo Iwata. 2017. Evaluation of the Perceptual Characteristics of a Force Induced by Asymmetric Vibrations. IEEE Transactions on Haptics PP, 99: 1–1. https://doi.org/10.1109/TOH.2017.2743717 34. Mohamed Yassine Tsalamlal, Paul Issartel, Nizar Ouarti, and Mehdi Ammi. 2014. HAIR: HAptic feedback with a mobile AIR jet. In 2014 IEEE International Conference on Robotics and Automation (ICRA), 2699–2706. https://doi.org/10.1109/ICRA.2014.6907246 35. Jessica Tsimeris, Tom Gedeon, and Michael Broughton. 2012. Using Magnetic Forces to Convey State Information: An Exploration of a Haptic Technology. In Proceedings of the 24th Australian Computer-Human Interaction Conference (OzCHI ’12), 620–623. https://doi.org/10.1145/2414536.2414630"
    }, {
      "page": 10,
      "region": {
        "x1": 316.77459716796875,
        "x2": 557.6996459960938,
        "y1": 63.93577575683594,
        "y2": 679.8413696289062
      },
      "text": "36. Balemir Uragun and Ibrahim N. Tansel. 2014. The noise reduction techniques for unmanned air vehicles. In 2014 International Conference on Unmanned Aircraft Systems (ICUAS), 800–807. https://doi.org/10.1109/ICUAS.2014.6842325 37. Malte Weiss, Chat Wacharamanotham, Simon Voelker, and Jan Borchers. 2011. FingerFlux: Nearsurface Haptic Feedback on Tabletops. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST ’11), 615–620. https://doi.org/10.1145/2047196.2047277 38. Kyle N. Winfree, Jamie Gewirtz, Thomas Mather, Jonathan Fiene, and Katherine J. Kuchenbecker. 2009. A high fidelity ungrounded torque feedback device: The iTorqU 2.0. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 261–266. https://doi.org/10.1109/WHC.2009.4810866 39. Kotaro Yamaguchi, Ginga Kato, Yoshihiro Kuroda, Kiyoshi Kiyokawa, and Haruo Takemura. 2016. A Non-grounded and Encountered-type Haptic Display Using a Drone. In Proceedings of the 2016 Symposium on Spatial User Interaction (SUI ’16), 43–46. https://doi.org/10.1145/2983310.2985746 40. H. Yano, M. Yoshie, and H. Iwata. 2003. Development of a non-grounded haptic interface using the gyro effect. In 11th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2003. HAPTICS 2003. Proceedings., 32–39. https://doi.org/10.1109/HAPTIC.2003.1191223 41. A. Zenner and A. Krüger. 2017. Shifty: A WeightShifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4: 1285–1294. https://doi.org/10.1109/TVCG.2017.2656978 42. Geomagic Touch (formerly Geomagic Phantom Omni) Overview. Retrieved September 12, 2017 from http://www.geomagic.com/en/products/phantomomni/overview/ 43. Novint Falcon. Retrieved September 12, 2017 from http://www.novint.com/index.php/products/novintfalcon 44. ExoHand | Festo Corporate. Retrieved September 13, 2017 from https://www.festo.com/group/en/cms/10233.htm 45. CyberGrasp. CyberGlove Systems LLC. Retrieved September 12, 2017 from http://www.cyberglovesystems.com/cybergrasp/ 46. Motion controllers. Retrieved December 19, 2018 from https://developer.microsoft.com/enus/windows/mixed-reality/motion_controllers 47. Finch Shift - Motion Controller for Your Smartphone. Retrieved January 5, 2018 from https://finch-shift.com/"
    }, {
      "page": 10,
      "region": {
        "x1": 54.0,
        "x2": 557.9970092773438,
        "y1": 757.56201171875,
        "y2": 764.0060424804688
      },
      "text": "Paper 525 Page 11"
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 316.79998779296875,
        "x2": 378.2519836425781,
        "y1": 211.71597290039062,
        "y2": 218.15997314453125
      },
      "text": "REFERENCES"
    }
  }]
}