{"authors": "Kashyap Todi; Gilles Bailly; Luis A Leiva; Anti Oulasvirta", "pub_date": "", "title": "Adapting User Interfaces with Model-based Reinforcement Learning", "abstract": "Adapting an interface requires taking into account both the positive and negative efects that changes may have on the user. A carelessly picked adaptation may impose high costs to the user -for example, due to surprise or relearning efort -or \"trap\" the process to a suboptimal design immaturely. However, efects on users are hard to predict as they depend on factors that are latent and evolve over the course of interaction. We propose a novel approach for adaptive user interfaces that yields a conservative adaptation policy: It fnds benefcial changes when there are such and avoids changes when there are none. Our model-based reinforcement learning", "sections": [{"heading": "", "text": "Figure 1: We present a model-based reinforcement learning approach for adaptive UIs that can improve usability while avoiding unexpected changes that surprise the user or require relearning. An interface is adapted by simulating several possible sequences of adaptations and evaluating them using predictive models in HCI. This approach avoids greedy, disadvantageous adaptations, and may anticipate possible user responses even with limited observation data.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "INTRODUCTION", "text": "Adaptive user interfaces can autonomously change the content, layout, or style of an interface to improve their ft with the user's capabilities and interests. This paper looks at a foundational technical problem of adaptive interfaces that lies at the intersection of human-computer interaction and machine learning research: How to select adaptations? An adaptive system must decide what to adapt, and when -or when not -to make changes. Diferent computational approaches to this problem have been studied, among others, rule-based systems, heuristics, bandits, Bayesian optimisation, and supervised learning (see section 2). Although positive empirical results have been obtained (e.g., [4,13,17,46,49,51,52,54]), known approaches have been criticised for being unpredictable and unreliable; they pick detrimental adaptations unacceptably often [16,22,33,36,56]. Estimation of utility is required for selecting an adaptation. Utility -in this case -refers to the usefulness of an adaptation to the user, or how it is perceived to beneft interaction when possible costs are taken into account. Picking an adaptation can be considered a hypothesis on how useful it is for user. Unfortunately, utility is very hard to estimate accurately -hard both at design time as well as interactively from the kind of data these systems have access to, such as clicks or viewing duration. In machine learning terms, utility is latent. Moreover, in adaptive interaction, utility is also non-stationary. That is, the skills and interests of the user evolve over time. A change that would make sense in the beginning when the user is novice with the design may be devastating for an experienced user.\nWe believe that adaptive systems could provide greater benefts by planning sequences of adaptations that gracefully lead a user through gradual changes. However, non-stationarity makes planning challenging: considering only a short period of time (i.e. a short horizon) can result in suboptimal designs. An adaptation that is overft to a novice could be impossible to recover from later on when the user is more experienced. On the other hand, planning a long sequence of adaptations increases the size of search space, growing exponentially with the length of the planning horizon.\nModel-based reinforcement learning is here developed as a principled and efective approach to these issues. We defne the adaptation problem as a stochastic sequential decision problem [7], where the adaptive system should plan a sequence of adaptations over a long horizon. Reinforcement learning (RL) is a class of machine learning methods appropriate for this type of problems. Typically, a policy is learnt via trial-and-error that maximises future cumulative utility. Our RL approach is model-based as it uses predictive HCI models to estimate utility. These models simulate consequences -benefts and costs -of possible adaptation sequences without actually executing them [28,50]. However, their application is conditioned on their accuracy: They should accurately predict short-term costs such as due to relearning as well as longer-term improvements to performance. Generally, such models are available at least in the areas of pointing, menu interaction, and graphical layouts. In comparison with an alternative, the model-free approach, the model-based approach requires less training and better generalises across conditions [28,50]. However, fnding the best adaption -by assessing the value of each sequence of adaptations with predictive models -is computationally costly, especially when considering sequences of changes over a long horizon. To solve this computational problem in an online setting, we use a combination of Monte Carlo Tree Search (MCTS) for planning, and deep learning to boost performance. To avoid extensive trial-and-error with users in the loop, our deep learning models are trained ofine using HCI models.\nOur general approach can be applied for various HCI applications, such as adaptive mobile homescreens, graphical layouts, and application menus. We demonstrate it specifcally in the context of adaptive menus. The task is to adapt the interface by changing the arrangement and grouping of menu items (Figure 1), thus improving the menu's usability. We exploit and extend multiple menu search models from literature to estimate the upper and lower bounds of the value of an adaptation as well as their change as the user learns. This helps us form an adaptation policy that accounts for diferent user strategies and avoids adaptations that incur high costs to users. Our technical evaluation shows that our solution can tackle realistic problem sizes, and fnd favourable adaptations, on a commodity computer. Finally, we present results from an empirical evaluation where the approach compared favourably against a non-adaptive baseline design and a frequency-based adaptation policy.\nTo sum up, this paper makes three key contributions:\n(1) A new formulation for adaptive interfaces that formalises them as a stochastic sequential decision-making problem; (2) Development of model-based reinforcement learning for planning adaptations in the case where users learn; (3) Application in adaptive menus with demonstrated benefts to usability.", "n_publication_ref": 18, "n_figure_ref": 1}, {"heading": "PREVIOUS WORK: MACHINE LEARNING METHODS FOR ADAPTIVE INTERFACES", "text": "Our work contributes to methods for adaptive interfaces designed to operate autonomously, that is without explicit feedback or training samples from user. The core computational problem we review here is how to pick an adaptation; we do not cover issues like prior elicitation, explainability, nor the design space of intelligent interaction techniques.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Rules, heuristics, and logic", "text": "Early work on this topic studied rule systems, heuristics, and logic as the basis of deciding what to adapt (see, e.g., [44]). For example, in menu-based interaction, most systems still follow a heuristic approach, where adaptation is picked based on hand-written heuristics that exploit click frequency, visit duration, recency or other specifc features that can be computed from observation data [21]. These approaches, in general, are feasible only when sensed input is highly predictive of the most appropriate adaptation. Another limitation is that writing a comprehensive and accurate rule system requires plenty of foresight. A rule system must be developed that, on the one hand, covers conceivable conditions the system can enter and, on the other, can graciously resolve conficts when multiple rules apply.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Machine learning", "text": "The prevailing understanding is that learning is a key capability for adaptive systems [32]. Two learning capabilities are needed: (1) inference, the capability to update assumptions about the user based on observations; and (2) decision-making, the capability to choose appropriate adaptation in the light of assumptions about the user [41]. The two challenges can be relaxed, for example if user state is trivially known, or if the state is highly predictive of appropriate adaptation. In the latter case, the problem can be approached as a supervised learning problem, where a mapping is learned between user data and suitable adaptations. While this approach has been successful for input techniques, such as gesture recognition [57], it is an open question if this scales up to adaptive interfaces, which must not only learn user state but fexibly decide how to intervene in the user interface. A practical obstacle is how to obtain a dataset that describes the consequences of possible adaptations on possible users.\nIn the rest of the section, we focus on the general case, where both inference and decision-making are required and non-trivial.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Bandit systems and Bayesian optimisation", "text": "Bandit systems are one of the most successful probabilistic approaches to this problem, not only for recommendation systems but also for interface design and adaptation [38]. Each adaptation is modelled as an 'arm' associated with a distribution describing expected gains. Given prior data and new evidence on the measured success of an adaptation, bandits use Bayes theorem to update expectation. Importantly, a principled solution is ofered to the exploration/exploitation problem. Methods like Thompson sampling can optimally balance between exploring actions, to learn about which actions work, and exploitation, to converge to good designs.\nBayesian optimisation generalises bandit systems to the case of multiple interrelated decision variables [47]. It is a global optimisation method that tries to fnd optimal adaptation by probing to a black box function; here, the user. It is a robust and sample-efcient and well-suited for noisy, expensive-to-evaluate functions. The method uses a surrogate model for approximating the model ft across the parameter space and quantify uncertainty. This is necessary for the acquisition rule to address the exploration-exploitation trade-of. This way, it is possible to learn adaptive responses via trial and error. Applications have been shown in human-in-the-loop design of interface features [15] and adaptation of low-dimensional design features [30]. However, while bandits and BO have been successful in simpler adaptation problems, like recommendations and calibration of interface parameters, their intrinsic limitation is that they are myopic; that is, they do not plan over a series of changes -a capability we need in adaptive interaction.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Reinforcement learning", "text": "Unlike bandits, reinforcement learning permits learning policies for sequences of actions where rewards are not immediately achievable. While applications have been shown for example in crowdsourcing [14], dialogue systems [58], and gaze-based interactions [20], a known limitation with the prevailing model-free RL approach is still the extensive amount of poor attempts (or trials) that are required to learn a good policy [50] This makes it poorly suitable for situations with very large state-action spaces.\nModel-based RL uses a predictive model to simulate possibilities without frst trying them out, which is useful for adaptive interfaces, because it signifcantly improves the efciency of fnding good solutions [28]. A policy can be determined with much fewer trials, and if the model is good, at times directly. Outside of user interfaces, we fnd applications of model-based RL, for example in board games, robots, video games [29], as well as behaviour-change applications, such as in generating behavioural instructions for people with dementia [23]. A grand obstacle for applications in adaptive systems is the model: where to get a good one? A related problem is that of drift: prediction errors can have a compounding, cumulative efect on planning performance. In HCI, although previous work has explored the use of model-free RL (e.g., see [35]), model-based RL has not been explored in adaptive interfaces at large, as far as we know. Also, while predictive models have been used for oneshot design generation [42], design space exploration [53], and for selecting a single action in a myopic manner [27,51], they have not been used for simulation-based planning in an adaptive system.\nIn this paper, we approach the fundamental problem of selecting user interface adaptations by applying model-based RL, and exploiting predictive HCI models, to simulate and plan adaptations.", "n_publication_ref": 12, "n_figure_ref": 0}, {"heading": "PROBLEM FORMULATION", "text": "We formulate the problem of adaptation as a stochastic sequential decision-making problem [7]. The adaptive system must decide what to adapt, if anything, given its observations. It should pick a sequence of adaptations in order to maximise their expected value to user over a longer window of interactions. For example, in our application example later on, we optimise for performance improvements in menu selection tasks achievable over multiple sessions of interactions. Further, in a stochastic problem, the world is neither fully known nor under the control of the system. In our case, while the system can change the interface, it cannot change the human, which has its own latent processes. For example, humans learn and change interests. This complicates the problem: Any greedily chosen adaptation may lead to irreversibly poor interactions later on. Thus, adaptations must be picked with a horizon of such developments in mind.\nIn the following, we formulate this problem as a Markov decision process (MDP). The beneft of an MDP formulation is that it ofers a rigorous and actionable understanding of the problem. In particular, it (1) illuminates the decision problem, (2) links it to a body of theoretical results and practical approaches in AI and ML research, and (3) points toward appropriate algorithmic solutions.\nThe problem of adaptive interfaces is that of maximising expected cumulative discounted rewards r (s t , a t ) from acting according to an optimal policy π * (see e.g. [26]):\n\" # ∞ Õ π * = argmax E π γ t r (s t , a t )(1)\nπ t =0 p(s t +1 |s t , a t )\nwhere,\n• s ∈ S is a state of interaction; This consists of both the interface design (d) and the user (u)\n• a ∈ A is an adaptation; i.e. a change that can be carried out on the interface. • p is a transition function; it provides the probability of transitioning from state s to state s t +1 after performing adaptation a; i.e., p(s t +1 |s t , a t ). • r is a reward collected for making adaptation a in state s.\n• γ is a discount factor controlling for how much to favour immediate (small γ ) vs. long-term (large γ ) reward.\nConsider the case of adapting the homescreen layout of smartphones, consisting of a grid of application icons. Here, a state s of the system consists of both the homescreen design d and latent state of the user u who is interacting with the device. More specifcally, the design d can encapsulate factors such as the arrangement of icons, their grouping or relationship to other icons, and other relevant features. With regard to the user u, aspects such as expertise, interests, and abilities, can be considered.\nGiven an initial homescreen design, with which the user has interacted, an adaptation a would result in a new design by, for example, changing the layout or ordering of icons. Upon adaptation, the transition function p specifes how the internal state of the user (e.g. their expertise) changes along with the external design state. The reward r then signifes the beneft an adaptation provides to the user by improving future interactions, for example, by reducing the time required to select an icon. Finally, the discount factor γ indicates to the adaptive system how immediate benefts and long-term improvements contribute towards the reward. Given this setting, the goal of the system is to fnd a suitable policy τ that can be used to select adaptations that maximise the estimated cumulative reward.\nFinding a policy to select adaptations can be challenging for adaptive interfaces. While the true state of the design is fully observable, the system does not have access to the true state of the user. We can only estimate it through HCI models, where predictions provide us a belief about the user status (for the theoretical implications of this, see [2]). Further, due to the lack of user feedback, computing reward is not straightforward. Instead, predictive HCI models can be used to build objective functions related to performance and re-learning costs. Note that this formulation does not take a stance on what is the 'right' objective function. Finally, at any given state, there is a large number of possible adaptations that can change the design. When considering a sequence of adaptations over a long horizon, the state space grows exponentially. In the following, we describe how these challenges are addressed via model-based RL.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "METHOD: DEEP MODEL-BASED REINFORCEMENT LEARNING", "text": "The core of this approach considers planning: the selection of a sequence of adaptation with the goal of maximising utility to user. Planning algorithms such as minimax and A-star, among others, utilise a tree representation of the search space. They have found several applications (e.g. game-playing [8], circuit-routing [11], etc.). The tree consists of nodes, connected by branches, representing valid states and transitions between them. However, classic tree search algorithms often require expansion of the entire tree. This is computationally expensive given the large number of possible adaptations (breadth) and long horizons (depth) in adaptive interfaces.\nMonte Carlo Tree Search (MCTS) has been successfully employed in various game-playing applications to plan a sequence of moves effciently (see [9]). MCTS can operate under uncertainty by analysing the most promising moves, and expanding tree nodes using random sampling based approaches. A well-known, inspiring application of MCTS is in AlphaGo [48], the computer program capable of playing the game of Go competitively against human players. A key insight here has been to incorporate neural networks to help predict which branches have highest expected value, and thereby deal with larger problem instances. In our work, we incorporate a value neural network to compute longer sequence cases faster.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Planning with MCTS", "text": "In contrast to game-playing applications, where a win/loss defnes the terminal state, our case does not have a well-defned horizon. The user could keep interacting for years. We thus need to estimate a cumulative reward over a horizon of reasonable length. In other parts, our solution follows standard implementations of MCTS (Figure 2):\n1. Selection: When a user concludes an interaction session, the root state s 0 is given by the current design d 0 and user observations u 0 . A state s j ∈ S is selected via Upper Confdence Trees (UCT), a widely used estimator in model-based planning [31]. A key feature is that it has a coefcient C to balance between exploration and exploitation when evaluating several possible UI adaptations:\ns r j ln n i UCT = + C (2) n j n j\nwhere r j is the total reward for child state s j , n j is the number of times s j has been visited, and n i is the number of times parent state s i has been visited. Exploration constant C in our application is set √ to 1/ 2 following convention. If all adaptations from the selected state s j have been previously explored, then selection is repeated until a leaf state is selected with unexplored adaptations.\n2. Expansion: The selected node s j is next expanded by picking an adaptation a ∈ A that results in a new state s j+1 . At this point, n j+1 , r j+1 = 0. In our application, we further assume that the expanded state is either visible or invisible to the user. Invisibility can be exploited to plan multiple adaptations in a single turn.\n3. Roll-outs and simulations: During one roll-out, as the tree has no value estimates to inform the selection of consequential states, adaptations {a 0 , . . . , a N } ∈ A are chosen at random, and rewards are estimated using predictive HCI models. All models simulate what would happen with that adaptation sequence and return an estimate of values over the whole window. This is repeated for a fxed number of steps, given by the horizon H , and cumulative rewards are computed for each predictive model: 4. Backpropagation: At the end of a simulation, the cumulative reward r j+1 is backpropagated from the newly-expanded state s j+1 to the initial state s 0 , and values (rewards r and visits n) are updated.\nH Õ r j+1 = r k (3) k =j+2 u 0 d 0 u 1 d 1 u n d n u 2 d\nThe above steps (1-4) are repeated several times to obtain value estimates for each adapted state.\nSelecting the next adaptation: Given these value estimates, the system can now choose the best adaptation (by setting C = 0 in Equation 2) to maximise expected utility for the user while avoiding costly changes.\nWe support several ways for selecting adaptation that allows controlling for the trade-of between risk and gain. Our approach assumes that there are multiple predictive HCI models that bound the true behaviour, for example by ofering best-case and (realistic) worst-case estimates. Alternatively, predictive models can be included to address multiple objectives, such as task completion time, cognitive load, and disruption [25]. Combining value estimations from all models, we can implement diferent objective functions, such as:\n(1) Average: The mean of rewards from each model gives total reward r , thus accounting for varying user strategies. (2) Optimistic: The system assumes optimal user strategy, and selects the model that maximises rewards. (3) Conservative: The system ensures that no user strategy is harmed by selecting the lowest-possible reward, and penalising negative rewards.", "n_publication_ref": 2, "n_figure_ref": 1}, {"heading": "Value Estimation with Deep Neural Networks", "text": "To address large problem sizes in online settings, where repeating a sufcient number of MCTS simulations to attain robust estimates is infeasible, we develop a deep neural network architecture that can efciently provide predictions in real-time.\nIn place of rollouts, where simulations can be costly for longer horizons, a pretrained value network is used to directly obtain value estimates for unexplored states.  As illustrated in Figure 3, we propose an m-headed n-tailed architecture that is trained end-to-end with backpropagation. Each of the m input parameters is treated as an independent model branch (head) that is eventually concatenated and passed to n independent model branches (tails). During ofine training, model-based data is generated using MCTS roll-outs from randomly sampled initial states. Value estimates, along with state (design and user) information, are given as input samples to a deep neural network model. Elementary design and user features are parameterised with the neural network model. This is then used to predict value estimates for any given state in an online setting. Note that we decouple value estimations from objective functions (see above), leaving it up to the adaptive system to decide how to use information from multiple models. The main advantages of using neural networks for estimation are that they have high learning capacity, and can evaluate thousands of states in real-time without running expensive simulations.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Applications in Adaptive Interfaces", "text": "With certain conditions we outline here, the approach we outline is broadly useful across applications of adaptive interfaces. For example, it can be used to adapt the structure of webpages layouts,  arrange icons on mobile homescreens, or reorganise application menus. Depending on the application, the goal or objective can differ and might include minimising selection time, increasing saliency, reducing cognitive load, increasing engagement, or a combination of them. The approach can handle diferent types of adaptations including the presentation of the graphical elements (position, size, colour, etc.) or their behaviour (number of elements, animations, etc.). For any application case, a core aspect of our approach relies on HCI models [42] to sufciently accurately capture the efects of these adaptations on the chosen goals. For instance, Fitts' law [39] can be used to adapt the location and the size of an elements to minimise pointing time. Other practical limitations include the size of state-action space. In the following section, we demonstrate our approach with an application in adaptive menus, and present a novel HCI model to predict selection time in menus.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "APPLICATION: ADAPTIVE MENUS", "text": "To demonstrate the applicability of our approach, we tackle a challenging and open question in the feld of adaptive interfaces: adaptive menus. Menus have received extensive attention in HCI research because they are widely used, and adaptation has potential to improve usability [4,55]. It is known that unexpected changes in menus can introduce a temporary performance drop, increase cognitive load, and potentially lead to the rejection of the adaption/techniques [4,55]. No general solution has been proposed for autonomous adaptation that could not only move items to the top, but handle reorganisations more comprehensively. We provide a general solution here considering linear menus with up to 20 items, which covers a wide number of menus typically found in common operating systems, applications, and websites [3,4,6]. As menu adaptations, we only consider those modifying the position and grouping of items in the menus, leaving other presentation adaptations, such as highlighting and split menus, for future work. While we consider linear menus with textual labels, our solution can be extended to address the problem of adaptive homescreens (introduced in section 3) by extending the menu search model to consider two-dimensional grids and graphical icons.", "n_publication_ref": 7, "n_figure_ref": 0}, {"heading": "Problem Defnition", "text": "Following the general formulation in section 3, we frst defne the adaptive menu problem. Figure 4 presents an exemplary illustration.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "State (S):", "text": "A state s ∈ S gives information about the menu design and the user.\nWe defne a design d ∈ D as a pair < L, M > where L is a nonhierarchical linear menu [40] containing an ordered list of items. An item is either a word or a separator (used to create semantic groups). M is an association matrix defning the semantic relatedness between menu items. In our implementation, M is given by the designer as binary relationships by specifying lists of related items. For common words, it can be inferred using word embedding models [43].\nThe system observes user clicks on menu items to approximate a user's expertise and interest. We use a simplifed version of the learning component from ACT-R [1] to compute user expertise for each menu item i l in a menu with n items:\nn Õ B(i l ) = (T − T j,i l ) −ρ(4)\nj=1\nwhere B(i l ) is the level of activation of item i at location l in the memory, T is the current time, T j,i l is the time of the j th selection of i l , and ρ is a decay parameter equal to 0.5. User interest (or prediction scheme [55]) is given by the frequency distribution of commands selected during the previous interaction session, containing N clicks. Additional statistical models of user interest and expertise [18,19,21,51], can be plugged into our architecture. Feasible Adaptations (A): The set of possible adaptations A, through which a menu can be reorganised, includes (1) moving a menu item to a certain position, (2) swapping two items, (3) adding or removing a separator, (4) moving an entire group, (5) swapping two groups, and (6) not making any changes.\nTransition function (p): We use MCTS, where the probability of making an adaptation from state s 0 to s 1 is given by UCT (Equation 2). During planning, we balance between exploiting highreward adaptations and exploring others. When selecting an adaptation a to make on the current design d 0 , resulting in a new design d 1 , a greedy strategy is chosen:\nr j argmax(5)\na n j Reward (r ): We extend predictive HCI models of menu use to obtain reward estimates. A key feature of these models is to take into account the implicit cost of adaptations. Given a pair of menu designs and estimates of user expertise and interest, these models predict selection time for items for varying user strategies. For each model, the reward r then is the diference in average selection time, weighted by user interest. Rewards from multiple models can be combined using any of the objective functions given in section 4.1.\nWhen an adapted state is assumed to be displayed (visible) to the user, we simulate an interaction session (new clicks) based on user interest, and update expertise accordingly. Conversely, the system can use invisible states to withhold presentation and combine multiple adaptations, such that the state is used only as a pathway to another state without being displayed. Here, no user updates are applied.", "n_publication_ref": 8, "n_figure_ref": 0}, {"heading": "Models for Simulating Menu Search", "text": "Several predictive models explain how users search within linear menus [5,10,12,24,40]. We build on these models to defne three search strategies, and use these to evaluate the utility of a menu design by simulating search tasks, illustrated in Figure 5:\n(1) Serial search: The user searches serially, from top to bottom, until the desired item is found in the menu. (2) Foraging search: Grouping of items is exploited such that the user only searches for the target within relevant groups. (3) Recall search: The user relies on memory to search for the desired item at an expected location in the menu. Our choice of the three models was made with the hypothesis that they would provide bounds for best-case and worst-case performance. In the beginning, best-case performance would be governed by foraging and serial search, but as experience accumulates, the (rational) user would shift to foraging based and recall-based strategies. But making the assumption that a user might -for reasons like lack of efort or interest -use a poor strategy allows us to defne a conservative policy for adaptation that is unlikely to annoy them. We note that it is possible to plug in additional search strategies (e.g. Random search [40]) without modifying the general architecture of the algorithm.\nTable 1: Key notations used in this section.", "n_publication_ref": 6, "n_figure_ref": 1}, {"heading": "Notation Description", "text": "Target item i at location l T model (i)\ni l", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Search time for an item i with a given model δ Constant for inspection cost of an item", "text": "Constant surprise penalty when an item is not found as expected T trail", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "T c", "text": "Constant pointing time when the cursor trails eye gaze Boolean relationship between items i k and i l , from association matrix M B(i l )\nM(i k , i l )\nActivation level for i at l 5.2.1 Serial search. When searching for a menu item i e at an expected position e, serial search [5,13,40] consists of a top-tobottom inspection of the menu, until the item is reached. Inspection (or reading) cost for any item i l is given by: δ\nT read (i l ) = (6) 1 + B(i l )\nwhere B(i l ) is the activation of i at l, and δ is the cautious inspection cost constant when there is no activation. The total serial search time for a target at expected location e is thus given by: e Õ T serial (i e ) = T read (i j ) + T trail (7) j=1\nWhere T trail is a constant pointing time assuming that the mouse cursor trails the eye-gaze (tracking strategy) during serial search [5,10].\nIn an adapted menu, if the item's new location a is before the expected location e (a ⩽ e), the search time reduces following Equation 7. However, if a is after e (a ⩾ e), surprise penalty T c is imposed upon not fnding the item as expected. Following this, the user cautiously inspects the remaining items at a slower rate δ . The total search time is:\nT serial (i a ) = T serial (i e ) + T c + (a − e) • δ + T pointing(8)\nTo support serial search, it is advantageous for an adaptive system to move frequently-used items towards the top.", "n_publication_ref": 6, "n_figure_ref": 0}, {"heading": "Foraging search.", "text": "Here, semantic structure (grouping) is exploited to avoid wasting time inspecting groups that most likely do not contain the target item [4]. The anchor, or frst element of a group, \"signals\" what is in the group. If the anchor is unrelated to the target, the user skips the group. If the anchor is related, the user performs a serial search within this group.\nConsider a menu where n д is the number of groups, n д (i e ) is the location of the group that contains the target (i e ), and e the expected target location within the group. M(д j , i e ) ∈ [0, 1] specifes if i e is associated to an anchor д j . In a well-organised menu, where the anchor of one of the groups is related to the target item, foraging search time is:\nn Õ д (i e ) T forage (i e ) = T read (д j ) +(9)\nj=1 min(e(д j ),s(д j ))\nÕ ª M(д j , i e ) • T read (i k )® + T trail k =1\n¬ where s(д j ) is the size of the group, and e(д j ) is the location of the target item t e within group д j if it is located within the group, ∞ otherwise. Finally, T trail remains the constant pointing time when the mouse cursor trails the eye gaze. Thus, items within related groups are inspected serially until the target is successfully found.\nIn a poorly organised menu, where the target item is not located within the expected group(s), a user frst attempts foraging search by inspecting all anchors, and all items within related anchors (given by Equation 9). Upon not fnding the item, a surprise penalty T c is incurred, and the user reverts to serial search under caution from the top of the menu.\nTo support foraging search, it is desirable for an adaptive system to create groups of related items, or eliminate groups where items have no associations. (a) when the target is at an expected location, search proceeds as expected; (b) when the target is at an unexpected location, a penalty is imposed upon not fnding the target at its expected location (indicated by ×), and search reverts to slower strategies.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Open", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "5.2.3", "text": "Recall search. Recall (direct) search [5] relies on user's memory, given by activations B, to directly glance at items without inspecting the entire menu. For a target item i, if there are no activations B i above a threshold θ (we use 0.5), the user reverts to serial search (Equation 7). When B(i l ) ⩾ θ for a target i l at location l, the user attempts recall search by inspecting the item at l (Equation 6).\nIf found at l, the user then performs a pointing task. Here, the visual search and pointing task are performed sequentially as eye movement is faster than mouse movement [5]. We use Fitts' law to estimate pointing time in menus:\nT pointing (i l ) = a p + b p • log(1 + i l ) (10\n)\nwhere a p = 10.3 and b p = 4.8 according to [5].\nIf not found at l, after incurring surprise penalty T c , the user attempts local search, by randomly inspecting N local items in the vicinity of location l.\nT local (i l ) = T c + δ • N local + T trail(11)\nIn non-ordered menus, N local is equal to 2 times the number of items in the Fovea. In semantic menus, N local is the number of items in the group.\nIn an adaptive menu, the target item i might have been encountered at several locations. Here, the user attempts recall search at all locations l ∈ L where B(i l ) ⩾ θ , until the target is found. The total recall search time for target i a at adapted location a is given by:\nl ± Õ N /2 T recall (i a ) = T pointing (i a ) + T read (i l ) + T local (i l ) (12) l ∈L:B(i l )⩾θ\nIf recall search fails (a < L or B(t, a) < θ ), the user eventually reverts to serial search under caution (Equation 8).\nTo support recall, it is advantageous for an adaptive system to place frequently-encountered items at locations where they have been seen before.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "Neural Network for Rewards Estimation", "text": "The above search models enable us to predict selection times for varying user strategies. By simulating consequences of adaptations during roll-outs, we can estimate implications of design changes on user performance. However, given the varying length of menu sizes, running simulations with long horizons can be infeasible for online settings. For example, for a menu with 15 items, and up to 8 separators, there are over 500 feasible adaptations. To address large problem sizes, we instantiate our general network architecture (Figure 3) for adaptive menus. The key idea is anticipate the rewards for a given menu adaptation taking into account the previous menu design and the user behaviour. The model inputs are: (1) design head: adapted menu design, association matrices of the current and adapted menu; (2) user head: previous and current clicks distribution. The model outputs reward predictions for each of the three search models: serial, foraging, and recall. Figure 6 illustrates the model architecture.\nEach input is treated as an independent model branch (head) that is eventually concatenated and passed to three independent model branches (tails), one for each output reward. Each item in the adapted menu is converted to a one-hot encoded vector, fattened, and then passed to a fully connected layer. The association matrices are difed and passed to a long short-term memory (LSTM) layer, then passed to a fully connected layer. Finally, the click history is passed to an LSTM layer, which models sequential data and is  designed to handle long-term dependencies, and is then passed to a fully connected layer.\nThe concatenated inputs are passed to each network tail, which comprises two stacked fully connected layers. At the end of each tail, we use linear activation to predict each reward, since they are not bounded. For regularisation purposes, our architecture uses Dropout layers with drop rate 0.5 before each of the fully connected layers. This prevents overftting the model to the training data, improving generalisability to unseen data. The loss function for all model tails is the mean squared error (MSE), which is computed as the average of the squared diferences between the predicted and the actual values, which penalises large errors. We use the RMSProp optimiser, a popular stochastic gradient descent algorithm with momentums. We use learning rate η = 0.001 and decay factor β = 0.9 for the optimiser. We train the model for 200 epochs at most, using early stopping (10 epochs patience) to retain the best model weights, and monitor its performance on a validation set comprising 20% of training data. After training, our model achieved remarkable performance: MSE ser ial = 0.149, MSE f or aдe = 0.408, MSE r ecall = 0.431.", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "EVALUATION", "text": "We validate our method, applied to adaptive menus, through technical and empirical evaluations.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Technical Evaluation", "text": "We conducted a technical evaluation with realistic and challenging scenarios, where the adaptive system must adapt menus for simulated users. The two main questions we seek to answer are:\n(1) Can a model-based planning approach successfully and consistently improve predicted usability?\n(2) Does our neural network based solution scale it up to address larger problem sizes?\n6.1.1 Tasks. Menu Designs and User Interest: We considered 3 menu sizes -5, 10, and 15 items -to address varying cases, from short contextual menus to longer application menus. In addition, up to 8 separators were allowed for grouping, resulting in menus with up to 23 items. We picked common labels for menu items, where categories specifed pairwise associations (e.g. animals, furniture, vegetables, clothing). For each menu size, we created 4 starting menu designs by randomly assigning labels to item positions. We used a Zipfan distribution to reasonably model menu usage [13,37]. We sampled 8 diferent click histories by randomly assigning frequency to item labels. This resulted in 3×8×4 = 96 confgurations, each assigned to a diferent simulated user. Reward Estimation: We compare two methods of estimating rewards: model-based simulations and value neural network predictions. With model-based simulations, predictive models are used during roll-outs to estimate rewards for each state. With value network predictions, our pre-trained network models are used to predict value estimates for each state. ", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Adapt x 3", "text": "Figure 7: A sample result from the simulation study, for a 15item menu design. In 3 steps, the menu was adapted to better suit the given user's interests ('Gloves' group moved to the top), and improved some grouping ('Carrot' with 'Potato') as well.\nused a GNU/Linux server with an Intel Xeon Gold CPU @ 2.10 GHz (64 bit processor) for simulations. The execution of the study was automated such that trials were conducted sequentially, to avoid variations in computational resource usage.\nDuring each trial, a combination of {menu size × user history × menu design × objective function × reward source} was selected, and given as input to the system. In a constrained setting, the MCTS algorithm was allowed 400 iterations, and a shallow roll-out horizon of 4 steps, to build the search tree and fnd suitable adaptations.\n6.1.3 Result: Success Rate. With the above setup, we frst evaluated whether our approach, and implementation, could successfully identify promising adaptations. As dependent variable, we measured success rate of fnding benefcial adaptations. We defne a successful trial as one where the predicted selection time is improved by adaptation. Figure 7 shows an example result for a challenging case with a 15-item menu.\nThe overall success rate with model-based simulation was 92.7%, indicating that in most cases an improvement was found. Similarly, with the value network, success rate was 89.6%. These results support our approach towards planning menu adaptations that can improve user performance.  6, 8, and 10 -depicting a range of planning horizons, from short sequences to longer sequences.\nFigure 8 illustrates computation time results for each depth level (for 400 MCTS iterations). We observe that for depths ≤ 4, the value network does not provide much beneft. However, as search depth increases, while the computation time with our value network remains constant (mean M = 7.77s, SD = 1.0), it drastically increases with simulations (from M = 7.9s, SD = 3.5s at depth 4 to M = 39.0s, SD = 7.4 at depth 10).", "n_publication_ref": 0, "n_figure_ref": 3}, {"heading": "Empirical Evaluation", "text": "The primary goal of this evaluation is to test whether our planning approach (henceforth MCTS) applied to linear menus improves performance in comparison with static menus (Static), and with the well-known frequency-based adaptive approach (Freqency) as a baseline (e.g. as in [34]). In MCTS, the menu adapts after each block by planning adaptations; in Static, the menu does adapt over time; in Freqency, the menu adapts based on the frequency of clicks on menu items. To this end, we conducted a lab study where participants completed selection tasks in a within-subject design with three conditions (Static, Freqency, MCTS).", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Materials.", "text": "For the experiment, linear menus with 15 item labels were randomly generated. Items labels were selected from common categories (e.g. animals, fruits, countries, etc.) to avoid prior biases. For each participant, two menus were generated for each of the three conditions, resulting in six unique menus. To avoid confusion, there were no overlaps in item labels or categories between the menus for a participant.\nFor each menu within a condition, a Zipfan distribution, known to accurately capture real-world command selections [13,37], with shape s = 1.5 was used to control the frequency distribution of target items. The same frequency distribution was used for all three conditions within a participant. Unique frequency distributions were generated for every participant, to consider variance in user interests. These frequency distributions were then used to generate sequences of target items, to be presented as stimulus during the trials.\n6.2.2 Participants. 18 participants (10 masculine, 8 feminine, 0 others), aged 18 to 38 (mean 27.2), with varying educational backgrounds, were opportunistically recruited. All participants reported frequent desktop or mobile, and web usage. Participation was compensated with a movie ticket voucher (approx. €12.00).", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Apparatus.", "text": "The experiment was conducted on a Macbook Pro, with a 15\" Retina display. An Apple Magic Mouse with default tracking speed was used for selection tasks. The study interface was implemented using HTML and Javascript, and was displayed in a browser window. Timestamped cursor movements and clicks on menu items were recorded. 6.2.4 Stimulus and Task. The target item name was displayed at the top of the browser window. Participants began a trial by clicking on a confrm button, upon which the menu was displayed directly below. Errors were logged, and participants had to select the target item to fnish the trial. Upon clicking the target item, the menu was hidden, and a short break was provided. 6.2.5 Procedure and design. The experiment began with an introductory briefng and participant consent. In a within-subject experimental design, each participant tested the three conditions (Static, Freqency, MCTS) sequentially. Condition order was counterbalanced between participants using a 3×3 Latin square.\nDuring each condition, the participant interacted with two diferent menus during 3 blocks. Within a block, the two menus appeared in an alternating order, separated by short breaks (3 seconds). For each menu, 20 selection tasks (trials) were completed. We introduced this design to refect the fact that (1) users perform several sessions of work in the real life (one session == 1 block), (2) users regularly switch between applications within a session, and thus use diferent menus [45]: we wanted to avoid undesirable efects due to repetitive selection within a single menu, and (3) each menu has a diferent selection frequency, given by two Zipfan distributions.\nParticipants took mandatory breaks (1 minute) between two consecutive blocks, and longer breaks (5 minutes) between conditions where they answered open-ended interview questions. In summary, the design is: 18 participants × 3 conditions × 3 blocks × 2 menus × 20 selections = 6480 trials. Target Item Position: Given the menu selection scenario, items near the top of the menu are typically faster to select than items that are near the bottom. However, this selection time depends not only on the cursor movement distance, but also the user's ability to search for items in the menu. To get a better understanding of how the diferent conditions infuenced performance, we further looked at how target item positions in the menu infuence selection time. Figure 9b illustrates the linear increase in selection time with target position for the three conditions. It can be observed that while selection time for the top-most items (lower target positions) is quite similar for the three conditions, with MCTS being the fastest, it increases more drastically for the Freqency condition, as compared to Static and MCTS. When we exclude the top-three target items, the diference in selection time between MCTS (mean = 2454 ms) and Freqency (mean = 2799 ms) is 344 ms (i.e. Freqency is about 15% slower). 6.2.7 Qalitative Results. During the study, participants were not informed about adaptations (if any) in advance. After each block, we asked them whether they noticed changes to menus during use, and their opinions about these changes (if any). 15 participants commented that they noticed changes in the Freqency condition, but only 2 participants noticed how these changes were occurring. Participants commented that the reordering was confusing, and prevented them from remembering item locations: \"I might skip down instead of checking the top, and then go back to the top. \" (P3). In the Static condition, participants could use their memory to directly access some items, but commented on the lack of proper grouping: \"the items were not consistent in their grouping, and they were not intuitively grouped\" (P11). In the MCTS condition, participants noticed that the categorisation of items into groups improved upon adaptation, and helped them in searching for related items: \"the items were organised under categories often -that helped select items\" (P18).", "n_publication_ref": 1, "n_figure_ref": 1}, {"heading": "Summary", "text": "Results from our simulation-based evaluation ofer evidence for our approach and technical solutions. First, MCTS-based planning consistently proposes adaptations that could improve predicted performance (Figure 9a). Second, as search depth increases, our results indicate that value network is more efcient for estimating reward predictions. Further, results from our user study highlight benefts over a static and an adaptive baseline. Through model-based planning, we can adapt menus that improve overall performance, as given by reduced selection time. A common pitfall of the frequencybased approach is that, although it can improve performance for commonly-used items or commands, it prevents recall and makes selection of other items increasingly difcult. In contrast, we observed (Figure 9b) that adaptations made through our approach could provide these benefts while avoiding costly changes that require relearning and cause annoyance.", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "CONCLUSION", "text": "We have presented a model-based reinforcement learning method suitable for adaptive interactions. While recent successes of reinforcement learning have created renewed enthusiasm toward this  approach in HCI, applications to adaptive user interfaces have remained scarce. To apply this class of machine learning methods for selecting adaptations, we have proposed the use of predictive models in HCI for value estimation during planning. We have presented solutions to several consequent technical challenges, most notably:\n• How to model the decision problem in adaptive interfaces for model-based RL; • How to estimate MCTS roll-outs using HCI models; • How to design deep neural networks to boost planning.\nTo study and demonstrate the viability of the approach, we have applied it to the challenging case of adaptive menus by extending predictive models. Our simulated and empirical evaluations suggest signifcant and practically valuable improvements to usability. Importantly, the adaptive system does not require explicit user input, but is still able to perform conservatively without disadvantageous or annoying changes (Figure 10). Our empirical evaluation reveals that this approach can work even when starting from poor designs that would be hard to recover with approaches that do not consider planning. Future adaptive applications can beneft from our general approach by exploiting and extending predictive models of interaction.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Limitations and Future Work", "text": "We see exciting topics for future research on model-based RL and its applications in HCI. First, one limitation to the applicability of the approach is the requirement for accurate models of short-and long-term consequences of adaptations. So far we have assumed that such models are expressed as step-by-step computer simulations or mathematical models. However, there is no reason why data-driven models (e.g. [59]) -trained on larger datasets of user data -could not be used for this purpose, signifcantly expanding the scope of possible applications. Second, algorithm engineering is needed to deploy this approach to larger applications. In particular, presently, with our computing resources, problem sizes of up to 20 items are still within reach in the case of menu systems. To improve performance beyond that, techniques for GPU computation and more efcient training will need attention. Finally, while our work successfully used a value network, further improvements can be expected by implementing a policy network [48].\nTo conclude, we hope our work can be broadly appealing, and invite contributions from both the HCI and the machine learning community. At the core of model-based RL is an understanding of how users behave and what makes a good design in given conditions. We believe that future applications can beneft from this approach to improve interactions.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "OPEN SCIENCE", "text": "We support adoption and further research eforts by providing an open code repository, with examples and instructions, on our project page: https://userinterfaces.aalto.fi/adaptive.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "We thank all study participants for their time, and colleagues and reviewers for their helpful comments. This work was funded by the Department of Communications and Networking (Comnet), the Finnish Center for Artifcial Intelligence (FCAI), Academy of Finland projects 'Human Automata' and 'BAD', Agence Nationale de la Recherche (grant number ANR-16-CE33-0023), and HumaneAI Net (H2020 ICT 48 Network of Centers of Excellence).", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "The atomic components of thought", "journal": "Psychology Press", "year": "2014", "authors": "R John; Christian J Anderson;  Lebiere"}, {"title": "A POMDP Extension with Belief-dependent Rewards", "journal": "Curran Associates, Inc", "year": "2010", "authors": "Mauricio Araya; Olivier Bufet; Vincent Thomas; Françcois Charpillet"}, {"title": "Flower Menus: A New Type of Marking Menu with Large Menu Breadth, within Groups and Efcient Expert Mode Memorization", "journal": "", "year": "2008", "authors": "Gilles Bailly; Eric Lecolinet; Laurence Nigay"}, {"title": "", "journal": "Visual Menu Techniques. ACM Comput. Surv", "year": "2016-12", "authors": "Gilles Bailly; Eric Lecolinet; Laurence Nigay"}, {"title": "Model of Visual Search and Selection Time in Linear Menus", "journal": "", "year": "2014", "authors": "Gilles Bailly; Antti Oulasvirta; Duncan P Brumby; Andrew Howes"}, {"title": "Men-uOptimizer: Interactive Optimization of Menu Systems", "journal": "", "year": "2013", "authors": "Gilles Bailly; Antti Oulasvirta; Timo Kötzing; Sabrina Hoppe"}, {"title": "Annual ACM Symposium on User Interface Software and Technology (UIST '13", "journal": "", "year": "", "authors": ""}, {"title": "Decision-making in a fuzzy environment", "journal": "Management science", "year": "1970", "authors": "E Richard; Lotf Asker Bellman;  Zadeh"}, {"title": "A taxonomy of parallel game-tree search algorithms", "journal": "ICGA Journal", "year": "1996", "authors": " Mark G Brockington"}, {"title": "A Survey of Monte Carlo Tree Search Methods", "journal": "IEEE Transactions on Computational Intelligence and AI in Games", "year": "2012", "authors": "Cameron B Browne; Edward Powley; Daniel Whitehouse; Simon M Lucas; Peter I Cowling; Philipp Rohlfshagen; Stephen Tavener; Diego Perez; Spyridon Samothrakis; Simon Colton"}, {"title": "ACT-R/PM and menu selection: applying a cognitive architecture to HCI", "journal": "International Journal of Human-Computer Studies", "year": "2001", "authors": "Michael D Byrne"}, {"title": "ASA-routing: A-Star Adaptive Routing Algorithm for Network-on-Chips", "journal": "Springer International Publishing", "year": "2018", "authors": "Yuan Cai; Xiang Ji"}, {"title": "A Predictive Model of Human Performance With Scrolling and Hierarchical Lists", "journal": "Human-Computer Interaction", "year": "2009", "authors": "Andy Cockburn; Carl Gutwin"}, {"title": "A Predictive Model of Menu Performance", "journal": "", "year": "2007", "authors": "Andy Cockburn; Carl Gutwin; Saul Greenberg"}, {"title": "POMDP-based control of workfows for crowdsourcing", "journal": "Artifcial Intelligence", "year": "2013", "authors": "Peng Dai; H Christopher; Daniel S Lin;  Weld"}, {"title": "Crowdsourcing Interface Feature Design with Bayesian Optimization", "journal": "Association for Computing Machinery", "year": "2019", "authors": "John J Dudley; Jason T Jacques; Per Ola Kristensson"}, {"title": "A Comparison of Static, Adaptive, and Adaptable Menus", "journal": "Association for Computing Machinery", "year": "2004", "authors": "Leah Findlater; Joanna Mcgrenere"}, {"title": "Ephemeral Adaptation: The Use of Gradual Onset to Improve Menu Selection Performance", "journal": "Association for Computing Machinery", "year": "2009", "authors": "Leah Findlater; Karyn Mofatt; Joanna Mcgrenere; Jessica Dawson"}, {"title": "AccessRank: Predicting What Users Will Do Next", "journal": "Association for Computing Machinery", "year": "2012", "authors": "Stephen Fitchett; Andy Cockburn"}, {"title": "Composition during serial learning: A serial position efect", "journal": "J. Exp. Psychol. Learn. Mem. Cogn", "year": "1994", "authors": "A Peter;  Frensch"}, {"title": "Learning Cooperative Personalized Policies from Gaze Data", "journal": "Association for Computing Machinery", "year": "2019", "authors": "Christoph Gebhardt; Brian Hecox; Daniel Bas Van Opheusden; James Wigdor; Otmar Hillis; Hrvoje Hilliges;  Benko"}, {"title": "SAM: A Modular Framework for Self-Adapting Web Menus", "journal": "Association for Computing Machinery", "year": "2019", "authors": "Camille Gobert; Kashyap Todi; Gilles Bailly; Antti Oulasvirta"}, {"title": "Adaptive personalized interfaces-A question of viability", "journal": "Behaviour & Information Technology", "year": "1985", "authors": "Saul Greenberg; Ian H Witten"}, {"title": "Assisting persons with dementia during handwashing using a partially observable Markov decision process", "journal": "", "year": "2007", "authors": "Jesse Hoey; Axel Von Bertoldi; Pascal Poupart; Alex Mihailidis"}, {"title": "Cognitive Modeling Reveals Menu Search in Both Random and Systematic", "journal": "", "year": "1997", "authors": "J Anthony; David E Hornof;  Kieras"}, {"title": "A Probabilistic Mental Model for Estimating Disruption", "journal": "Association for Computing Machinery", "year": "2009", "authors": "Bowen Hui; Grant Partridge; Craig Boutilier"}, {"title": "When to trust your model: Model-based policy optimization", "journal": "", "year": "2019", "authors": "Michael Janner; Justin Fu; Marvin Zhang; Sergey Levine"}, {"title": "Modelling Learning of New Keyboard Layouts", "journal": "Association for Computing Machinery", "year": "2017", "authors": "P P Jussi; Sayan Jokinen; Antti Sarcar; Chaklam Oulasvirta; Zhenxin Silpasuwanchai; Xiangshi Wang;  Ren"}, {"title": "Reinforcement learning: A survey", "journal": "Journal of artifcial intelligence research", "year": "1996", "authors": "Leslie Pack Kaelbling; Andrew W Michael L Littman;  Moore"}, {"title": "Model-based reinforcement learning for atari", "journal": "", "year": "2019", "authors": "Lukasz Kaiser; Mohammad Babaeizadeh; Piotr Milos; Blazej Osinski; H Roy; Konrad Campbell; Dumitru Czechowski; Chelsea Erhan; Piotr Finn; Sergey Kozakowski;  Levine"}, {"title": "Optimal Sensor Position for a Computer Mouse", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Sunjun Kim; Byungjoo Lee; Antti Thomas Van Gemert;  Oulasvirta"}, {"title": "Bandit Based Monte-Carlo Planning", "journal": "Springer-Verlag", "year": "2006", "authors": "Levente Kocsis; Csaba Szepesvári"}, {"title": "Machine learning for adaptive user interfaces", "journal": "", "year": "1997", "authors": "Pat Langley"}, {"title": "2010-08. Benefts and Costs of Adaptive User Interfaces", "journal": "Int. J. Hum.-Comput. Stud", "year": "2010-08", "authors": "Talia Lavie; Joachim Meyer"}, {"title": "Quantitative results assessing design issues of selection-supportive menus", "journal": "International Journal of Industrial Ergonomics", "year": "2004", "authors": "Dong-Seok Lee; Wan Chul Yoon"}, {"title": "Computer-Supported Form Design Using Keystroke-Level Modeling with Reinforcement Learning", "journal": "", "year": "2019", "authors": "Katri Leino; Kashyap Todi; Antti Oulasvirta; Mikko Kurimo"}, {"title": "Interaction-Based User Interface Redesign", "journal": "Association for Computing Machinery", "year": "2012", "authors": "Luis Leiva"}, {"title": "Efects of Frequency Distribution on Linear Menu Performance", "journal": "Association for Computing Machinery", "year": "2017", "authors": "Wanyu Liu; Gilles Bailly; Andrew Howes"}, {"title": "Interface Design Optimization as a Multi-Armed Bandit Problem", "journal": "Association for Computing Machinery", "year": "2016", "authors": "J ; Derek Lomas; Jodi Forlizzi; Nikhil Poonwala; Nirmal Patel; Sharan Shodhan; Kishan Patel; Ken Koedinger; Emma Brunskill"}, {"title": "Fitts' Law as a Research and Design Tool in Human-Computer Interaction", "journal": "Hum.-Comput. Interact", "year": "1992-03", "authors": "I ; Scott Mackenzie"}, {"title": "The psychology of menu selection: Designing cognitive control at the human/computer interface", "journal": "", "year": "1991", "authors": " Kent L Norman"}, {"title": "Computational interaction", "journal": "Oxford University Press", "year": "2018", "authors": "Antti Oulasvirta"}, {"title": "Combinatorial Optimization of Graphical User Interface Designs", "journal": "", "year": "2020", "authors": "Antti Oulasvirta; Ramesh Niraj; Morteza Dayama; Maximilian Shiripour; Andreas John;  Karrenbauer"}, {"title": "Glove: Global vectors for word representation", "journal": "", "year": "2014", "authors": "Jefrey Pennington; Richard Socher; Christopher D Manning"}, {"title": "Model-Based Automated Generation of User Interfaces", "journal": "", "year": "1994", "authors": "Angel R Puerta; Henrik Eriksson; John H Gennari; Mark A Musen"}, {"title": "Retroactive Transfer Phenomena in Alternating User Interfaces", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Reyhaneh Raissi; Evanthia Dimara; Jacquelyn H Berry; Wayne D Gray; Gilles Bailly"}, {"title": "Split Menus: Efectively Using Selection Frequency to Organize Menus", "journal": "ACM Trans. Comput.-Hum. Interact", "year": "1994-03", "authors": "Andrew Sears; Ben Shneiderman"}, {"title": "Taking the human out of the loop: A review of Bayesian optimization", "journal": "Proc. IEEE", "year": "2015", "authors": "Bobak Shahriari; Kevin Swersky; Ziyu Wang; P Ryan; Nando De Adams;  Freitas"}, {"title": "Mastering the game of Go with deep neural networks and tree search", "journal": "Nature", "year": "2016", "authors": "David Silver; Aja Huang; Chris J Maddison; Arthur Guez; Laurent Sifre; George Van Den; Julian Driessche; Ioannis Schrittwieser; Veda Antonoglou; Marc Panneershelvam;  Lanctot"}, {"title": "Deep Sequential Recommendation for Personalized Adaptive User Interfaces", "journal": "Association for Computing Machinery", "year": "2017", "authors": "Harold Soh; Scott Sanner; Madeleine White; Greg Jamieson"}, {"title": "Reinforcement learning: An introduction", "journal": "MIT press", "year": "2018", "authors": "S Richard; Andrew G Sutton;  Barto"}, {"title": "Familiarisation: Restructuring Layouts with Visual Learning Models", "journal": "", "year": "2018", "authors": "Kashyap Todi; Jussi Jokinen; Kris Luyten; Antti Oulasvirta"}, {"title": "Individualising Graphical Layouts with Predictive Visual Search Models", "journal": "ACM Trans. Interact. Intell. Syst", "year": "2019-08", "authors": "Kashyap Todi; Jussi Jokinen; Kris Luyten; Antti Oulasvirta"}, {"title": "Sketchplore: Sketch and Explore with a Layout Optimiser", "journal": "Association for Computing Machinery", "year": "2016", "authors": "Kashyap Todi; Daryl Weir; Antti Oulasvirta"}, {"title": "Bubbling Menus: A Selective Mechanism for Accessing Hierarchical Drop-down Menus", "journal": "Association for Computing Machinery", "year": "2007", "authors": "Theophanis Tsandilas; M C "}, {"title": "Exploring a Design Space of Graphical Adaptive Menus: Normal vs", "journal": "Small Screens. ACM Trans. Interact. Intell. Syst", "year": "2019-07", "authors": "Jean Vanderdonckt; Sara Bouzit; Gaëlle Calvary; Denis Chêne"}, {"title": "Attentive User Interfaces", "journal": "Commun. ACM", "year": "2003-03", "authors": "Roel Vertegaal"}, {"title": "Vision-Based Gesture Recognition: A Review", "journal": "", "year": "1999", "authors": "Ying Wu; Thomas S Huang"}, {"title": "", "journal": "", "year": "", "authors": "Heidelberg Springer Berlin"}, {"title": "POMDPbased statistical spoken dialog systems: A review", "journal": "", "year": "2013", "authors": "Steve Young; Milica Gašić; Blaise Thomson; Jason D Williams"}, {"title": "Modeling Human Visual Search Performance on Realistic Webpages Using Analytical and Deep Learning Methods", "journal": "Association for Computing Machinery", "year": "2020", "authors": "Arianna Yuan; Yang Li"}], "figures": [{"figure_label": "3", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 3 :3Figure 3: Neural network architecture for obtaining value estimates. Training data is generated using HCI models.", "figure_data": ""}, {"figure_label": "4", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 4 :4Figure 4: Menu adaptation with deep model-based RL. Given a current design and user observations, MCTS-based planning is used to select the next adaptation. Reward estimates are obtained either using predictive models or from a neural network.", "figure_data": ""}, {"figure_label": "5", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 5 :5Figure 5: Model-based simulation of search for a target item ('Save As...').(a) when the target is at an expected location, search proceeds as expected; (b) when the target is at an unexpected location, a penalty is imposed upon not fnding the target at its expected location (indicated by ×), and search reverts to slower strategies.", "figure_data": ""}, {"figure_label": "6", "figure_type": "", "figure_id": "fig_3", "figure_caption": "Figure 6 :6Figure 6: Our value network architecture takes menu design and user features as input to provide individual reward predictions.", "figure_data": ""}, {"figure_label": "14", "figure_type": "", "figure_id": "fig_4", "figure_caption": "6. 1 . 414Result: Scalability. To assess the scalability of our solution, we compared computation time for model-based simulations vs. value network predictions. In addition to the horizon of 4 steps used to evaluate success rate, we evaluated 3 other search depths -", "figure_data": ""}, {"figure_label": "8", "figure_type": "", "figure_id": "fig_5", "figure_caption": "Figure 8 :8Figure 8: Computation time for planning adaptations via model-based simulations vs. value network for varying search depths. Our value network exhibited consistent performance for longer horizons.", "figure_data": ""}, {"figure_label": "269", "figure_type": "", "figure_id": "fig_6", "figure_caption": "6. 2 . 6 Figure 9 :269Figure 9: (a) The MCTS condition was associated with signifcantly lower selection time as compared to the two baselines. Vertical bars indicate 95% confdence intervals. (b) For items positioned lower in the menu, selection time in Freqency increased more drastically than other conditions.", "figure_data": ""}, {"figure_label": "10", "figure_type": "", "figure_id": "fig_7", "figure_caption": "Figure 10 :10Figure 10: Sequential adaptation of a 5-item menu. The system avoids greedily moving 'Cofee' (lowest frequency) at the frst step. In light of new observations, this change is justifed by the reduced user interest.", "figure_data": ""}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Model-based planning of adaptations using Monte-Carlo Tree Search (MCTS). Adaptations are selected using upperconfdence trees (UCT). After expanding a new node (adaptation), reward estimates are obtained through roll-outs, and backpropogated to the root node. The child with the highest value is picked as the next adaptation.", "figure_data": "1. Selection2. Expansion3. Roll-out4. Backpropogationt 0d 0u 0d 1nu 1nt 2d 0 d 0u 0 u 0selectt 12...d 1u 1d 2u 2...d nu nPredictive Modelsd 1n1u 1n1t 3d 1u 1d 2u 2...d n d nu n u nselectsimulateort 2d 11u 11...d 1nu 1nd 11u 11...d 1nu 1n expandestimate Value Network v θd 11u 11...d 1nu 1n backpropogated 1n1u 1n1t Hd 1n1u 1n1Figure 2:"}, {"figure_label": "", "figure_type": "table", "figure_id": "tab_5", "figure_caption": "6.1.2 Implementation. Our MCTS-based planning algorithm, and the predictive menu models, are implemented in Python 3.7. The value neural network is implemented with TensorFlow 2.0.0. We", "figure_data": "User Interest(Frequencies)Gloves: 0.6Carrot: 0.16Panda: 0.1Table: 0.06Beans: 0.06Bikini: 0.02(Others: 0)Predicted AverageSelection Time (s)13.6s Current7.2s Adapted"}], "doi": "10.1145/3411764.3445497"}