{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.79800033569336,
      "x2": 295.74102783203125,
      "y1": 384.1158447265625,
      "y2": 560.9030151367188
    },
    "text": "ABSTRACT In this paper, we report three user experiments that investigate in how far the perception of a bar in a bar chart changes based on the height of its neighboring bars. We hypothesized that the perception of the very same bar, for instance, might differ when it is surrounded by the top highest vs. the top lowest bars. Our results show that such neighborhood effects exist: a target bar surrounded by high neighbor bars, is perceived to be lower as the same bar surrounded with low neighbors. Yet, the effect size of this neighborhood effect is small compared to other data-inherent effects: the judgment accuracy largely depends on the target bar rank, number of data items, and other data characteristics of the dataset. Based on the findings, we discuss design implications for perceptually optimizing bar charts."
  },
  "figures": [{
    "caption": "Figure 4: Hypothesized data-inherent effects from true rank and number of data items in two baseline conditions.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 294.31085205078125,
      "y1": 212.33035278320312,
      "y2": 228.928955078125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "4",
    "page": 5,
    "regionBoundary": {
      "x1": 73.0,
      "x2": 275.0,
      "y1": 92.0,
      "y2": 199.0
    }
  }, {
    "caption": "Figure 2: Parallel Line Illusion. The target line on the right side in both figures has exactly the same lengths. However, when put next to a long contextual line (left figure) it is perceived shorter as it actually is. In contrast, when the contextual line is short (right side) the target line is overestimated as too long. Length contrast is at play.",
    "captionBoundary": {
      "x1": 317.60498046875,
      "x2": 559.7950439453125,
      "y1": 211.05636596679688,
      "y2": 271.48992919921875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "2",
    "page": 1,
    "regionBoundary": {
      "x1": 337.0,
      "x2": 539.0,
      "y1": 92.0,
      "y2": 198.0
    }
  }, {
    "caption": "Figure 5: Model 1 predictions and regression samples (scatterplots, alpha = 0.03): Errors against true target bar ranks, indicating the influence from ranks.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 295.6378479003906,
      "y1": 269.6543884277344,
      "y2": 297.21197509765625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "5",
    "page": 6,
    "regionBoundary": {
      "x1": 85.0,
      "x2": 263.0,
      "y1": 92.0,
      "y2": 256.0
    }
  }, {
    "caption": "Figure 6: Error against rank, indicating the data-inherent effects from datasets. Error means and 95% CIs are plotted for each target bar.",
    "captionBoundary": {
      "x1": 317.9549865722656,
      "x2": 559.7950439453125,
      "y1": 272.5303649902344,
      "y2": 300.08795166015625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "6",
    "page": 6,
    "regionBoundary": {
      "x1": 317.0,
      "x2": 571.0,
      "y1": 92.0,
      "y2": 259.0
    }
  }, {
    "caption": "Table 2: Coefficients of multiple cubic regression using six predictors, i.e., two polynomial components of target bar rank (Rank), linear components including number of data items (N), skewness, kurtosis, and the interaction between Rank and N (N:Rank).",
    "captionBoundary": {
      "x1": 317.6259765625,
      "x2": 559.9960327148438,
      "y1": 318.3802185058594,
      "y2": 372.4669494628906
    },
    "figType": "Table",
    "imageText": ["(Intercept)", "6.37e+00", "6.65e+00", "0.96", "0.34", "Rank3", "8.50e-05", "1.47e-05", "5.80", "5.81e-08***", "Rank2", "-1.08e-02", "1.78e-03", "-6.06", "1.71e-08***", "N", "-1.26e+00", "1.53e-01", "-8.26", "2.61e-13***", "Skewness", "-2.39e+01", "2.07e+00", "-11.53", "<", "2e-16***", "Kurtosis", "1.50e+01", "3.02e+00", "4.97", "2.31e-06***", "N:Rank", "6.41e-03", "2.47e-03", "2.59", "0.01*", "Estimate", "Std.Error", "t", "value", "Pr", "(>|t|)"],
    "name": "2",
    "page": 6,
    "regionBoundary": {
      "x1": 318.0,
      "x2": 558.0,
      "y1": 388.0,
      "y2": 495.0
    }
  }, {
    "caption": "Figure 8: Predictions (color encodes datasets) and regression samples (scatterplots, alpha = 0.03) for B2 sorted condition. Data-inherent effects are of smaller effect size.",
    "captionBoundary": {
      "x1": 317.9549865722656,
      "x2": 559.7232666015625,
      "y1": 269.1643981933594,
      "y2": 296.72198486328125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "8",
    "page": 7,
    "regionBoundary": {
      "x1": 349.0,
      "x2": 527.0,
      "y1": 92.0,
      "y2": 256.0
    }
  }, {
    "caption": "Figure 7: Model 2 predictions (color encodes datasets) and regression samples (scatterplots, alpha = 0.03) for B1 random condition. Data-inherent effects are salient.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 294.032958984375,
      "y1": 269.8904113769531,
      "y2": 297.447021484375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "7",
    "page": 7,
    "regionBoundary": {
      "x1": 85.0,
      "x2": 263.0,
      "y1": 92.0,
      "y2": 256.0
    }
  }, {
    "caption": "Table 1: Overview of studies. Details include main results, number of participants recruited and remained after quality control, and number of tasks in each MTurk HIT.",
    "captionBoundary": {
      "x1": 53.46900177001953,
      "x2": 558.4336547851562,
      "y1": 94.7542724609375,
      "y2": 112.97601318359375
    },
    "figType": "Table",
    "imageText": ["Pilot", "1", "Neighborhood", "effects", "seem", "to", "exist;", "however,", "various", "confounds", "mask", "the", "effects.", "105", "94", "135", "Pilot", "2", "Modeling", "data-inherent", "effects", "that", "explain", "the", "confounds", "from", "study", "1.", "200", "184", "63", "(61)", "Main", "3", "With", "controlled", "confounds,", "the", "neighborhood", "effect", "is", "present", "with", "small", "effect", "size.", "283", "200", "72", "Study", "Result", "Recruited", "Used", "Tasks"],
    "name": "1",
    "page": 3,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 561.0,
      "y1": 128.0,
      "y2": 188.0
    }
  }, {
    "caption": "Table 3: Coefficients of Model 3, extending Tab.2 with the predictor neighborhood rank (Neighbor).",
    "captionBoundary": {
      "x1": 317.6259765625,
      "x2": 558.2125854492188,
      "y1": 316.52923583984375,
      "y2": 334.7509460449219
    },
    "figType": "Table",
    "imageText": ["(Intercept)", "1.38e+01", "1.52e+00", "9.10", "<", "2e-16***", "Rank3", "5.95e-05", "7.18e-06", "8.28", "<", "2e-16***", "Rank2", "-7.65e-03", "6.99e-04", "-10.95", "<", "2e-16***", "N", "-5.73e-01", "5.60e-02", "-10.22", "<", "2e-16", "***", "Skewness", "-2.51e+01", "4.74e-01", "-53.08", "<", "2e-16***", "Kurtosis", "7.70e+00", "6.54e-01", "11.77", "<", "2e-16***", "Neighbor", "-1.33e-02", "2.75e-03", "-4.84", "1.31e-06***", "N:Rank", "-3.27e-03", "9.56e-04", "-3.42", "0.000629***", "Estimate", "Std.Error", "t", "value", "Pr", "(>|t|)"],
    "name": "3",
    "page": 8,
    "regionBoundary": {
      "x1": 317.0,
      "x2": 559.0,
      "y1": 350.0,
      "y2": 469.0
    }
  }, {
    "caption": "Figure 9: Neighborhood effects: Mean errors and CIs in two neighborhoods with all 14,400 samples from study 3.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 294.0329895019531,
      "y1": 207.37240600585938,
      "y2": 223.97100830078125
    },
    "figType": "Figure",
    "imageText": [],
    "name": "9",
    "page": 8,
    "regionBoundary": {
      "x1": 73.0,
      "x2": 275.0,
      "y1": 92.0,
      "y2": 194.0
    }
  }, {
    "caption": "Figure 10: Model 3 predictions (color encodes datasets) and regression samples (scatterplots, alpha = 0.01) showing both neighborhood effects and data-inherent effects.",
    "captionBoundary": {
      "x1": 317.9549865722656,
      "x2": 558.1900634765625,
      "y1": 269.8423767089844,
      "y2": 297.39996337890625
    },
    "figType": "Figure",
    "imageText": [],
    "name": "10",
    "page": 8,
    "regionBoundary": {
      "x1": 349.0,
      "x2": 527.0,
      "y1": 92.0,
      "y2": 256.0
    }
  }, {
    "caption": "Figure 3: CIs for means of Error. We tested nine conditions: Three target bars (25%, 50%, 75%), each tested with three neighborhoods (lowest, similar, and highest).",
    "captionBoundary": {
      "x1": 317.65899658203125,
      "x2": 559.3375854492188,
      "y1": 345.7913818359375,
      "y2": 373.3480224609375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "3",
    "page": 4,
    "regionBoundary": {
      "x1": 349.0,
      "x2": 527.0,
      "y1": 92.0,
      "y2": 332.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.24800109863281,
        "x2": 295.0179748535156,
        "y1": 584.4166259765625,
        "y2": 711.1740112304688
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. Copyrights for components of this work owned by others than the author(s) must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee. Request permissions from permissions@acm.org. CHI 2019, May 4–9, 2019, Glasgow, Scotland UK © 2019 Copyright held by the owner/author(s). Publication rights licensed to ACM. ACM ISBN 978-1-4503-5970-2/19/05. . . $15.00 https://doi.org/10.1145/3290605.3300462"
    }]
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.2047119140625,
        "y1": 398.9701843261719,
        "y2": 417.4410095214844
      },
      "text": "• Human-centered computing→ Empirical studies in visualization;"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.95501708984375,
        "x2": 392.66754150390625,
        "y1": 384.1158447265625,
        "y2": 390.5419921875
      },
      "text": "CCS CONCEPTS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 557.6947021484375,
        "y1": 448.1181945800781,
        "y2": 454.6340026855469
      },
      "text": "Perception, Neighborhood, Order, Bar Chart, MTurk Study."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 375.55108642578125,
        "y1": 433.26385498046875,
        "y2": 439.69000244140625
      },
      "text": "KEYWORDS"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7023315429688,
        "y1": 477.66021728515625,
        "y2": 527.3599853515625
      },
      "text": "Mingqian Zhao, Huamin Qu, and Michael Sedlmair. 2019. Neighborhood Perception in Bar Charts. In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), May 4–9, 2019, Glasgow, Scotland UK. ACM, New York, NY, USA, 12 pages. https://doi.org/10.1145/3290605.3300462"
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.62298583984375,
        "x2": 415.4867858886719,
        "y1": 466.9253845214844,
        "y2": 472.56500244140625
      },
      "text": "ACM Reference Format:"
    }
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7442016601562,
        "y1": 561.6871948242188,
        "y2": 604.0679931640625
      },
      "text": "Bar charts are arguably on the most ubiquitous visualization techniques. Their usage ranges from casual users that seek to understand their personal data, to professional decision makers making delicate choices on such data representations."
    }, {
      "page": 0,
      "region": {
        "x1": 317.9547119140625,
        "x2": 559.8980712890625,
        "y1": 609.5081787109375,
        "y2": 711.6649780273438
      },
      "text": "As a natural consequence, many researchers have focused on gaining a detailed understanding of how bar charts and other common statistical graphics are perceived and interpreted by users. This line of research has unveiled many interesting and surprising facets. Previous work has, for instance, shown how contextual factors, such as biased social signals [17], priming and anchoring effects [14, 40], framing effects [22], decorations [26], luminance [37], plotting density [16, 37], and neighboring objects’ size [12, 42], can"
    }, {
      "page": 0,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 1"
    }, {
      "page": 1,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.73553466796875,
        "y1": 96.09918975830078,
        "y2": 222.1669921875
      },
      "text": "influence visual perception. Better understanding such factors is critical to design proper statistical graphics, and to avoid potential misinterpretations of the data. The goal of our work is to contribute a novel factor to this line of work: understanding neighborhood effects in bar charts. Given the prevalence of other visual biases, we were wondering in how far the perception of a bar’s height is influenced by the height of its neighboring bars. For instance, can we observe any perceived differences when the very same target stimulus bar is surrounded by the top highest vs. the top lowest bars?"
    }, {
      "page": 1,
      "region": {
        "x1": 53.001380920410156,
        "x2": 295.74102783203125,
        "y1": 227.606201171875,
        "y2": 664.5079956054688
      },
      "text": "The main psychological foundation that guides the neighborhood manipulation in our study is Parallel Line Illusion (PLI). PLI illustrates how the perceived length of a target stimulus line is altered by different contextual lines positioned in parallel to it [11, 18–20]. There are two distortions in PLI: length contrast and length assimilation [18, 20]. Length contrast occurs when the target line is distorted away from the contextual line, e.g., the target line perceived to be shorter when accompanied by a long contextual line as opposed to a short one; see Fig. 2. Length assimilation occurs when the target line is distorted towards the contextual line, e.g., target line perceived to be longer when accompanied by a long contextual line than by a short one. These two distortions shift from one to the other under certain conditions. A similar work to ours is Peebles’ empirical investigation on whether two adjacent bar values affect the perception of a target bar value in a simple five-bar chart [29]. The author observed a significant difference in target bar value judgments between two conditions (the target bar measuring ‘5’ surrounded by bars measuring ‘4, 4’ vs. by ‘1, 1’). Our goal is to expand on this work and provide a more systematic investigation into potential neighborhood effects in bar charts. Simultaneously, we aim at moving from this highlycontrolled, artificial setting towards a more realistic setting by examining real world datasets. Therefore, in this work we change the order of bars to keep datasets the same (constraint from real applications) instead of only changing the neighboring bar values (highly-controlled research setting). Towards that goal, we contribute three Amazon Mechanical Turk (MTurk) experiments with overall 52,101 trials and 587 participants, in which we study these neighborhood effects.We tasked participants with rank estimation tasks. Rank estimation is a common, yet so-far mostly overlooked task in bar charts, in which users seek to relate a specific target item to the whole dataset. For example, one might want to learn about the ranking of one’s own university, company, or sports club, according to some performance metric."
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.58734130859375,
        "y1": 669.9472045898438,
        "y2": 712.3289794921875
      },
      "text": "The results of our studies show that neighborhood effects exist in rank estimation tasks. When the same target bar is surrounded by the highest bars, the perceived target bar rank is lower than when it is surrounded by the lowest neighbors."
    }, {
      "page": 1,
      "region": {
        "x1": 317.6059875488281,
        "x2": 559.8922119140625,
        "y1": 298.93218994140625,
        "y2": 460.864990234375
      },
      "text": "This finding is in line with the length contrast distortion in PLI. Yet, the effect size of neighborhood effects is small. Altering from the highest to the lowest neighborhood leads to an approximate 1.32 increase in the target bar rank. This means that a target bar being perceived as at rank 60 in its highest neighborhood will be perceived as at rank 61.32 in its lowest neighborhood. However, this small effect is largely masked by other data-inherent effects, which reveal that the accuracy of this task mostly depends on true target bar rank, number of data items and two other data characteristics (skewness and kurtosis) of the datasets. After isolating, identifying and quantifying both data-inherent effects and neighborhood effects, we draw three possible implications for future bar chart designs based on our results:"
    }, {
      "page": 1,
      "region": {
        "x1": 333.427001953125,
        "x2": 558.4644775390625,
        "y1": 469.34130859375,
        "y2": 572.0670166015625
      },
      "text": "• Compared to random order, sorting bars according to real heights is of higher accuracy for conveying rank-related information. • Despite their existence, there is no need to worry too much about neighborhood effects in bar chart rank estimation tasks. • Skewness has a comparatively large effect on rank estimation though; additional clues might be used to convey rank-related information more precisely."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 411.0592041015625,
        "y1": 546.8328247070312,
        "y2": 553.2589721679688
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8987426757812,
        "y1": 621.4061889648438,
        "y2": 711.6080322265625
      },
      "text": "The neighborhood manipulation is related with ordering graphical components (i.e., how to map data to different graphical characteristics). This kind of mapping is a fundamental challenge in visual design, such as mapping rays in star plots. Various empirical studies exist that investigate effects of such ordering decisions. Klippel et al., for instance, studied how aligning variables to rays in star plots influences perceptual comparison tasks. They found that solely altering"
    }, {
      "page": 1,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 2"
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.1167297363281,
        "y1": 96.09918975830078,
        "y2": 186.301025390625
      },
      "text": "the assignments of two rays in an 8-ray star plot resulted in significant differences in response time and participants’ grouping behavior whereas this alter only evoked very few difference in perceived similarity [23]. Saket et al. compared between five different basic visualization types and revealed how they differ in effectiveness in ordering tasks [32]. To the best of our knowledge, no empirical studies had been conducted on ordering effects within bar charts."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.95501708984375,
        "x2": 455.9028015136719,
        "y1": 591.6078491210938,
        "y2": 612.97802734375
      },
      "text": "2 RELATEDWORK Empirical Studies on Ordering"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.7410583496094,
        "y1": 215.65118408203125,
        "y2": 413.45001220703125
      },
      "text": "Much empirical work has been conducted to better understand the widely adopted visual encoding of bar charts. Utilizing a common scale, bar charts for instance were found to offer higher accuracy for estimating component parts than other square-, circle-, or cube-based encodings [5, 7, 35, 38]. These works focused on tasks such as larger/smaller comparison, difference comparison and proportion extraction between a pair of bars [5, 16, 24, 35]. Cleveland & McGill studied 10 different pairs of bar values in simple bar charts ranging from .18 to .83 and found that the accuracy would decrease with increasing distances between the graphical elements [5], a finding that was further confirmed by Talbot et al. [39]. These studies focused on the accuracy of judging absolute bar heights or comparing the relative height between a pair of bars. No work had shed light on the visual judgment of bar ranks, namely the relative position within the whole group."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 212.67799377441406,
        "y1": 200.79689025878906,
        "y2": 207.2230224609375
      },
      "text": "Graphical Perception in Bar Charts"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.499000549316406,
        "x2": 295.7422790527344,
        "y1": 442.7991943359375,
        "y2": 712.3289794921875
      },
      "text": "Theoretically, our work is grounded in neighborhood effects in Parallel Line Illusion (PLI) research. PLI was used to explain many different illusions [19], such as the famous Miller-Lyer [21], Baldwin [30], and Ponzo illusions [4]. Within the PLI framework also two different length distortions were described. The perceived length assimilation describes perceiving a test line length towards a context line. Length contrast describes distorted perception of a test line length away from the context line. Which direction an effect has (assimilation or contrast) depends on the spatial [18, 19] and temporal [20] distance between the two lines. Based on PLI, Zacks et al. [44] attributed the difference in accuracy of judging absolute bar height to potential length assimilation and length contrast distortions. They hypothesized that these effects might be produced by the relative heights of bars in a figure and the relative heights of judged bars to its surrounding graphical frame [44]. Closest to our work, Peebles [29] explored whether the surrounding bar values affected perceived bar values in a simple bar chart (comprised of five bar components). They compared the perceived values of a target bar measuring ‘5’ under two conditions (the two adjacent bar values to be ‘1,1’ vs. ‘4,4’) [29]. Results showed a significant difference that the mean perceived value for"
    }, {
      "page": 2,
      "region": {
        "x1": 317.1579284667969,
        "x2": 558.4646606445312,
        "y1": 96.09918975830078,
        "y2": 174.34600830078125
      },
      "text": "‘1,1’ condition was ‘5.07’ while for ‘4,4’ was ‘4.96’. This is consistent with length contrast in PLI. Yet, this study only tested one, highly artificial stimulus chart. Building on PLI and these initial findings, we study length assimilation and length contrast effects in much more realistic settings of bar charts, with an eye towards making this theory applicable in visual design."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 147.50003051757812,
        "y1": 427.9448547363281,
        "y2": 434.3710021972656
      },
      "text": "Parallel Line Illusion"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8981323242188,
        "y1": 203.6961669921875,
        "y2": 377.583984375
      },
      "text": "The three studies were conducted in chronological order between May 2018 and September 2018. Study 1 (pilot) explored the existence of neighborhood effects with target bars at three different ranks being surround by three neighborhood conditions (highest, similar and lowest neighborhood). After identifying that other data-inherent effects had a strong confounding influence on our results, we conducted study 2 (pilot) to isolate and quantify these other effects by testing each bar in the chart under two baseline orders. In study 3 (main study), we offset the impact from these other data-inherent effects and validated the presence of neighborhood effects with target bars at six different ranks being surrounded by two neighborhood conditions (highest and lowest neighborhood). All three studies were conducted on MTurk. Details of each study are shown in Tab.1."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 387.1181335449219,
        "y1": 188.8418731689453,
        "y2": 195.26800537109375
      },
      "text": "3 OVERVIEW"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8980102539062,
        "y1": 406.9342041015625,
        "y2": 544.9559936523438
      },
      "text": "Following Peebles’ results [29] and fundamental PLI research [18], we hypothesized that neighborhood effects exist in bar charts. Jordan et al. [18] found that in very close neighborhoods/spatial separation (5mm) assimilation effects dominate, while in larger neighborhoods (100mm) contrast effects aremore common. In our case, thewidth of the neighborhood around the target bar (distance from the leftmost neighboring bar to the rightmost neighboring bar) was roughly in the range of 100mm. We thus hypothesized that contrast effects would occur. Surrounded by the top highest bars, the target bar rank would be perceived lower than that surrounded by the top lowest bars."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 368.5570983886719,
        "y1": 392.079833984375,
        "y2": 398.5059814453125
      },
      "text": "Hypothesis"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.656005859375,
        "x2": 558.5756225585938,
        "y1": 574.3062133789062,
        "y2": 664.5079956054688
      },
      "text": "To increase ecological validity, we carefully handpicked 15 nominal datasets which could be applied to a univariate bar chart from online resources statistics.com [36] and New York Times [28]. These 15 datasets were equally distributed into three groups with 9-13 bars (referred to as approx. 10 bars group), 18-24 bars (20 bars group), and 30-32 bars (30 bars group). Participants were recruited from MTurk and compensated at an hourly payment of $7.5."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 432.65911865234375,
        "y1": 559.4518432617188,
        "y2": 565.8779907226562
      },
      "text": "Datasets and Participants"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.47698974609375,
        "x2": 558.2122802734375,
        "y1": 693.8582153320312,
        "y2": 712.3289794921875
      },
      "text": "We task participants with the rank estimation task.We regard it as the simpler testbed (mainly involves one target bar and"
    }, {
      "page": 2,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 3"
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2398986816406,
        "y1": 205.79718017578125,
        "y2": 236.2230224609375
      },
      "text": "the others) for investigating neighborhood effects than other tasks, e.g., to compare heights between two bars (involves two targets and the rest). We calculate rank as"
    }, {
      "page": 3,
      "region": {
        "x1": 137.4239959716797,
        "x2": 183.91552734375,
        "y1": 247.90362548828125,
        "y2": 259.654052734375
      },
      "text": "Rank = OR"
    }, {
      "page": 3,
      "region": {
        "x1": 173.98199462890625,
        "x2": 294.0447082519531,
        "y1": 252.57029724121094,
        "y2": 266.489013671875
      },
      "text": "N × 100 (1)"
    }, {
      "page": 3,
      "region": {
        "x1": 53.43000030517578,
        "x2": 294.2386169433594,
        "y1": 274.79620361328125,
        "y2": 293.2669982910156
      },
      "text": "where OR denotes the ordinal rank, and N denotes number of data items in the dataset."
    }, {
      "page": 3,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.74102783203125,
        "y1": 298.7061767578125,
        "y2": 711.697998046875
      },
      "text": "We defined a manipulation neighborhood covering 20% of the entire chart (i.e., 2, 4, and 6 bars in the three groups); see gray shadow in Fig. 1 (c) & (e). Fig. 1 exemplifies our neighborhood manipulation process. Starting with a quasi-random alphabetical order, we first identified the set of highest or lowest neighboring bars (Fig. 1 (b) & (d)); we then swapped them with the initial neighborhood bars around the target (Fig. 1 (c) & (e)). The target bar (orange) was randomly chosen within the possible range. Choices that would cut off the neighborhoods at the sides of the chart were excluded. We formulated the rank estimation task as “How do you think about the height of the target bar highlighted in orange among the whole group?” We chose this formulation to avoid misunderstanding the task as comparing the target bar with another bar such as the highest one. We only showed each chart to participants for exactly one second. With this setting, we sought to prevent participants from precisely counting how many bars are above or below a target. We tested different time durations before the studies and found that one second gave the best tradeoff between bar chart perception and avoiding counting strategies. The whole chart (measuring about 960:500 pixels) was rendered in the center of the screen, below a control panel containing the question and a slider (measuring about 600 pixels). The target bar was highlighted in orange while the other bars filled in blue. Titles of data items are replaced with ordinal numbers. For all conditions, the visual appearance of bars and tasks were exactly the same. The auxiliary materials contain all stimuli and screenshots of the setup. Participants’ responses were collected on a continuous slider with #bar-times tick marks. The two ends were clearly marked as ‘Lowest’ and ‘Highest’ in order to avoid participants accidentally swapping the scale direction. Every time a new task started, the slider handle was visually hidden. The handle appeared after a click on the slider and could be"
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8906860351562,
        "y1": 205.79718017578125,
        "y2": 236.2230224609375
      },
      "text": "further adjusted then, always snapped to the nearest tick position though (ordinal rank). We measured estimation error in target bar rank as follows:"
    }, {
      "page": 3,
      "region": {
        "x1": 356.1739807128906,
        "x2": 493.5793762207031,
        "y1": 247.54331970214844,
        "y2": 261.37200927734375
      },
      "text": "Error = Perceived OR −True OR"
    }, {
      "page": 3,
      "region": {
        "x1": 439.0950012207031,
        "x2": 558.2017822265625,
        "y1": 254.28831481933594,
        "y2": 268.20599365234375
      },
      "text": "N × 100 (2)"
    }, {
      "page": 3,
      "region": {
        "x1": 317.656005859375,
        "x2": 558.2112426757812,
        "y1": 277.8132019042969,
        "y2": 296.28399658203125
      },
      "text": "Perceived OR denotes ordinal rank collected on sliders and True OR denotes the actual ordinal rank of the target bar."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 413.5799560546875,
        "y1": 679.0038452148438,
        "y2": 685.4299926757812
      },
      "text": "Experimental Setting"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8991088867188,
        "y1": 327.51318359375,
        "y2": 453.58099365234375
      },
      "text": "We set quality control tasks to ensure serious participation from crowdsourcing workers. In study 1 and 3, quality control trials which shared the same task (rank estimation) and setup with the main experiment were randomly inserted into the study. The target bars in quality control trials were either the top highest, the top lowest or the median bar in a sorted order according to heights. If a participant failed (absolute error of OR exceeded 25%) more than 50 percent of all the quality control tasks, his/her entire response was discarded. In study 2, we control data quality based on outlier detection in main study tasks."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 317.95501708984375,
        "x2": 389.3997497558594,
        "y1": 312.65985107421875,
        "y2": 319.08599853515625
      },
      "text": "Quality Control"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 317.9548034667969,
        "x2": 559.8908081054688,
        "y1": 484.8111877441406,
        "y2": 610.8779907226562
      },
      "text": "Following advise on good statistical practices [2, 6, 8, 25], we use a graphical presentation approach to present effect sizes and 95% confidence intervals (CIs). Specifically, we adopt the 95% corrected Cousineau-Morey CI generating method [2, 6], which is recommended for within-subject designs as it can strip out individual differences [2]. In regression analysis, we use adjusted R2 and stepwise model selection which is based on Akaike Information Criterion (AIC) [1] from both backward and forward directions to compare models. ANOVA tests (F-test and p-value) are adopted to test significance of models and predictors."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 402.78997802734375,
        "y1": 469.95684814453125,
        "y2": 476.38299560546875
      },
      "text": "Statistical Analysis"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 317.5870361328125,
        "x2": 558.4015502929688,
        "y1": 642.1978759765625,
        "y2": 711.3889770507812
      },
      "text": "Study 1 Objective:We set out to investigate neighborhood effects with target bars at three different ranks. Each target was surrounded by three neighborhood conditions. We expected to see substantial differences in the perceived rank task for different neighborhood conditions."
    }, {
      "page": 3,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 4"
    }, {
      "page": 4,
      "region": {
        "x1": 53.43000030517578,
        "x2": 305.2584533691406,
        "y1": 96.09918975830078,
        "y2": 377.5840148925781
      },
      "text": "Setup: The three target bars were chosen to be low bars (rank = 25,mean = 27.07, SD = 2.83), median bars (rank = 50,mean = 51.10, SD = 1.84), and high bars (rank = 75,mean = 77.52, SD = 1.73). The three neighborhood conditions consisted of the shortest bars, bars similar to the target (e.g., for target bars ranked at 50%, neighboring bars ranged from 40% to 60%), and the highest bars. Followed by manipulation procedures discussed in Section 3, reordering was performed on the alphabetical baseline. A within-subject study was conducted with 105 MTurk workers. The whole study lasted about 10 minutes. After 9 training tasks presented in a fixed order at the beginning, the main experiment contained 135 perceptual ranking tasks (135 Trials = 3 Tarдets × 3 Neiдhborhoods × 15 Datasets) and five quality control tasks was presented. Task order in the main experiment was randomized. To eliminate fatigue, we gave participants a 30s break after 5 minutes. Results:We accepted 94 responses after quality control and plotted the mean error (effect size and CI). Fig. 3 shows the results aggregated over all trials and datasets: mean errors above zero indicate overestimation, while errors below indicate underestimation. The figure is first organized by the target bar rank condition (25%, 50%, 75%), and then by neighborhood conditions (lowest, similar, highest)."
    }, {
      "page": 4,
      "region": {
        "x1": 53.499420166015625,
        "x2": 295.73785400390625,
        "y1": 383.023193359375,
        "y2": 485.1809997558594
      },
      "text": "Looking at the three different target bar rank groups (25%, 50%, 75%), we see a neighborhood effect within each of them. The highest neighborhood condition is always more underestimated than the other two (lowest, similar). That is, people tend to perceive target bar rank in its lowest neighborhood to be higher than that in its highest neighborhood. The similar neighborhood conditions have a substantial overlap with the lowest neighborhood conditions, so we cannot make reliable judgments about potential differences between them."
    }, {
      "page": 4,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7392883300781,
        "y1": 490.62017822265625,
        "y2": 712.3289794921875
      },
      "text": "Considering the results for each dataset separately (screenshots are available in the auxiliary material), we observe these neighborhood effects in 11 out of 15 datasets (19 out of 45 targets). In three other datasets (three out of 45 targets), we see a reversed pattern that is consistent with length assimilation distortion. Bar orders in the alphabetical baseline could be the confounds for inducing the reversed pattern. While we could see neighborhood effects within each of the three groups, we were surprised by the much stronger effects that exist between these groups. In Fig. 3, it is obvious that a large difference in error exists between the three target rank groups (25%, 50%, 75%). There is a substantial underestimation at 75%, a slight underestimation at 50%, and a slight overestimation at 25%. These are likely caused by other factors such as the choice of the target bar, or potentially also other data-inherent characteristics. One possible explanation for these effects might be anchoring and insufficient adjustment [10]. It is possible that participants swipe a horizontal line between the highest and lowest bars to be the ‘median’"
    }, {
      "page": 4,
      "region": {
        "x1": 317.656005859375,
        "x2": 559.8941040039062,
        "y1": 394.9512023925781,
        "y2": 533.0040283203125
      },
      "text": "height and then conservatively indicate whether the target bar is higher or lower than this height. Another possible explanation is the statistical phenomenon regression to the mean [9, 15] in repeated measurements. When viewers make decisions based on subjective probability distribution [13] (e.g., generating a quantification of certainty on how likely this target bar to be at certain rank), the estimates for an unknown target tend to cluster to the mean of population distribution, i.e., the median 50th percentile in our rank estimation task. Both these two explanations help us understand that estimations at 75% group are under- and those in the 25% group are overestimated."
    }, {
      "page": 4,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8932495117188,
        "y1": 547.496826171875,
        "y2": 712.3289794921875
      },
      "text": "Study 2 Objective: The purpose of study 2 was to isolate and quantify other data-inherent effects that might influence the rank estimation task. Two baseline conditions were chosen to model these data-inherent effects: (B1) random condition with data items randomly assigned to bar components and (B2) sorted condition with bars sorted in an ascending order according to real heights. Hypothesis: Based on the lessons learned from study 1, we hypothesized that a large proportion of error could be explained by the actual target bar rank and number of data items. To some degree also data characteristics such as coefficient of variance (ratio between standard deviation to mean), skewness (asymmetry of the probability distribution),"
    }, {
      "page": 4,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 5"
    }, {
      "page": 5,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7409362792969,
        "y1": 251.41522216796875,
        "y2": 712.22802734375
      },
      "text": "kurtosis (“tailedness” of the probability distribution) and normality might play a role. We expected to see differences between B1 and B2 conditions. Errors in B1 condition would have larger variances and the same data-inherent effects would appear as in study 1. Errors in B2 condition would have smaller variances and only little data-inherent effects would be observed considering the additional visual assistance from bars being sorted along the x-axis. Fig. 4 illustrates our anticipated effect of true target bar rank. We represent it as a curvilinear relationship between errors and true target bar ranks. We hypothesized that viewers would anchor and adjust their answers on median bars (ranked at 50) and the two extrema (ranked at 1 and 100). Means of error near these anchors would be close to zero, while for the ranks in-between we expected their perception to regress towards the anchors. The expected relationship in B2 was a horizontal line very close to x-axis, which means no effect. In terms of number of bars in a chart, we expected that with increasing number of data items, also the absolute error would increase in condition B1. This is illustrated with different colors in Fig. 4. In terms of regression analysis, we expected to see a contribution to the model’s goodness of fit (increased adjusted R2, and a smaller AIC value) from target bar rank and number of data items when adding each of them as variables into the model. An increase in R2 indicates that the model better explains the variance in the data. AIC deals with the tradeoff between model’s goodness of fit and complexity (number of predictors), with a lower AIC indicating a superior model. Setup: We conducted a new study to have every single bar component in 6 out of 15 datasets (randomly chosen) being assessed under both B1 and B2 conditions. For practical reasons we split the study into two blocks completed by two groups of participants (Block 1: charts were chosen to be N = 13, 18, 32; Block 2: N = 10, 20, 31). After the same 9 training tasks in pilot study 1, there were 126 tasks for each participant in Block 1 and 122 tasks for Block 2. The presentation order of main study tasks within each block was"
    }, {
      "page": 5,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8953857421875,
        "y1": 96.09918975830078,
        "y2": 473.2250061035156
      },
      "text": "randomized. Each block averaged 10 minutes. 200 MTurk workers were randomly assigned to one block. According to factorial analysis, the total number of permuted orders in B1 condition for a 10-bar chart is more than 106. To increase randomness, bar orders in B1 condition were randomized when the charts got rendered in the front end. Ideally, with 100 participants in each block, we could average between 100 random orders. For the sorted condition (B2), the order was always the same. Result:To remove speeders (workers who rushed through the study with low data quality), we used 1.5 × IQR rule to detect outliers in B2 sorted baselines. There remained 95 and 89 participants for Block 1 and Block 2 respectively. In total we kept 22,828 samples for data analysis. Comparing between errors, we observe smaller variances in B2 (mean = −1.62, SD = 11.40,CI [−1.79,−1.46]) than in B1 (mean = −2.13, SD = 19.34,CI [−2.30,−1.97]). Large variances in B1 are plausible as we let participants judge different charts for the same condition and there can be large individual differences between participants in empirical studies. We first tested the hypothesized curve by modeling relationship between error and target bar rank. We applied the 1.5 × IQR rule in each B1 condition to remove outliers. 10,863 out of 11,414 samples remained. We applied two regression models: a polynomial regression model and Locally Weighted Regression (LOESS) [27]. For the polynomial regression model, we chose a cubic fitting function as the simplest function capable of modeling our hypothesized relationship. By contrast, LOESS is a non-parametric regression method that automatically finds the curve that best describes the relationship between independent and dependent variables without the need to specify the fitting function."
    }, {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980712890625,
        "y1": 478.6651916503906,
        "y2": 688.41796875
      },
      "text": "To derive prediction models, we averaged all the repeated measurements for the same condition (124 conditions) instead of using the 10,863 original samples. While models derived from different #regression samples have different R2, their coefficients and the ANOVA test results are identical. Thus, we reported the model derived from 124 averaged samples as it introduces less uncertainty in the prediction. After applying stepwise model selection, we derive a cubic model with the lowest AIC (denoted as Model 1). Fig. 5 illustrates the fitting line and prediction intervals (i.e., 95% CI and 95% PI) of Model 1, fitting results from LOESS and regression samples. LOESS results (Residual Standard Error is 11.07) are consistent with the hypothesized curvilinear relationship between error and target bar rank. The results from the cubic model and LOESS are identical. All predictors in Model 1 are significant, revealing their associations with the dependent variable. The curvilinear relationship can be expressed as:"
    }, {
      "page": 5,
      "region": {
        "x1": 324.3429870605469,
        "x2": 558.2017822265625,
        "y1": 700.5904541015625,
        "y2": 709.7639770507812
      },
      "text": "Error = 6.79 − 0.00735 × Rank2 + 0.0000640 × Rank3 (3)"
    }, {
      "page": 5,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 6"
    }, {
      "page": 6,
      "region": {
        "x1": 53.569000244140625,
        "x2": 301.80645751953125,
        "y1": 322.1953125,
        "y2": 377.1000061035156
      },
      "text": "However, thismodel does not yield a goodmodel fit, F (2, 121) = 11.51,p = 2.66e-5, with adjusted R2 to be 0.14 and AIC to be 957.74. Even though the curvilinear relationship we see in Fig. 5 follows our hypothesis, only using rank to account for estimation errors is insufficient."
    }, {
      "page": 6,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7378234863281,
        "y1": 382.5391845703125,
        "y2": 711.844970703125
      },
      "text": "To investigate the potential influence of other data characteristics, we plotted error means and CIs for each target bar (keep all the raw samples to avoid biases in CIs) as shown in Fig. 6. The pattern varies across datasets. For charts N = 13 and 32, there is the curvilinear relationship that we hypothesized. In the other charts, however, we only see large slopes or other curvilinear relations. In the two charts N = 13 and 32, x-intercepts are very close to 50, but the other four charts do not show similar patterns. We cannot confirm the hypothesis about the effects from number of data items with these graphical presentations in that the plots differ vastly. We further hypothesized that besides target bar rank and number of data items, other data characteristics might also influence the accuracy of rank estimation tasks. We thus added Coefficient of Variation (CV), skewness, kurtosis and the p-value in Shapiro-Wilk test [34] (a preferred method to test whether the dataset is drawn from normal distribution [43]) of each dataset to the model to see whether these additions can further explain the errors we see. After stepwise model selection, we derive a new multiple cubic regression model denoted as Model 2. As shown in Tab. 2, p-values for each predictor in Model 2 are statistically significant, meaning that changes in true target bar ranks, number of data items, skewness, kurtosis and the interaction between target bar rank and number of data items are related to the changes in the estimation error. Model 2 yielded a good model fit on the same 124 samples, F (6, 117) = 48.62,p < 2.2e-16, with adjusted R2 to be 0.70 and AIC to be 832.22."
    }, {
      "page": 6,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.890625,
        "y1": 514.3721923828125,
        "y2": 640.4400024414062
      },
      "text": "Comparing between the two models, we find that Model 2 is superior to Model 1. Adjusted R2 increases from Model 1 to Model 2 (Adj .R2Fit1 = 0.14,Adj .R2Fit2 = 0.70) while AIC drops (AICFit1 = 957.74,AICFit2 = 832.22), which validates that number of data items, skewness, kurtosis and the interaction between rank and number of data items are explaining a large and unique proportion of variances that target bar rank related terms cannot. Adding rank related terms as the last additions results in an increase in adjusted R2 (from 0.61 to 0.70) and a decrease in the AIC score (from 862.08 to 832.22), which shows the contribution from true target rank."
    }, {
      "page": 6,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.3048706054688,
        "y1": 645.8792114257812,
        "y2": 712.1710205078125
      },
      "text": "In Fig. 7, we plot the predictions of Model 2 together with the data we trained it with. As reported in Tab. 2, there is a negative correlation between error and number of data items, which means a larger number of bars in the chart will bring more underestimation in rank. However, in Fig. 7, the chart of 20 data items seems to be an outlier as it does lie on top, not"
    }, {
      "page": 6,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 7"
    }, {
      "page": 7,
      "region": {
        "x1": 53.31999969482422,
        "x2": 295.59283447265625,
        "y1": 322.7891845703125,
        "y2": 424.9469909667969
      },
      "text": "following this negative relationship.When looking into more details, we find that this is related to the predictor skewness. Skewness has a large negative coefficient -23.86 and the chart N = 20 has the smallest skewness score -0.62 (mean = 0.17, SD = 0.60) among all the datasets. Thus, we see the largest amount of overestimation in this chart, which further indicates the large influence from other data characteristics. We will leave a full and systematic characterization of the influence from such data-inherent factors to future work."
    }, {
      "page": 7,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.74102783203125,
        "y1": 430.3861999511719,
        "y2": 652.094970703125
      },
      "text": "In addition, Model 2 satisfies the assumptions on both the curvilinear relationship between predictors and dependent variables and the independence of predictors. Stepwisemodel selection helps us guard against multicollinearity. Model 2 also satisfies other Ordinal Least Square (OLS) assumptions with residuals (i.e., vertical distances between observed values and fitted values) randomly scattered around zero, which means there is no heteroscedasticity. We performed out-ofsample testing onModel 2 with the same 6 datasets from pilot study 1 and adjusted R2 is 0.81. In out-of-sample testing with the 9 datasets not leveraged for deriving Model 2, adjusted R2 averages 0.87 (SD = 0.16). We also test against overfitting. Observations per term in Model 2 are 20.67, which is sufficient (rule of thumb: 10-15 observations per term) in multiple linear regressions (including polynomial terms and interactions). The predicted R2 for Model 2 is 0.68, indicating only 2% (70% - 68%) of variances is explained by too many factors or random correlations. As predicted R2 is close to adjusted R2, we know that our model is not severely overfitting."
    }, {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5885925292969,
        "y1": 657.5341796875,
        "y2": 711.8709716796875
      },
      "text": "For B2 sorted baseline, we applied the same fitting function as that for Model 2 (see predictions in Fig. 8). Adjusted R2 for B2 equals 0.48 with only the interaction between target bar rank and number of data items to be non-significant. Compared with B1, there is less data-inherent effects in B2."
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.3969116210938,
        "y1": 321.9252014160156,
        "y2": 376.2619934082031
      },
      "text": "We conclude that there are different data-inherent factors that influence rank estimation tasks. We can build a rough model based on our data as a means to filter out noise in our investigations of neighborhood effects. Yet, further work is needed to clearly investigate these data-inherent effects."
    }, {
      "page": 7,
      "region": {
        "x1": 317.5870056152344,
        "x2": 559.8944702148438,
        "y1": 391.63885498046875,
        "y2": 711.8880004882812
      },
      "text": "Study 3 After accounting for data-inherent effects, we conducted a new study to validate the effect from neighborhoods. Hypothesis:We hypothesized that neighborhood effects still exist after offsetting the influence from data-inherent effects. We hoped to explain the difference between two neighborhood conditions by a new linear predictor: neighborhood rank (100 for the highest vs. 1 for the lowest) and anticipated its coefficient to be negative. Setup: Similar to pilot study 1, we generated two neighborhood conditions (i.e., the highest and the lowest) on randomly ordered bar charts. Target bar ranks were chosen to be 30, 40, 50, 60, 70, 80 in the 6 datasets we used in study 2. In total, there were 9 training tasks, 72 main study tasks, and five quality control tasks in the study. Task order was randomized. We increased the number of target bar ranks to 6 for eliminating potential learning effects. 283 MTurk workers were recruited and the study lasted about 5 minutes. Results: 200 participants remained in the sample after data cleaning. The results we saw in study 3were very similar to study 1. Plotting aggregated mean errors and CIs from a total of 14,400 samples, there is no overlap between the highest and the lowest neighborhood conditions (see Fig. 9). Neighborhood effects show up at five out of six target bar rank levels. There is a substantial overlap between CIs of the two neighborhoods at target bar rank = 60. Looking into more details, we see neighborhood effects in 13 targets (in"
    }, {
      "page": 7,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 8"
    }, {
      "page": 8,
      "region": {
        "x1": 52.1150016784668,
        "x2": 295.7415771484375,
        "y1": 246.25921630859375,
        "y2": 712.2529907226562
      },
      "text": "total 36) from 5 datasets while other two targets showed a reversed pattern corresponding to length assimilation in PLI. Next, we performed regression analysis over the 14,400 collected samples. First, we only use the linear predictor neighborhood rank to explain residuals. Results show that this predictor is significant (coefficient is estimated to be -1.34e-2, p = 3.15e-6) but it only accounts for a small percentage of all the variances in error (Adj .R2 = 1.44e-3). Further exploration shows that the target bar rank and other factors related to datasets are also associated with changes in residuals. Then we extended Model 2 by adding neighborhood rank as a new linear predictor to directly account for variances of error in study 3. After stepwise model selection, we derived Model 3 (F (7, 14392) = 1208,p < 2.2e-16,AIC = 121329.8,Adj .R2 = 0.37). As shown in Tab. 3, all predictors are significant, meaning that they are likely to be meaningful addition to the model. The coefficient of neighborhood rank is negative as hypothesized. A target bar being judged as at rank e.g., 60 in its highest neighborhood will be judged as at 61.32 in its lowest neighborhood. Adding neighborhood rank as the last predictor improves model fit (AIC drops by 24.8 and Adj.R2 increases by 0.001)1. Based on Model 3, we also sorted predictors according to their effect sizes using Cohen’s f2 (Large effect: 0.35; Medium: 0.15; Small: 0.02 [33]): skewness (0.42) > target bar rank3 (0.12) > N (0.021) > target bar rank2 (0.015) > kurtosis (0.010) > neighborhood rank (0.002). Unit increase (value +1.00) in skewness brings -25.00 in rank; unit increase in number of data items results in -0.57 while unit increase in kurtosis brings +7.69 in rank. This shows how each data characteristics influences the estimation error. The power analyses we conducted for each predictor in Model 2 and Model 3 revealed that all the power values exceeded 0.99. This means that the sample sizes are adequate to catch effect sizes for all predictors. Note that although Model 3 only explains 37% of all the variances, there is still a reliable relationship between the significant predictors and the dependent variable. Large interindividual differences and higher level cognitive tasks [5] 1We only compared models trained with the same regression samples."
    }, {
      "page": 8,
      "region": {
        "x1": 317.70599365234375,
        "x2": 559.89111328125,
        "y1": 489.7272033691406,
        "y2": 556.0189819335938
      },
      "text": "can be the underlying reasons for such unexplainable highvariability. Predicted R2 for Model 3 equals 0.3695, which is close to the adjusted R2, meaning that Model 3 is not overfitting. Both the predictions from Model 3 (see Fig. 10) and Cohen’s f2 suggest that compared to the data-inherent effects, the impact from neighborhoods is rather small."
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8946533203125,
        "y1": 561.4581909179688,
        "y2": 591.885009765625
      },
      "text": "With all these analyses, we conclude that neighborhood effects exist but their effect size is small on the rank estimation tasks."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 396.20440673828125,
        "y1": 627.2538452148438,
        "y2": 633.6799926757812
      },
      "text": "4 EXPERIMENT"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.8980712890625,
        "y1": 621.8291625976562,
        "y2": 712.031005859375
      },
      "text": "In this section, we discuss design implications from our results, limitations, and future work. Design implications: Random (alphabetical order as one typical case), and sorted orders are the two most commonly used approaches in bar charts. In study 2, we hypothesized that we would see a perceptual effect of data-inherent factors in random orders while see very little of this effect in sorted orders. This hypothesis is partially confirmed. We also"
    }, {
      "page": 8,
      "region": {
        "x1": 54.0,
        "x2": 558.0009765625,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 9"
    }, {
      "page": 9,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.7410583496094,
        "y1": 96.09918975830078,
        "y2": 210.21197509765625
      },
      "text": "see some data-inherent effects in sorted orders although the effect size (Adj .R2 = 0.48) is smaller than that in random orders (Adj .R2 = 0.70). Nevertheless, the sorted order is still the more accurate approach to convey rank-related information as the mean of all estimation errors is closer to zero with smaller variances. Besides, results suggest that—despite their existence—designers do not need to worry too much about neighborhood effects. Our findings show that a local neighborhood manipulation does not substantially influence the perceptual rank estimation tasks in bar charts."
    }, {
      "page": 9,
      "region": {
        "x1": 53.43000030517578,
        "x2": 295.1415100097656,
        "y1": 215.65118408203125,
        "y2": 544.9559936523438
      },
      "text": "To the best of our knowledge, no one else has investigated perceptions on rank estimation tasks so far. A surprising result was the large amount of biases that is introduced by data-inherent effects. Following Cleveland & McGill [5], we calculate the accuracy defined on estimation errors for our task, Accuracy = loд2(|estimated value − true value | + .125). The accuracy can exceed 4.0 (marked as a large log absolute error [5]) when the estimation error goes beyond 20 in rank. This means the accuracy can be rather low in our task. Considering the comparatively large effect size of data-inherent factors such as skewness, we encourage designers to provide additional clues if they would like to convey rank-related information precisely. Limitation:We understand neighborhood effects as an interplay between all bars instead of the influence only from neighboring bars. Although we hypothesized to see length contrast effect in our study (based on previous work [18, 29]), there is no reason to rule out length assimilation effect under other experimental settings. Confounding factors could come from the ‘shape’ in the baseline charts (e.g., influence from Gestalt symmetry and continuity laws [31, 41]) and target bar positions in the chart. In three out of five assimilation cases (from 5 different datasets where length contrast effect also showed up), we found that the top highest bar was just positioned at/very close to the border of the lowest neighborhood (study 1 screenshots #96 and #123, study 3 screenshot #58 in auxiliary material), which could be the confounding factor reversing the effect."
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.7410583496094,
        "y1": 550.3961791992188,
        "y2": 700.3740234375
      },
      "text": "Following previous work in quantifying perceptual biases in visualizations [40], we used multiple regression to quantify both the data-inherent and neighborhood effects. We simplify the models by neglecting potential interactions between predictors. From further analysis we found that these complex but currently excluded interactions (e.g., the interaction between target bar rank and skewness) also contributed to model fit and helped in explaining varying patterns between datasets (Fig. 6), which demonstrates the challenge and importance of using real datasets. Also, the relationship between estimation errors and target bar ranks is simplified by using a cubic fitting function and the inter-individual differences [3] are not taken into account in current models."
    }, {
      "page": 9,
      "region": {
        "x1": 317.6059875488281,
        "x2": 559.8978271484375,
        "y1": 96.09918975830078,
        "y2": 544.9559936523438
      },
      "text": "One of the differences from our work to others on bar chart perceptions is the one-second time limit for presenting charts. Cleveland & McGill pointed out that a substantial danger in graphical perceptual research is to perform judgments differently from the way people adopt in real life [5]. A possible solution is to have participants judge much more quickly than they do in real life in order to prevent them from performing higher level cognitive tasks other than basic graphical perceptual tasks. This time limit in our work helped in preventing precise counting on the bars, but it might also result in other confounds such as random judgements. Another difference is that we used several real datasets instead of simple, highly-controlled stimuli. Our goal in doing so was to bring this line of research closer to applied visualization design. As a consequence, however, our results also did not lead to a simple, clear-cut picture. We found that patterns varied between datasets, and even observed patterns contrary to our hypothesized effects. Moreover, one could argue that the observed neighborhood effects may only be exclusive to the six datasets in our study. Although including more datasets could decrease the consistency and accuracy of a study, we still believe our current results provide some actionable insights into the question of how to account for neighboring effects when designing bar chart visualizations. Future work: One direction of future work is to expand this work by including more datasets. As our study started from an exploratory end with no benchmark, we also suggest exploring other parameters, e.g., chart exposure time, neighborhood size, neighboring bar ranks, and measurements (e.g., sliders in our study). Although we found evidence of different rank estimation effects, we haven’t figured out any counter-acting methods yet. Find counter-acting methods might become even more complicated due to constraints from real world requirements such as efficiency (e.g., to find every target item quickly) and saliency (e.g., to notice a distinct target item quickly). We regard our work as a first step and hope it can inspire more work on investigating solutions for counter-acting perceptual biases."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 393.0062255859375,
        "y1": 606.974853515625,
        "y2": 613.4010009765625
      },
      "text": "5 DISCUSSION"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.8910522460938,
        "y1": 574.3062133789062,
        "y2": 664.5079956054688
      },
      "text": "We studied the perception of ordering in bar charts on rank estimation tasks. Our results showed that neighborhood effects can be observed yet their effect size is small. Accuracy on these rank estimation tasks is dominated by other effects stemming from the choice of target bars and certain dataset characteristics. We regard our work as a further piece to better understand the perception of the widely-used bar chart encoding."
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 399.6416320800781,
        "y1": 559.4518432617188,
        "y2": 565.8779907226562
      },
      "text": "6 CONCLUSION"
    }
  }, {
    "paragraphs": [{
      "page": 9,
      "region": {
        "x1": 317.47698974609375,
        "x2": 559.740966796875,
        "y1": 693.8582153320312,
        "y2": 712.3289794921875
      },
      "text": "We thank all study participants and anonymous reviewers. This work is partly funded by RGC GRF grant 16213317."
    }, {
      "page": 9,
      "region": {
        "x1": 54.0,
        "x2": 558.001953125,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 10"
    }],
    "title": {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 441.30694580078125,
        "y1": 679.0038452148438,
        "y2": 685.4299926757812
      },
      "text": "7 ACKNOWLEDGEMENT"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 57.50400161743164,
        "x2": 295.3881530761719,
        "y1": 110.3546371459961,
        "y2": 115.5670166015625
      },
      "text": "[1] Hirotugu Akaike. 1974. A new look at the statistical model identifica-"
    }, {
      "page": 10,
      "region": {
        "x1": 57.503997802734375,
        "x2": 295.3914794921875,
        "y1": 120.31661224365234,
        "y2": 135.49200439453125
      },
      "text": "tion. IEEE transactions on automatic control 19, 6 (1974), 716–723. [2] Thom Baguley. 2012. Calculating and graphing within-subject confi-"
    }, {
      "page": 10,
      "region": {
        "x1": 53.797996520996094,
        "x2": 295.3916320800781,
        "y1": 140.2426300048828,
        "y2": 711.4439697265625
      },
      "text": "dence intervals for ANOVA. Behavior research methods 44, 1 (2012), 158–175. [3] Daniel J Bauer. 2011. Evaluating individual differences in psychological processes. Current Directions in Psychological Science 20, 2 (2011), 115– 118. [4] Richard W Brislin. 1974. The Ponzo illusion: Additional cues, age, orientation, and culture. Journal of Cross-cultural Psychology 5, 2 (1974), 139–161. [5] William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387 (1984), 531–554. [6] Denis Cousineau. 2017. Varieties of Confidence Intervals. Advances in cognitive psychology 13, 2 (2017), 140. [7] Frederick E Croxton and Harold Stein. 1932. Graphic comparisons by bars, squares, circles, and cubes. J. Amer. Statist. Assoc. 27, 177 (1932), 54–60. [8] Geoff Cumming. 2014. The new statistics: Why and how. Psychological science 25, 1 (2014), 7–29. [9] Clarence E Davis. 2007. Regression to the mean. Wiley Encyclopedia of Clinical Trials (2007), 1–2. [10] Nicholas Epley and Thomas Gilovich. 2006. The anchoring-andadjustment heuristic: Why the adjustments are insufficient. Psychological science 17, 4 (2006), 311–318. [11] Volker H Franz, Manfred Fahle, Karl R Gegenfurtner, and Heinrich H Bülthoff. 2000. Effects of visual illusions on grasping: The ParallelLines Illusion. Perception 48 (2000), 50. [12] Patricia P Gilmartin. 1981. Influences of map context on circle perception. Annals of the Association of American Geographers 71, 2 (1981), 253–258. [13] JM Hampton, PG Moore, and Howard Thomas. 1973. Subjective probability and its measurement. Journal of the Royal Statistical Society. Series A (General) (1973), 21–42. [14] Lane Harrison, Drew Skau, Steven Franconeri, Aidong Lu, and Remco Chang. 2013. Influencing visual judgment through affective priming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2949–2958. [15] MJR Healy and H Goldstein. 1978. Regression to the mean. Annals of Human Biology 5, 3 (1978), 277–280. [16] Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 203–212. [17] Jessica Hullman, Eytan Adar, and Priti Shah. 2011. The impact of social information on visual judgments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1461–1470. [18] Kevin Jordan and Peter W English. 1989. Simultaneous sampling and length contrast. Perception & Psychophysics 46, 6 (1989), 546–554. [19] Kevin Jordan and Diane J Schiano. 1986. Serial processing and the parallel-lines illusion: Length contrast through relative spatial separation of contours. Perception & Psychophysics 40, 6 (1986), 384–390. [20] Kevin Jordan and John Uhlarik. 1985. Assimilation and contrast of perceived length depend on temporal factors. Perception & psychophysics 37, 5 (1985), 447–454. [21] Charles H Judd. 1905. The Muller-Lyer illusion. The Psychological Review: Monograph Supplements (1905). [22] Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging framing"
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.5473022460938,
        "y1": 97.4026107788086,
        "y2": 710.3359985351562
      },
      "text": "effects to enhance personal productivity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 272–283. [23] Alexander Klippel, Frank Hardisty, and Chris Weaver. 2009. Star plots: How shape characteristics influence classification tasks. Cartography and Geographic Information Science 36, 2 (2009), 149–163. [24] Yi-Na Li, Kang Zhang, and Dong-Jin Li. 2017. How dimensional and semantic attributes of visual sign influence relative value estimation. ACM Transactions on Applied Perception (TAP) 14, 3 (2017), 18. [25] Michael EJ Masson and Geoffrey R Loftus. 2003. Using confidence intervals for graphically based data interpretation. Canadian Journal of Experimental Psychology/Revue canadienne de psychologie expérimentale 57, 3 (2003), 203. [26] Justin Matejka, Michael Glueck, Tovi Grossman, and George Fitzmaurice. 2016. The effect of visual appearance on the performance of continuous sliders and visual analogue scales. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5421–5432. [27] Douglas C Montgomery, Elizabeth A Peck, and G Geoffrey Vining. 2012. Introduction to linear regression analysis. Vol. 821. John Wiley & Sons. [28] Nytimes.Com. 2018. The New York Times - Breaking News, World News & Multimedia. Retrieved June 15, 2018 from https://www. nytimes.com [29] David Peebles. 2004. Distortions of perceptual judgment in diagrammatic representations. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 26. [30] Alexander W Pressey and Nancy E Smith. 1986. The effects of location, orientation, and cumulation of boxes in the Baldwin illusion. Perception & Psychophysics 40, 5 (1986), 344–350. [31] Irvin Rock and Stephen Palmer. 1990. The legacy of Gestalt psychology. Scientific American 263, 6 (1990), 84–91. [32] Bahador Saket, Alex Endert, and Cagatay Demiralp. 2018. Task-Based Effectiveness of Basic Visualizations. IEEE Transactions on Visualization and Computer Graphics (2018). [33] Arielle S Selya, Jennifer S Rose, Lisa C Dierker, Donald Hedeker, and Robin J Mermelstein. 2012. A practical guide to calculating Cohen’s f2, a measure of local effect size, from PROC MIXED. Frontiers in psychology 3 (2012), 111. [34] Samuel Sanford Shapiro and Martin B Wilk. 1965. An analysis of variance test for normality (complete samples). Biometrika 52, 3/4 (1965), 591–611. [35] David Simkin and Reid Hastie. 1987. An information-processing analysis of graph perception. J. Amer. Statist. Assoc. 82, 398 (1987), 454–465. [36] Statista.Com. 2018. Statista - The portal for statistics. Retrieved Jun 15, 2018 from https://www.statista.com [37] Maureen Stone and Lyn Bartram. 2008. Alpha, contrast and the perception of visual metadata. In Color and Imaging Conference, Vol. 2008. Society for Imaging Science and Technology, 355–359. [38] Marc Streit and Nils Gehlenborg. 2014. Bar charts and box plots. Nature Methods 11, 2 (2014), 117–117. https://doi.org/10.1038/nmeth.2807 [39] Justin Talbot, Vidya Setlur, and Anushka Anand. 2014. Four experiments on the perception of bar charts. IEEE transactions on visualization and computer graphics 20, 12 (2014), 2152–2160. [40] Andre Calero Valdez, Martina Ziefle, and Michael Sedlmair. 2018. Priming and anchoring effects in visualization. IEEE transactions on visualization and computer graphics 24, 1 (2018), 584–594. [41] Colin Ware. 2012. Information visualization: perception for design. Elsevier. [42] Daniel J Weintraub. 1979. Ebbinghaus illusion: context, contour, and age influence the judged size of a circle amidst circles. Journal of Experimental Psychology: Human Perception and Performance 5, 2 (1979), 353."
    }, {
      "page": 10,
      "region": {
        "x1": 54.0,
        "x2": 558.001953125,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 11"
    }, {
      "page": 11,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04229736328125,
        "y1": 97.4026107788086,
        "y2": 122.53997802734375
      },
      "text": "[43] BeeWah Yap and ChiawHock Sim. 2011. Comparisons of various types of normality tests. Journal of Statistical Computation and Simulation 81, 12 (2011), 2141–2155."
    }, {
      "page": 11,
      "region": {
        "x1": 317.95501708984375,
        "x2": 559.4228515625,
        "y1": 97.4026107788086,
        "y2": 122.53997802734375
      },
      "text": "[44] Jeff Zacks, Ellen Levy, Barbara Tversky, and Diane J Schiano. 1998. Reading bar graphs: Effects of extraneous depth cues and graphical context. Journal of experimental psychology: Applied 4, 2 (1998), 119."
    }, {
      "page": 11,
      "region": {
        "x1": 54.0,
        "x2": 558.0020141601562,
        "y1": 750.914794921875,
        "y2": 756.7197875976562
      },
      "text": "Paper 232 Page 12"
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 53.79800033569336,
        "x2": 116.56490325927734,
        "y1": 96.18885803222656,
        "y2": 102.614990234375
      },
      "text": "REFERENCES"
    }
  }]
}