{"authors": "Sharifa Sultana; Shaid Hasan; Prianka Roy; M Ashraful Amin; Mitrasree Deb; S M Raihanul; Samira Fairuz; A K M Najmul Islam; Ananya Bhattacharjee; Trishna Chakraborty; Aparna Moitra; Ishtiaque Syed;  Ahmed; S M Raihanul Alam; Samira Fairuz Ahmed; Ashraful Amin; A K M Najmul Islam; Syed Ishtiaque", "pub_date": "", "title": "'Unmochon': A Tool to Combat Online Sexual Harassment over Facebook Messenger", "abstract": "Women in the global south often seek justice to their online harassment through unveiling the harassers and the screenshots of their sent harassment texts and visual contents before the relevant authorities. Nevertheless, such evidence is often challenged for their authenticity. Our survey (n=91) and interview (n=43) with Bangladeshi online gender harassment victims revealed the depth of the problem, and we set design goals to collect evidence from Facebook Messenger with ensured authenticity. Building on the 'shame-based model' of gender justice [12], we designed 'Unmochon', a tool that captures authentic evidence and shares with victims' intended group. Our user-study (n=48) revealed that diminishing authenticity problem may still leave the victim and online gender justice entangled with mob-sentiment, hegemonic legal consciousness, and several privacy aspects. Our fndings open up a new discussion on how HCI-design should address online gender justice in such a complex social setting.• Human-centered computing → Web-based interaction; Social networking sites.", "sections": [{"heading": "INTRODUCTION", "text": "Women's harassment is one of the age-old problems in the history of humankind. Many international reports explain how prevalent this problem is from the enlightened western world to the low-resourced Global South. For example, the United Nation Women reported that Up to 70% of women across the world face physical and/or sexual violence in their lifetime [8] and National Intimate Partner and Sexual Violence Survey (NIPSV) reported in 2018 that about 1 out of every 5 women (21.3%) in the United States experienced at least one attempted or completed rape [94]. The picture in the Global South is also equally disturbing, if not worse, as 66% of women reported experiencing sexual harassment between two and fve times in Delhi, India [8].\nToday, with the widespread advancement of information technology, this problem has taken over the cyber-spaces. Thus, online gender harassment is a widely discussed agenda across the world. Prior studies have shown that female social accounts experience a significantly larger number of harassment incidents than male accounts [9,20,28,73] and thus, these studies have concluded that women are more vulnerable to online gender harassment. The situation is more difcult in patriarchal societies like Bangladesh, as reports show that more than 70% percent of the complaints fled at the government's Information and Communication Technology Division's Cyber Help Desk in 2017 was about women's online harassment [54]. Such harassment incidents often stress the victims and their families out and lead to other efects like exclusion, humiliation, and public resentment, especially when they live in conservative and patriarchal societies [58]. However, harassers often remain beyond the scope of law-enforcement as Mishuk Chakma, Additional Deputy Commissioner of the Cyber Security and Crime Division of Dhaka Metropolitan Police (DMP), commented, \"However, most (female) victims of online harassment do not go to the police station\" [25].\nThe very tiny portion of the female victims of online gender harassment who breaks the silence and seeks help often prefers to expose the harassers on social media with screenshots of their chats as supporting evidence and seek justice [51,56]. Nevertheless, in most cases, the reports and the press releases by concerned authorities show that the many of the victims' attempts to seek help and justice go in vain with the argument that the advancement of technology now allows manipulation of screenshots. Thus, ofenders often receive the beneft of doubts and go away [51,56]. However, the insights on the level of extremeness of online harassment which push the female victims to take such steps and what still blocks them from seeking out help are still rare in HCI literature.\nWe address this gap in the literature through a two-phase study. In the frst phase, we conducted a survey with 91 female Facebook users to understand online gender harassment, and further interviewed another 43 Facebook users for a deeper understanding of their usual strategies to combat such harassment. Previous research on sexual harassment in Bangladesh, India, and Pakistan [2-5, 59, 76, 80, 100, 114]; the researchers' lived experience; and similar studies in other places in the world motivated us to seek answers to the following research questions in this phase: RQ1: When and why do Bangladeshi women prefer exposing their online harassers, and what factors are signifcant while choosing possible online spaces for such actions? RQ2: How do the existing tools, platform policies, and online environment often fail to assist them in this regard? RQ3: How do they address the problems when their supporting evidence is challenged for authenticity? How can we design better tools and technologies to support online gender justice in this regard? Our fndings from this frst phase show that their complaints about harassment and supporting evidence are often challenged for authenticity. Building on these, the second phase of the study aimed at designing a tool that supports the women who seek help and justice to their online harassment. We build on the shame-based model of justice in this adversarial design [12,27]. In this regard, we prototyped an application for women to help them seek justice to their online harassment. This paper introduces 'Unmochon', an application that helps with authentication issues associated with the screenshots of the chat history with the harasser that women often share while seeking help and justice. In the second phase of the study, we evaluated this application with 48 participants using either interviews and focus group discussions, depending on their availability and ease in the mode of participation. We introduced this application to the participants, discussed the possible benefts this application would bring for them while fghting gender harassment on Facebook Messenger, and asked them what kind of challenges and troubles this application might generate for the users and other stakeholders. We found that women often prefer hiding their identity as a victim, fearing that this might bring them further victim-blaming and slut-shaming and might even engender real-life security threats. Findings from the users' feedback pointed out that an end to the authenticity problem might still leave the victim and online gender justice challenged by mob-sentiment, hegemonic legal consciousness, and many other privacy concerns. The participants also shared their worries that any misuse of such technologies could lead to a counter-harassment for the accused party and urged to include such concerns in the set of agendas while designing feminist technologies.\nOur work makes a four-fold contribution to feminist-human computer interaction (feminist-HCI), social media studies, and information and communication technologies and development (ICTD). First, our fndings show that many of the Bangladeshi female Facebook users seek mob justice and expose their harassers by posting photos of their conversation online as evidence, while this evidence is often challenged for authenticity. Second, drawing on our fndings, we build a set of design assumptions that are practical and appropriate for assisting such victims in seeking justice. Here, we bring the model of shame-based justice to design [12]. Third, in this regard, we prototype and evaluate Unmochon and report the perception of victims and other stakeholders of such tools that support online gender justice. Finally, we report the fndings from our discussions with the participants and other stakeholders that unfold diferent complicated issues entangled with cyber-harassment and social justice and suggest feminist-HCI and ICTD possible design directions for safer online experience for women in the Global South.", "n_publication_ref": 18, "n_figure_ref": 0}, {"heading": "RELATED WORK", "text": "In building our research question and making arguments based on our fndings, we draw on the literature of three broader themes: technologies supporting women's safety, online movements for gender justice, and literature of justice and gender harassment in Bangladesh. In this section, we briefy discuss some of the existing works built on these themes and situate our research question in this regard.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Online Harassment, Gender, and Related Technologies", "text": "Online harassment is a widely discussed agenda in HCI, social media research, and gender studies. Researchers in these domains have studied diferent forms of online harassment including cyberbullying [7], cyber-stalking [66,67], email-harassment [68], harassment on messenger [31], and in online gaming [63]. A body of work has showed that online harassment not only stresses the users out but also may cause economic damage to the platform when users choose to leave it or limit their activities [33,66,103].\nEven though most fo the online platforms and social media ofer the users help to handle such cases, users often fnd those processes slow, inconsistent, and dismissive [42,105,106].\nResearchers working in the intersection of social media, web security, and HCI design have been engaging in developing machine learning models to detect harassment for years [12,19,37,61,83,111]. Some of these models have also integrated human to intervene for further efectiveness of the tools [12,19,37,83,111]. However, many of these models were often reported to be trained with a biased mechanism and resulted in higher odds of deception and misclassifcation [11,48]. Along with all of the above-mentioned concerns and limitations, the existing state-of-the-art tools and mechanisms for fghting online harassment often fail to address culturally contextual gendered needs in such cases of harassment, including users' vulnerability due to their gender identity and a balance between their needs and expectation and their power and agency on social media [12,33,91,96,103].\nA group of researchers has recently shown that users' perception of online safety is subjective and dependent on their digital privacy and security and the values upheld by their community [85,88]. Some researchers also engaged in understanding the forms of harassment, its gendered angles, sealioning, and other relevant abuse on social media and called for designing more options in the platforms than blocking harassers and deactivating own IDs in this regard [12,13,88,103]. Jhaver et al. studied Twitter users' blocklists and reported that users might not feel entirely protected by blocking the harassers, while the blocked users often felt that they were unfairly treated [55]. However, the design, features, and afordances of social media, including Facebook, vary across regions (see Facebook lite and messenger lite for the Global South [89]). Thus, users' social media behavior is also diverse and culture-specifc [71,113], which may infuence their ways of handling online harassment.\nHowever, addressing gender harassment using technology is more challenging in low-resourced countries in the Global South because many of the users live in strictly patriarchal societies and raising voice against men is often challenging and usually discouraged through victim-blaming and slut-shaming [3,60,98,99]. Still, a body of work addressed gender harassment in the physical space through design, including Protibadi, ProtibadiNext, Safestreet, and HearMe in Bangladesh [2][3][4][5], Harassmap in Egypt [115], Safe Mathare in Kenya [41], CrimeID in Indonesia [110], and Safetipin, Samrisa, and Panic-button in India [60,95,102]. However, only a few HCI4D works have addressed gender harassment on social media, messenger services, and cyberspaces in the context of the Global South [59,76,100,112,114]. Wyche reported how Kenyan women on cyber-spaces are more vulnerable to online harassment than men [112]. Kumar et al. reported how stalkers and strangers on Facebook demotivated Indian women's social media use [59]. Mustafa et al. reported how Pakistani women formed women-only Facebook groups as a safer and judgement-free space to discuss stigmatized topics [114]. Recently, Nova et al. 's work on understanding the pattern of sexual harassment on social media in Bangladesh [80] revealed how people close to women harass them anonymously using social media. However, none of these works involves any preventive design interventions to stop such online harassment or support the victims seeking gender justice.", "n_publication_ref": 63, "n_figure_ref": 0}, {"heading": "Online Gender Movements and Protests", "text": "Throughout history, online gender movements often sought solidarity while protesting an idea of injustice and invited others who shared similar sentiments to join. For example, two of the signifcant Muslim feminist online movements, #PinkHijabday, and #MuslimahPride took place in the US and Germany basing on ideological conficts [87,107]. Black feminist agendas hold a signifcant part of online movements when it comes to protesting against gendered and racial injustice. For example, #SayHerName started in 2015 to tell the story of violence against black women while circumventing traditional media barriers [109]. It started with the idea of making the sexual assaults and deaths of black transgender women noticeable and urging justice for them. Similarly, #JadaPose and #JusticeforLiz are widely known for seeking justice for black rape-victims [47,108]. These movements spoke for black women's historic racist oppression and pioneered many other online gender justice movements by marginalized communities.\nArguably the most prominent online movement broke the internet in October 2017, in which women across the world used the hashtag #MeToo (or some variants of it) and publicly shared their untold stories of being sexually harassed [92]. Founded in 2006 by Tarana Burke, a black woman activist from New York [16,17,92], these events followed Hollywood actress Alyssa Milano's call on Twitter: \"If all the women who have been sexually harassed or assaulted wrote 'Me too' as a status, we might give people a sense of the magnitude of the problem\" on October 15, 2017 [39]. This call for sharing harassment experiences with #MeToo hashtag followed Milano's own story of being sexually abused [74], and millions of women joined this movement. Some researchers see #MeToo as a descendent of #MyHarveyWeinstein, #YouOkSis, and #Sur-vivorPrivilege movements [44,76] and argue that it only gained prominence when several Hollywood female celebrities came out with their stories of sexual harassment [90].\nWhen #MeToo reached the Indian subcontinent, many women fooded Twitter and other social media platforms with the stories of their sexual harassment [45,65,76]. Cohering to the movement, Sarkar, a Dalit Queer, prepared a list of harassers in Indian Academia [35]. In this regard, Sarkar found that the victims did not provide any context while reporting their harassment incidents, and only a few academicians on the list were \"proved\" guilty [23,90]. Also, showbiz celebrities exposed their harassment stories declaring their solidarity [24,70]. While this movement successfully triggered the academia, industry, and showbiz, the harassment of many women from other professions and social status remained beyond its scope, as it happened in 2012 #SlutWalk movement in India [75]. Reports showed that #MeToo in Bangladesh was also less successful than expected because of cultural diferences, lack of hope, and a lacking reliance on alternatives [45,76]. However, not all the online movements stay unsuccessful in the Indian subcontinent. For example, protest against increased tax on female hygiene products [#LahukaLagaan, see [29]] is known to be one of the biggest womenled Twitter campaigns to demand policy change in India. This body of works provokes us to investigate which factors infuence such protests to be successful and how to integrate these factors while designing to support women's online gender justice.", "n_publication_ref": 26, "n_figure_ref": 0}, {"heading": "Model of Justice and Gender Harassment in Bangladesh", "text": "Finally, we turn to the literature of justice relevant to our context and research questions. Prior works on gender justice showed that many female victims of street harassment are reluctant to report to police and law enforcement authorities since those may not have been much helpful previously, and the investigations may lead to the next level of inconvenience and invite another harassment to themselves [52]. Also, reports show that women often feel that their reports to law-enforcement authorities may also bring them shame and blame for supposedly provocative behavior [52]. Another study revealed that such incidents often leave great stress on women, make them feel helpless, and further limit their mobility [3]. Reportedly, women are generally uncomfortable engaging in discussions regarding such harassment incidents because there are some social backlashes of bringing attention to street harassment, and disclosure of such incidents may also bring further shame and embarrassment for the female victims [3]. It has been reported that women often vent their frustration regarding such incidents on social media and disclose their experience to friends, peers, or followers [6,26]. Some tools and interventions were also developed to support such agenda of gender justice sought online by disclosing identifers, an image of the face of the harasser, for example, [26].\nThe reports on seeking justice online in the context of Bangladeshi gender harassment also cohere with this pattern, as we see from the reports [25,54]. In most cases, women were reportedly fed up with the response from the existing infrastructure of legal and social support, and thus, they found alternatives by exposing and shaming the harassers in front of internet-citizens, often termed as 'Netizens'. This model of seeking justice aligns with the idea of 'Mob Justice'. Mob Justice is defned as, \"Ruling by a group of mass\" [43,57]. Here the Netizens constitute the mob who decide the conviction. Although a part of such justice models seems to be unpredictable public opinion, mob justice has often been diferentiated as a model of justice when proper democratic participation is missing in a justice system, and people feel in-secured and lose their faith in legal systems [82]. This practice of Bangladeshi women seeking mob justice also excites one of our research questions.", "n_publication_ref": 12, "n_figure_ref": 0}, {"heading": "Authenticity of Image Contents", "text": "Now, we turn to some of the trendy reports on the authenticity of image contents on social media, which is associated with our third research question. With the advancement of technologies, users today can aford their image processing tools in their mobile phones, and thus, it is straightforward to edit and forge images and other multiple media contents [36,40]. A body of work has investigated such cases where people faked images and caused trouble, including communal riot [40,81,93,104]. For example, in 2013, thousands of miscreants gathered near the Buddhist colony in Coxsbazar in Bangladesh and launched a riot after the spread of a rumor that stated that one of the residents of the colony demeaned the Quran. The miscreants claimed that they saw a screenshot of the Facebook post taken from the suspected resident's Facebook profle, and later it was found that the image was forged [93]. Thus, image forgery has become a crucial topic of research with the widespread progress of social media.\nBeing concerned with the harmful efects of fake images, image processing research has progressed with a rich body of literature on this topic [49,50,62,79]. This body of work has been developing techniques to check authenticity and detect fake images on social media for a long time [72,101,116]. However, most of them are developed and tested for efciency in lab environments, and many of them require machines with a higher capacity to compute [72,116]. However, many of the end-users of Bangladesh may not be able to aford such machines' cost, and thus they might not beneft from them. Nevertheless, our goal of designing tools to ensure the authenticity of screenshots leveraged the insights from this body of work.", "n_publication_ref": 16, "n_figure_ref": 0}, {"heading": "UNDERSTANDING ONLINE GENDER HARASSMENT IN BANGLADESH", "text": "We conducted an anonymous survey and investigated the nature of women's experiences of online gender harassment, their existing strategies for seeking help and justice for it, and how their networks often react to that. Then, through interviews with 43 participants, we grew a deeper understanding of various angles of online gender harassment to fnd possible design avenues. This phase of work was conducted between June to October 2019. This study was approved by the ethics review committee of the authors' institutions.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Methods", "text": "To get a broader understanding of Bangladeshi women's harassment experiences online and to develop ideas of their resistance and associated challenges, we conducted both an online survey and an interview study. The anonymous online survey allowed many women to talk about this tabooed issue more comfortably. On the other hand, the interviews allowed us to go deeper into some of the stories coming from some women who felt comfortable to talk about this issue with us. We describe both of our methods below with further details.\n3.1.1 Online Survey. We hosted our anonymous online survey on Google Survey and circulated it online, including emails of the authors' friends and Facebook groups, which the authors' frequently used. Participants took part in the online survey by clicking on a link attached to the emails or the Facebook post. We requested a response from Bangladeshi female users only. The request for participants' consent came along with the post and the email. In the call for a response to the survey, we explained the purpose of the survey and ensured the anonymity of the respondents. The participants were allowed to proceed upon confrming at the beginning that this was their frst time participating in the survey.\nThe language of the survey was Bengali. It asked the participants about the type of harassment they faced on Facebook and other social media platforms, their relationship with the harassers, if they sought help from friends and law-enforcement authorities, and other relevant information. Although most of the questions were structured as check-boxes or multiple-choice questions, the survey also included several optional open-ended text-boxes where participants could freely express their opinions and concerns around their harassment on Facebook messenger and other social platforms. No personally identifable information (e.g., Name, Location. etc.) was collected from the survey participants in this study. We did not ofer any compensation for participation. It generally took the participants around 10-15 minutes to complete the survey. The participants were allowed to leave the survey at any time without any further consequences just by closing the survey window in their ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Interviews.", "text": "To grow a deeper understanding of diferent angles of online gender harassment, we conducted semi-structured interviews with 37 female and six male Facebook users. Among them, there were three male police ofcers who have been working for several years on gender harassment on cyber-spaces and one professional female lawyer who has been working on gender issues for the past three years. We recruited the participants from our professional networks on Facebook through convenient sampling [53].\nWe explained the purpose of the work to them while scheduling the one-on-one interviews. Since gender harassment is a stigmatized topic in Bengali culture, we let them choose between online and in-person meetings.\nWe conducted the interviews in Bengali. We asked them about their and their friends' experiences of online harassment, especially those which took place in comments and chats on social media, what kind of actions they took, what kind of help they sought, and other relevant information. We led to the deeper discussions only when they confrmed us of their comfort in talking about those incidents. The Police ofcers and the lawyer helped us with diferent socio-cultural, ethical, and legal angles of online gender harassment and existing support systems in the country for the victims. All the interviews started with oral consent from the participants and were audio-recorded in researchers' mobile phones with the participants' permission. We also took notes during the interviews. Generally, the interview sessions lasted around 30-40mins.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Data Collection and Analysis.", "text": "All the survey responses were initially recorded in the storage of the Google survey. The data came anonymized and we retrieved them in comma-separated values (CSV) format. Later we stored it in our secured storage space. First, we translated the CSV from Bengali to English and cleaned the data. We used the open-source statistical tools on python for further analysis. We also evaluated the responses qualitatively to understand the nuance of the online gender harassment faced by Bangladeshi female social media users.\nThe interviews generated a total of 11 hrs of audio recordings. We transferred them to a secured computer owned by the researchers. Then we translated and transcribed them. The transcriptions and the interview notes generated 80 pages of documented data. We removed the identifers before conducting open coding and thematic analysis on them [14,97]. Four of the authors independently read through the transcripts carefully and allowed the codes to develop. Later they shared their codes with each other. Initially, a total of thirty-fve codes spontaneously developed, for example, stigma, victim-blaming, skepticism and mistrust, denial, slut-shaming, betrayal, blackmail, threat, etc. After a few iterations, we clustered the related codes into themes and drew our design assumptions on them.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Unpacking Aspects of Gender Harassment in Bangladesh", "text": "The fndings from the survey and the interviews inform us about the harassers and the type of harassment often the victims face, existing social and legal supports, how those are helpful to the victims, and how the victims often resist their harassment. This subsection highlights some of the key fndings.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "3.2.1", "text": "The Harassers. We found that more than 70 of our survey respondents (58%) were harassed by unknown people online [see fg-1(right)]. Eleven of the interview participants mentioned that they tried visiting the Facebook profles of their unfamiliar harassers, but their information was hidden or their Facebook profle used \"locked\" feature. However, unknown online IDs may not always be strangers as fve of the interview participants mentioned that they had clues and evidence that their unknown harassers were someone they knew. Forty-fve of the survey respondents (36%) said that their harassers were their classmates, friends, and relatives who did not even bother hiding and harassed them upfront [see fg-1(right)]. A survey participant expressed her frustration and intimidation as her harasser was a law student at her university and hoped that this survey might help her fnd ways. Another interview participant mentioned that her husband lived overseas, and her sister-in-law and sister-in-law's husband are the temporary guardians of her Relationship between the harassers and female victims in context of harassment over Facebook Messenger toddler and her. She explained how her sister-in-law's husband tried to take advantage of her and used Facebook messenger for that, \"The man keeps texting me on Facebook asking to see him outside alone, sends me vulgar images, and deletes those from his end in a few minutes. I can not even block him because then what will I tell my sister-in-law? They live next door, and I often need to leave my baby to them if I go outside. I can not ofend her, right?\", (P28) Another 13 of the interview participants shared similar stories of their online harassment incidents and explained how challenging it was since those came from family members or close relatives. Five of them even refused to discuss the details of the incidents as they tagged those as \"private problem within the family\" and felt the burden not to disclose the matter for the sake of their families' privacy.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Types of Harassment.", "text": "Our survey reports that online harassers often send women vulgar text messages and inappropriate multimedia contents, request nude photos of them, threaten them of defaming using their photo-shopped pornographic images, and sometimes threaten them to rape and murder [see fg-1(left) for the breakdown]. We divide the patterns of harassment into three major categories: forcing a romantic relationship, seeking revenge, spreading hatred and threatening, and venting random frustration.\n(a) Forcing for a Romantic Relationship. Thirtynine of the survey respondents reported that they were forced to go in a romantic relationship, date them, or marry them [see fg-1(left)]. Fifteen women informed us that they were repetitively asked them out and marry them through texts and calls, and even in comment sections of their and their friends' posts by the harassers. Eleven women also received a threat of kidnap, force marriage, or rape. (b) Imposing Conservative and Religious Sentiments. Nineteen women mentioned that their harassers, both online and in real life, used conservative and religious sentiments to harass them. In many cases, the female victims are often cursed for numerous reasons, including their working or studying outside and their attire as a justifcation for their harassment. Four of our interview participants were Hindu females, and all of them mentioned that their online harassers frequently used anti-Hindu mockery. (c) Venting Out Random Frustration. Our survey informs that seventeen participants' harassers called them over the phone or messenger call services and initiated threatening and inappropriate conversations. Twenty-one participants received threatening and erotic texts, or vulgar messages, inappropriate audio clips, and multimedia contents from unknown accounts. Eleven of our female interview participants also mentioned that they had no idea why a random person harassed them online and assumed that their harassers were possibly frustrated and harassers probably think women's inboxes are the safest places for venting out their random frustrations.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "3.2.3", "text": "Existing Social and Legal Support. Our survey asked if the participants ever considered seeking legal help. Nineteen of them responded that they did not know the appropriate process. Another ten mentioned in their survey responses that their parents are reluctant to get into legal issues. Some of the respondents mentioned that their previous experiences with local law and law enforcement agencies were not convincing, and thus they did not trust them. One of the survey participants also suspected that in her response that involving the law-enforcement agencies might even bring her further trouble in day-to-day life security. When we discussed this with three of our professionals, they explained to us that many times it is difcult to fnd the harassers and bring them under the law because they either use a fake Facebook ID, or use cloned ID. Also, they mentioned the challenge with digital evidence, \"Often we receive complaints about online gender harassment, and they mention comments and private chats. They also send us a copy of those in images, but those images may not work as solid evidence. See, today, many pieces of software would manipulate the images of chats and comment on Facebook. One way to solve this challenge is to come by our ofce, log in to their Facebook from our computer, and show us the evidence from there. They can also log in using a desktop and the browser to enter Facebook and video record the chat history along with the address bar on the top so that we can see who exactly was the person they chat with. This might minimize the scope of manipulation. \", (P41) However, in many cases, these are troubles for many victims because of their limited resources. Also, fling police cases takes a long time to solve. Thus, many of our participants mentioned that they would just pass complaining even if they know the process.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "3.2.4", "text": "Resistance. During the sessions, we investigated how do the participants address their online harassment and documented their response. We cluster the ways in three themes: ignoring and blocking, reporting to the authority and the platform, and expose and shame. We briefy discuss them below:\n(a) Ignore and Block. Twenty-seven of our interview participants informed us that they think it is better to ignore the harasser silently. Seventy-fve of our survey respondents and 23 of the interview participants mentioned that they had blocked their harassers on social media. However, blocking does not end the story in many cases, especially when the harassers are desperate and fearless. As one of the interview participants explained, \"My friend was harassed by a man from her village. He used to text her asking out and my friends never agreed. He sent awful (sexually explicit content) things and scared her to marry him. No matter how many times she blocked his phone number on her phone and his Facebook IDs, it did not help. He would start over with new numbers and IDs. \", (P9) Another participant gave an example of her friend, who was harassed by her school teacher in class and over Imo a few years back. The participant explained how blocking and ignoring was not feasible for her. During this COVID-19 situation, we found a similar story of four other participants whose online-class teachers harassed them, and they could not even block them as they wanted to continue their education. Thus, our study found that when women were harassed by their known people, they tried blocking and ignoring, but those did not solve their problems for many reasons.\n(b) Report to Platforms and Rightful Authorities. Twentythree of our interview respondents reported their unknown harassers on the social media platform they used. Nevertheless, the process of reporting to the social media platform often also suggested them to block that person, which was impractical in many cases. Furthermore, online harassment within professional groups was more challenging for women to handle. Our study collected thirteen cases where women's online harassment happened in their work-spaces. Two of the victims complained to their higher ofcials, and their cases were resolved with minimum punishment, as one of the respondents shared her friend's experience, \"Her teammate wanted to date her, and she ignored. He cursed her in texts and emails. When she reported to her team-lead with copies of those emails, he 'helped' resolve the case and said, 'This is a minor problem, which may happen when we work together. Let it go.' Their ofce asked her to delete the copies of the emails from her end since they wanted to keep the environment toxicity-free and reputation fawless. \", (P12) Thus, this participant explained her friend's frustration as she could not block or ignore him, neither her reporting to the rightful authority worked, and she was requested to destroy the evidence. However, reporting to rightful authority was difcult for the other eleven participants since those harassers were either their seniors at work or their favored ones.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "3.2.5", "text": "Motivation to Expose and Shame. Our participants mentioned several reasons that infuence online gender harassment victims to expose their harassers online. These reasons include: i) many of the victims fnd justice in shaming the harassers in public, ii) women want to warn others to be aware of the harassers, iii) exposing the harassers online help them prove the case of harassment, and iv) in many cases, exposing helps to push the formal reporting to the rightful authorities. We discuss these reasons below.\n(a) Justice in Shaming. Sometimes women facing harassment feel that exposing their harassers should be a possible response while seeking gender justice. Twenty-one of the interview participants mentioned that they think shaming is the way to prevail when it is challenging to bring the harassers under justice through social, professional, and legal systems. One of the participants who lived in a small town shared a story of a school teacher who harassed her and many other girls over messengers.\n\"He picked the under-performing girls, sent them porn images, and forced the conversation. If someone refused, then he would complain to her parents that she is inconsistent with studies. Some girls fnally exposed his actions. Now he is known as a predator in the town; he has lost most of his private tuition. Now, he should be shamed in public. \", (P37) Thus, 15 interview participants mentioned that they have considered exposing or have exposed their harasser by publishing the harassment stories and a copy of their conversations, if available, in public. The victims believed that this would impact harassers' social and professional life, which is the punishment they deserve.\n(b) Blowing the Whistle to Warn Others. 9 of the interview participants who went to the same university mentioned a similar story of a harasser at the university who harassed many female students in their Facebook inbox and later got exposed to a Facebook group related to that university. One of the participants explained the story to us, \"My roommate's harassers harassed a few more girls we knew. However, she never reported his as she was afraid that he might get vindictive. Meanwhile, his harassment stories started coming out in (name of the group). My friend and I convinced a male friend to share screenshots from our side to show more victims of this harasser. And we wanted to tell the other female students that they should be aware of this person. \", (P29) Thus, these female participants mentioned that they did not see prevailing justice only through punishment or shaming, but through fnding a way that no person becomes a victim of the same thing again. They also explained that since society is patriarchal and men are considered superior here, it is an injustice to a girl not to inform her about the predators around them.\n(c) Releasing the Burden of Proof. Thirteen of our participants pointed out that often they were asked to submit proofs whenever they raised their voice against their harassers. In many cases, their cases are dismissed because they do not save those or post those. One of the participants was involved in organizing an event with many senior alumni at her school, and one of them harassed her online. He kept asking her to spend some 'quality time' as he termed that way. When she raised her voice against it, she was shut because of a lack of proof, as she explained, \"He repetitively sent strange texts using secret message mode (on Facebook Messenger). Once the celebration was over, I posted the story on the school alumni group with a copy of our chat a few seconds ago. However, his friends asked me where is the proof that he ridiculed me consistently and why am I saying it now... I wish I saved the previous texts as well. \", (P23) The participant further explained that how the friends of that harasser started dogpiling. Another 5 participants also shared a similar pattern of such experiences when people asked for proofs even for repetitive harassment incidents.\n(d) Exposing is Reporting. As we showed that sometimes formally reporting to the concerned authorities failed and dismissed, organizing mini-movements on social media against the harassers might help establish gender justice. For example, here is a story that one of the interview participants shared. A renowned professor in their department was accused of online gender harassment. Initially, some of his students and colleagues denied accepting that because of his skyrocketing reputation. We quote one of the interview participants, \"When the frst girl raised her voice on Facebook, they challenged her by asking, \"Did he really harass you in the chat?\". Then she gave screenshots, and they said she made it up. Then gradually, more women came out, some from other universities and even school kids who got connected to him through a competition. Some girls claimed that they formally reported at the university, but their cases were dismissed as he is a star professor. Finally, when he lost his reputation, the university stepped in and fred him. \", (P20) Our participants mentioned that sometimes it is difcult to start a conversation on harassment due to fear of further victim-blaming and slut-shamming. Thus, 17 women mentioned that while reporting these to anyone outside their friends, women should either use a fake ID --possibly as male one -to hide behind it and avoid victim-blaming and slut-shaming, or request a male friend to speak for them for more credibility. But even then, they are frequently challenged for proving the authenticity of the evidence that they present. All of our interview participants and 29 online survey participants mentioned that either they faced this challenge of authentication or they did not complain to avoid such challenges. They all highlighted this as an important obstacle toward getting gender justice for online harassment.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Summary and What is Missing", "text": "The frst phase of the study reported three major aspects of online harassment in Bangladesh. First, we found that women are often victim-blamed and slut-shamed for the harassment they suffer from. Therefore, they generally prefer to keep the harassment incidents secret. Sometimes, they share these stories with their friends and solicit possible solutions. Sometimes, they also try to locally solve this issue while hiding their identity. Second, those who choose to break the silence, respond to the harassment by exposing the harasser before the public with evidence of the history of the conversation, as getting gender justice to their immediate social connections often seems improbable. Thus, they show solidarity to other victims if harassed by the similar type of harassers. Third, the victims of such harassment cases often face backlash from the people they seek support from as those people often deny to believe the harassment stories. In such cases, even if the victims present the screenshots, often those people are skeptical about the authenticity of the screenshots, and they tend to reject the complaint without taking a deeper look into it.\nAmong all the challenges regarding online gender harassment in Bangladesh, we pick evidence-authentication problem for design. We did not prioritize this objective over the other design needs, but to complement them. The professionals working for police informed us that confrming the authenticity of digital evidence of harassment is challenging and the forensic procedure is also complicated. Still, they try to work it out by either in-person evidence collection or videos of chat where they get to see the harassers' ID. However, this complicated process further discourages the victims from seeking legal help. Today, this part of the design of social media is poor. Widely used social media platforms in Bangladesh, including Facebook, miss a feature that would help online gender harassment victims prove the authenticity of their harassment evidence and help them engage in conversation with law enforcement organizations to establish online gender justice with minimum hassle.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "DESIGNING 'UNMOCHON': A TOOL SUPPORTING GENDER JUSTICE", "text": "We draw on the fndings from the survey responses and the interviews and translated those into the design. We named our tool Unmochon. It is a Bengali word which means 'disclosing' or 'unavailing' something. One of our pre-design interview participants discussed an idea of a hypothetical anti-harassment tool and named that 'Unmochon'. Later, we borrowed it from them. This section describes our design goals and components of the application followed by the details of implementation.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Design Goals", "text": "Our fndings from the pre-design survey and interviews inform us of the denial that the victim receives while seeking online gender justice. Therefore, we set our objective to help women collect evidence of their harassment in a way that could be accepted as authentic by the concerned ones. We borrow the idea of shaming from shame-based design for gender justice [12]. We select Facebook as the platform for the deployment since Facebook is one of the most widely used social media platforms in Bangladesh. We draw on our fndings to determine four design goals necessary for a successful online anti-gender harassment tool:\nG1: Capture Screenshot with Authenticity. The participants described scenarios where they saw general people on Facebook being suspicious of the screenshots being true. In some cases, the screenshots were manipulated and some words were replaced. This kind of scenario urge us to set the goal to design a tool that captures the screenshot with minimum or no option of moderation. G2: Confrm that the Facebook Account in the Chat and Facebook Account Being Accused is the Same. In some cases, someone opened a cloned Facebook ID of a particular person, pretended to be him, and harassed women over the chat to defame him. This scenario urges to set the goal to design a tool that confrms that Facebook account in the chat and Facebook account being accused is the same. This will also make sure that no innocent individual gets reported and shamed in this process. G3: Hide the Identity of the Victims. Some of the participants reported that they would prefer opening another Facebook account or requesting friends to make the case on behalf of them so that they would stay behind the curtain and avoid victim-blaming and slut-shaming. Thus, our third goal of the design is to create such an afordance and lessen women's dependency on others.\nG4: Share Screenshot in Public. In most cases, victims share the evidence of harassment in public to shame the harasser, fnd more victims of the same harasser and share moral support, and seek mob justice.\nOur fnal goal is built on this existing practice and we aim to create a convenient platform for them to share their evidence and proof of its authenticity with minimum hassle.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Components and Workfow of Unmochon", "text": "From the user needs and design goals arising from the interviews, we prototyped Unmochon. It is a windows-based application. It has three main components: the browser plugin at the user-end, a server for storage, and a dedicated Facebook group run by human admins.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "4.2.1", "text": "The Browser Plugin. The application comes with an unmochon.exe plugin. The purpose of the plugin is to take the screenshots from the chat window of the victim and prepare it for sharing. The initial version of the plugin that we used for the study only works on the Chrome browser. It is developed on Java Platform. Taking Screenshot. Once the plugin is installed, the welcome window pops up with a button on it saying 'Take Screenshot'. After pressing the button, the application will allow the users with 10 seconds to set up their Facebook messenger chat thread on the Chrome browser of which they want to capture the screenshot. Once the 10 seconds is over, it will automatically capture a screenshot and copy the URL from the address bar that shows the unique Facebook ID number of the account with which the user had a chat and took a screenshot of.\nHiding Identifers. Upon capturing the screenshot, the application opens the editing window that allows the users to use the drawing pen only so that they can hide their own name, display picture in the thumb and any related sensitive information, which they prefer not to the public (see the components and the fow in fg-3 (left)). Once they are done hiding such identifers, the application allows them to save the image of the chat and set it ready for sending it to the server for further process. However, the step of hiding identifers is optional and users can skip it by pressing 'cancel' button and proceed to the next step of reporting by sending it and the harasser's Facebook account number to the server.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Storage in Server.", "text": "Once the screenshots reach the server, it stores them there. Then it puts a stamp on the image that says 'Verifed by Unmochon' which means the screenshot of harassment chat history was taken and reported using the application and thus it is possibly not fabricated. The mechanism of putting the stamp is preset and functions only when the Facebook account number reported by the user and the one retrieved by the plugin while taking the screenshot is the same (see the components and the fow in fg-3(top-right)). The mechanism also detects the mode of the reports by analyzing if the user has kept their identifers (mode-1) or hidden those (mode-2) in the sent image, before sending it to the Facebook group. Thus a package of four items is sent to the Facebook group, the image, the victim's requested mode and Facebook account number, accused harasser's Facebook account number, and how many times the same Facebook account number has previously been reported as a harasser. We have used google cloud platform for the server. All the communication between the server and the Facebook users are end-to-end encrypted.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Facebook", "text": "Group. This is a Facebook group with all the posts preset to the privacy setting of 'public'. Only the application developed by us can post here upon being approved by human admins (see the components and the fow in fg-3 (bottom-right)). This admin panel consists of responsible individuals of the society including members of law enforcement, psychologists, and gender activists. Once the package from the server arrives at the group and requests posting, the admins check if the report is a spam. In cases of garbage-posting, the admins would disapprove the posts and remove them from the list of pending requests on the Facebook group. There could be two types of mode of reporting. If it is 'mode-1', then the post comes with the victim's name and Facebook account number, the screenshot of the harassment chat-history, the accused harasser's Facebook account number, and how many times this person has been reported previously. For a 'mode-2' reporting, the post discards the victim's name and Facebook account. We have used Facebook Graph API for the communication between the server and the Facebook group.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "USERS' FEEDBACK ON UNMOCHON", "text": "Our fndings from the survey and pre-design interviews suggest that online harassment of women is a sensitive issue and often  victims are in a vulnerable position due to lack of socio-cultural support. So, we were wary of conducting an intervention with the participants, rather we decided to share our plugin with the users with no active contact with the server and the Facebook group, explain the whole idea, and seek their feedback. We frst prepared a user-study package, which included a prototype version of the plugin and the user-guide to the application. To avoid unintended posting during the user-study, we shared the version of the prototype with no connection to the server and the Facebook group (see fg-4, attempt to posting on Facebook failed as we did not deploy in this version of the prototype that we evaluated). For their better understanding, we also created a video demonstrating all the design goals and explaining how they will be functional in the application, and we added that video to the package that we shared with the participants. This phase of study design followed Mahar et al. [68].\nThis part of work was conducted during January-August 2020. All the interviews and focus group discussion before March 24 was conducted in-person and later we continued the study online following the special instructions by our universities regarding COVID-19 crisis. This section details the methods used and the data collection and analysis process.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Methods Used to Collect User-Feedback", "text": "In this phase of the study, we conducted focus group discussions and interview with participants who were Bangladeshi Facebook users. We discuss the details of our methods for this phase below: 5.1.1 Focus Group Discussion (FGD). We conducted a total of 6 FGD sessions with 19 female (4 groups) and 10 male (2 groups) participants. 13 of the female participants were from the set of participants of pre-design interviews. We recruited the rest of the participants from our professional networks on social media, from Facebook groups and friends. Upon reaching out to them, we explained the purpose of the work. We grouped relatively known participants of the same gender together and set up FGDs with them. We also sent them the user-study package a few hours before the interview so that they experience those and get some time to think about those. In the FGDs, we explained the purpose of the application and helped them to go through it step-by-step if needed. Then we discussed what kind of benefts this application might bring for the females to fght their harassment on Facebook Messenger in diferent kinds of cases. We also asked them what kind of challenges and troubles this application might generate for the users and other stakeholders.\nThe sessions were conducted in the Bengali language. The average length of the sessions was 35 mins. We requested for participants' permission to audio record the sessions and received permission to record 5 of them. We also ofered them to discard the discussion at any moment due to their discomfort. However, no such incident happened. The participation in FGD was voluntary and the participants were not paid.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Interviews.", "text": "Along with the FGDs, we conducted 19 interviews (13 females and 6 males) with Facebook users as they requested a one-on-one conversation instead of a group discussion. 8 of them were from the set of participants of pre-design interviews. As before, we recruited the rest of the participants from our professional networks on social media, from Facebook groups and friends. Upon reaching out to them, we explained the purpose of the work. We also sent them the user-study package a few hours before the interview so that they experience those and get some time to think about those. During the interviews, we explained to them the purpose of the application and helped them to go through it step-by-step if needed. Then we asked them what kind of benefts did they see and how this application might be efective for diferent kinds of gender harassment scenarios on Facebook messenger. We also asked them what kind of challenges and troubles they could imagine that might generate from this application for the users and other stakeholders.\nAll of the interview sessions used Bengali as the primary language. It generally took around 25 and 40 minutes to complete the interview. 13 of the interviews were audio-recorded with the permission of the participants. We left every opportunity for the participants to leave the interview if they felt uncomfortable, even during any ongoing sessions. We also informed them that we would discard the record of their participation if they wanted. However, no such event took place over the course of the study. The participation in interview was voluntary and the participants were not paid.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Data Collection and Analysis", "text": "The audio fles of interviews were recorded in the researchers' phone and later saved in a hard drive for further data processing steps. We collected a total of approximately 8 hours of audio recordings and around 100 pages of interview-notes. In the analysis process, we frst transcribed the audio recordings and later translated them into English. We then performed thematic analysis on the transcriptions and our detailed notes [14,97]. Four of the authors independently read through the transcripts carefully and allowed codes to develop. Later they shared their codes with each other. A total of 24 codes spontaneously developed during the frst round of the coding. Then we clustered related codes into themes after a few iterations. Some of the themes seemed recurring, for example, vindictive, privacy, posting, recognition, justice, etc. Such themes infuence the organization of our fnding section presented next.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "FINDINGS FROM USERS' FEEDBACK", "text": "Our design met all the design agendas and the prototype served the purpose of collecting the evidence preserving the authenticity (G1), along with the design goal G2 and G3 (no evidence was posted and G4 for this prototype was not evaluated by the participants). However, our users' feedback brought some concerns and suggestions that we divide in three categories: design concerns and suggestions, justice concerns, feedback on user interface and process. We discuss them below.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Design Concerns and Suggestions", "text": "One of the suggestions that came out during an FGD session with 6 participants was whether it is possible to check the metadata and include a verifcation status with the screenshots before sending that to the server and adding that in the reports' status while posting them on Facebook. They explained that this approach could In another group of 5 participants, they discussed what could be the disadvantages of letting the harassment reporters hide their identifers by drawing lines on them. They discussed a hypothetical scenario where someone manipulated the browser with its metaelements, then captured the screenshot and hid the identifers. In the same conversation, one of the participants suggested a possible solution to such scenario could be to let the application report the screenshot along with metadata of the page. Also, they suggested that the tool should reload the page by itself automatically before it captures the screenshot, to avoid possible manipulation in the chat through some advanced engineering with the HTML elements of the page. Concerning this point, one of them suggested developing this as a mobile app. 10 of our FGD participants anticipated that once such a tool is available, the server will be fooded with reports and many of those might be just random people sending random reports which might have nothing to do with harassment. They also proposed that this tool needs an intelligent flter to select and let in harassment-related posts only. Also, in these conversations, the participants discussed the need for a guideline to defne harassment. Another group of 4 participants raised a concern that if the harasser is wise, then they would immediately know which one of the victims of them have reported just by seeing the screenshot in the report. They also suggested to report the name of the harasser upon verifying the authenticity of the evidence and not to expose the image of the chat; to hide all the possible identifers of the victim.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Justice Concerns", "text": "While providing us with feedback to our prototype, our participants raised some concerns regarding gender justice. We categorize them into hegemonic legal consciousness of the stakeholders in the conversation of gender justice; many aspects of mob justice on social media and how those infuence gender justice; and ofenders' privacy, and discuss them below. 6.2.1 Hegemonic Legal Consciousness. One of our interview participants, P61, is a lawyer and she informed us that institutional justice in Bangladesh is not transparent and female-friendly. The system is inclined more towards power-politics. Thus, often the victims fnd it easier to seek justice in social shaming. She told us some of the stories from the cases of gender harassment which she recently handled and shared her experience with us as a relevant example. A female debater developed an intimacy with another fellow male and that afnity turned toxic at some point. Later, the female debater turned in a written complaint to their association and accused the male colleague of gender harassment on messenger inbox in a particular social media. As P61 explained, \"The female submitted some screenshots of their chat history to their association to make the case of harassment. Then the accused ofender submitted some evidence from earlier chat histories to prove that they were in a romantic relationship at some point and claimed that the female colleague is accusing him of harassment to break his upcoming marriage. On the basis of the submitted evidence, the association came to the conclusion that the female colleague was NOT harassed, but the male colleague should also have behaved himself. \" (P61) P61, thus, explained how gender, social position, and other hegemony infuence the transparency in the model of justice in Bangladeshi society, including professional spaces. She further stretched this conversation and explained how such a social and professional setting often disregards women's sensitivity to their online harassment. She pointed out that it would be generally difcult for women to seek out online gender justice, even with technology like Unmochon.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Mob", "text": "Justice on Social Media. Our participants brought up several challenges while seeking gender justice on social media. During our discussion with one of the male participants, he informed us that communication skill matters the most in seeking online mob justice. He explained, \"When a female victim exposes the online harasser to the online community shared by both of them, often her communication skill plays a role here. Sometimes people visit the victim's Facebook profle and thoroughly investigate if she looks suspicious. If she wears modern clothes, then people often redirect the case and say she was asking for it. Often women lose control over their temper at that point and start fghting. However, if the victim stays calm, ignores the slut-shamming, and responds to the audiences with relevant evidence then the victim wins their support. \" (P73)\nIn the same discussion, he added that storytelling is also equally important. When a woman keeps telling a consistent story on social media and if the clues that she leaves connect to reality and to the version spoken by the other stakeholders, then that story is widely accepted and the victim is likely to be trusted by the people. Therefore, how the evidence is compiling into a coherent narrative rather than a scattered truth often makes the diference, as he explained, \"There could be multiple versions of the same story. But it is the woman's burden to speak out the version in a way that aligns with plausibility. If she sounds strange and illogical in view of the public, then her claims are denied. For example, a group of words, \"I really need to meet you this evening, if you do not meet me then that is going to be a problem\" could mean a lot of things. People will be curious about why the accused person wanted to meet her. People on Facebook would say it is her job to provide more context and coherent evidence so that it can be categorized as harassment and not some business or real needs. \" (P73) 8 of the interview participants also were concerned by the standard of judgment by the people on Facebook as there are diverse groups of people with diferent ideologies and philosophies. They were concerned about who would decide the metrics in a complex social setting of multiple moralities, as they expressed it this way, \"There are diferent types of people on Facebook. Some are extremely patriarchal, some are extremely conservative. There are also people who are against women using Facebook since they think women meeting unknown people on Facebook, losing their purdah and this is against the women's purity concept in their practicing Muslim ideology. So when a woman comes and seeks justice here, if she has any such people in the community in front of which she is trying to establish her requited gender justice, they might face a backlash as the mob would say she should have not talked to men or create a scope to let the men talk to her. They might say she invited it. So in such cases, even if she proves that the harassment was true, she might still fail to establish justice because of this blame. \" (P64) 13 of our participants pointed to the fact that the idea of exposing the ofender in front of the online community shared by both of the parties using the screenshot of chat history repetitively might lessen the gravity of their complaints and could be problematic for them. Thus, the community is involved in the process of investigation and may become curious about further details which might be irrelevant to the complaint made, but later those can be subject to some other harassment. For example, P67 explained the story of one of her female friends, \"A few months back, my friend frst complained against a male classmate in our class's Facebook group with no solid proof. Many of the group-members found that baseless and dismissed her accusation. Recently, when she complained against the same person again, the harasser and his fellows said that she was deliberately doing this again and pointed to the previously dismissed complaint. Many people in the group then dissed her recalling her previous complaint, my friend felt sick and left the group. \" (P67) Thus, our participants informed us through many discussions that securing online gender justice with mob would need not only authentic evidence but how the victim communicates and how they align with mob sentiment are equally important factors in this regard. They further stretched the discussion and urged that our design goals should include such needs of the victims for the upcoming versions of this prototype.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Deliberate Defamation and", "text": "Ofender's Privacy. In an FGD of four, two participants mentioned that some targeted defamation might happen through this system. To explain their point further, they mentioned hypothetical scenarios where someone might submit images of out-of-context messages and make fake claims. However, through the demo, this group of participants fgured that out-of-context messages and garbage-posting would be disapproved by the admins before posting on the Facebook groups. They also fgured that our system already also allowed the community to facilitate a conversation with the accused in order to avoid such tricky cases, including the misuse of consensual conversations. The participants emphasized that such cases should be handled with more carefully and compassionately, since those could directly afect the reputation of both of the parties, and might also impact the efectiveness of our design.\nFive of our interview participants also pointed that the harasser might make a case of their privacy breaching if a victim share their personal conversation in front of a wider audience. One of the female participants shared her experience of accusing a male friend of harassment and further consequences, \"First when I shared the photos of our chat history with some of the other friends, he claimed that the photos are made up. Like I fabricated them. Then one day I logged into my Facebook profle in front of people at the university and proved that I did not manipulate it, he started countering me by saying whatever happened, he did it privately and yelled at me asking why did I invade his privacy in front of people. Do I really have to care about his privacy after he had done so much damage to my mental health?\" (P59)\nWhile making this point, the participant also added that the tool we have developed, may not be able to secure the privacy of the harasser and might be much less helpful than expected by the victim while seeking gender justice for their online harassment.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Feedback on User Interface and Process", "text": "During the user-evaluation, the participants gave us some feedback on the User Interface. For example, 5 FGD participants showed their frustration on the lengthy processing time of the image after being captured by the tool. Also, another 6 participants suggested having a progress bar so that the users may know the approximate waiting time for particular processes. 9 of the FDG participants suggested to convert it into a mobile application and put it as a foating button on top of the screen. They added that a lot of users in Bangladesh do not have access to a desktop. Therefore, developing it as a mobile application would beneft them. 11 of the participants insisted on making the application more informative, interactive, and guided. During the interview session with P71, she explained her problem, \"While running the application, I did not understand if it had already taken the screenshot and where did it go. I think it will be more helpful if the application windows are a bit more verbose and tell the users what exactly is happening in the ongoing step. \" (P71)\nThe required browser version to run tool did not match 5 of our participants' browser versions and thus, they had a hard time using the tool. After testing for some more time, participant P60 noticed that while capturing a screenshot, it's difcult to move the application window from the intended surface for the screenshot. Both participants P61 and P59 tried but the application window could not be moved or minimized once the button was clicked.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "DISCUSSION", "text": "This paper has described the details of Bangladeshi female internet users' gender harassment and the measures they take while addressing those. In this regard, we conducted an online survey and interviewed participants. Drawing on our fndings, we built a set of design goals that are more practical and appropriate for helping the victims fght their online gender harassment. We prototyped a version of Unmochon, conducted user-evaluation, and reported the perception of victims and other stakeholders of such feminist designs. The fndings of this work lead us to discuss some broader agendas of feminist technology design, social support and law, and gender justice.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Feminist Technology Design for the Global South", "text": "Our study joins the feminist-HCI discussion by bringing in the concerns of authenticity challenges faced by women in the global south while seeking gender justice to their online harassment. Previous literature on women empowerment in the context of the Global South showed that women here were socially and culturally trained to accept or ignore their harassment and not seek out external help [3,99]. In this work, we showed that many women in Bangladesh still sought justice to their online harassment that took place on chat messenger by raising their voice against the harasser on social media. In this process, the women were often asked to prove that they were harassed. Upon showing images of the conversation, people often challenged that evidence for authenticity and further harassed her. In this paper, we report this design challenge and prototyped 'Unmochon' to support women. Researchers working on gender harassment on social media often call for engaging more women, especially gender harassment victims, in designing gender justice tools and techniques [12]. We have responded to these calls through this work since most of the authors and designers in this work are females and have experienced gender harassment on social media. Here, we cohere with 'designing within patriarchy' orientations by leveraging women's existing way of seeking justice online [99]. Our fndings on users' feedback showed that proving the authenticity of the evidence presented by the harassed women might still not ensure justice to her harassment as mob-sentiment, hegemonic legal consciousness, and many other privacy challenges were associated with seeking justice online. Building on the fndings from our study, we argue that along with focusing on the users and their immediate needs, feminist-HCI and ICTD should also aim at supporting gender movements on social media and handle the above-mentioned political complexities so that we can ensure a better online experience for the female social media users from such complex patriarchal societies.", "n_publication_ref": 4, "n_figure_ref": 0}, {"heading": "Social Support and Law", "text": "Our study of online gender harassment also joins the design for social good movement within computer science, Ubicomp, and HCI [1,10,18,30,34,84]. Building on the concept of community-based social support, the existing body of work adapts the assumptions of afrmative design and persuasive design [32,46,86] and contributes to the goals of social good for all. With our study, we have extended this line of literature to the context of the Global South, where the users and multiple stakeholders often hold diverse and tangential agendas in a given social setting [3]. Our study found that the intersection of social support and law in Bangladesh is a complex space for designing gender justice for women. Our work found that many of our participants were harassed by their friends and family members. Thus, their online harassment cases were not solvable by just blocking the harasser. Furthermore, we show that although often women seeking gender justice online are dissed and humiliated by online populations, they still seek support from the community via friends or using a fake Facebook ID. We have also shown that victims often believe that their sporadically and locally organized small-scale protests might help them more than legal systems, and we have listed many reasons for their belief. All of these angles rising from the fndings of our study lead us to argue that technology should be designed to balance and bridge between social support and legal perspective to support the victims better.", "n_publication_ref": 10, "n_figure_ref": 0}, {"heading": "Women's Agency, Shaming Platform, and Transformative Justice", "text": "Our design strategy aligns with the spirit of Feminist methods (complaining, exposure, and refusal) that help women strengthen their voice within a patriarchy [69]. In many patriarchal societies, including Bangladesh, many men consider the women they are related to as their properties, and any disrespect and injustice to \"their women\" hurt these men. Thus, women's harassment is also considered a misdeed conducted against the men and is often regarded as a matter worth seeking justice. Our fndings join the existing body of South Asian Feminist-HCI work by Sultana et al. [99], Ahmed et al. [3], Kumar et al. [60,64], Mustafa et al. [78], among others and show that many women give up on remaining shy, raise their voices against such online harassment, and grow solidarity being within their community. Thus, they adapt complaining, exposure, and refusal as feminist methods of empowerment within the patriarchal society. We integrate these design strategies to create a platform of empowerment and solidarity that works \"within\" the patriarchal system, to help women make their complaints stronger, and to help them further gain more agency.\nIn this work, we highlight the transformative aspect of the design that we implemented through 'Unmochon.' Transformative design is based on a broad idea of fairness. Instead of punishing an individual for a crime, transformative justice investigates why that person committed that crime. This aspect allows us to fnd deeper problems in our society, including poverty, discrimination, lack of education, lack of social support, lack of good childhood, etc., which contribute to making a person criminal [22,38,77]. Transformative justice, hence, focuses on fxing those bigger issues [21]. This happens in three channels: (a) restoring the social imbalance caused by the individuals through social support, (b) changing the mindset of individuals who committed a crime through education and social support, and (c) addressing the bigger social problem that contributed to making a person commit crimes. Thus, transformative justice provides a way to reduce crime in a society in a more sustainable way.\nOne of the design principles of Unmochon is 'shaming' which may be interpreted as an adversarial action toward punishing someone for their misconduct. However, shaming also provides a person with a way to refect on what they have done from their social peers and repent for that. Therefore, shaming may reduce crime in a society [15]. The social process of shaming often also involves seeking forgiveness and committing not to repeat the crime. At the same time, social pressure is imposed on the person that keeps them away from a repetition of the same crime. The perpetrator then gets an opportunity to learn and change their behavior and mindset. At the same time, the discourse that is created around a shaming incident allows the society to refect on the broader picture of the societywhere the perpetrators are coming from? why is this happening? how can we put a stop to this? how can families, communities, and societies come together to fx the problem?. Such conversations often lead to social welfare activities. From this perspective, we hope that Unmochon also creates a platform for transformative justice. Having said that, we do also acknowledge that the actual happening of the transformative design largely depends on how people will use this platform, and there are chances that many people may only focus on the immediate punishment part of shaming. However, we believe that, given enough time, more and more people will start focusing on the long-term sustainable solutions to the problem, and the transformative aspects of Unmochon will prevail.", "n_publication_ref": 11, "n_figure_ref": 0}, {"heading": "LIMITATIONS OF THE WORK", "text": "Our work has several limitations. First, both online and real-life gender harassment is a stigma-topic in Bangladesh and for that reason, recruiting participants was challenging for us. Most of the interview and focus group discussion participants are recruited through snowball sampling and thus, they are mostly the people from the researchers' primary and secondary networks. Since we recruited the participants through convenient sampling, our work is not free from participation bias and selection bias. Thus, the opinions of our participants and arguments driven from the interviews and FGDs may not represent the collective view of the women of the whole nation. Second, we failed to engage with any participant of the third gender due to our limited reach. Thus, we did not gain any insight into their experiences of harassment and their opinion about our tool. Despite these limitations, the fndings of our study will be useful for feminist technology design in the context of low-resource and patriarchal settings. Also, the arguments and lessons from this study will contribute to women-empowerment policy-making in Bangladesh and other countries with a similar resource, environment, and social setting.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "IMPLICATIONS FOR DESIGN AND FUTURE WORK", "text": "In future iterations of the design, we plan to overcome or minimize some of the limitations of the existing version. Our user-evaluation also pointed to some of the necessary future design iterations. First, we prototyped our tool for Facebook messenger only. Our participants mentioned that they use Imo, Viber, Whatsapp, and other text messaging services frequently and face gender harassment on those platforms as well. Following their suggestions, one of the future work could be developing similar tools for Imo, Viber, Whatsapp, and other text messaging services that they use. Second, Our participants pointed out that sometimes it is difcult to explain the whole story of harassment just using one image and thus, the ofenders often go away taking the beneft of the doubt. In the existing version of the prototype, there is no way to collage multiple screenshots in the same report to explain the fow of the conversation. Our participants requested such functionality in the future iteration of the design. Third, this version of the prototype does not support submitting the evidence to police directly, although it fulflls some of the qualities and matches the protocol of the standard legal evidence collection followed by the Bangladeshi police in cases of cyber-crimes. This fact opens up a new opportunity for us to design technologies supporting gender justice within legal spheres. Fourth, in our future work, we will investigate how this system will be recognized by diferent Bangladeshi institutions and how that would impact their policies. The existing version of our system allows the users to develop informal community-based legitimate women-support groups (often consisted of senior women, in Bangladesh) that are not necessarily tied to a formal institution.\nIn future, we aim to develop platforms for better communication between the victim, the informal support network, and the formal authorities.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "CONCLUSIONS", "text": "In this paper, we present a deeper understanding of online gender harassment faced by Bangladeshi female social media users. Our work makes a four-fold contribution to feminist-human computer interaction (feminist-HCI), social media studies, and information and communication technologies and development (ICTD). First, our fndings show that many of the Bangladeshi female Facebook users seek mob justice and expose their harasser by posting photos of their conversation online as evidence, while this evidence is often challenged for authenticity. Second, drawing on our fndings, we build a set of design assumptions that are practical and appropriate for assisting such victims in seeking justice. Here, we bring the model of shame-based justice to design [12]. Third, in this regard, we prototype and evaluate Unmochon and report the perception of victims and other stakeholders of such tools that support online gender justice. Findings from the users' feedback pointed out that an end to authenticity problem may still leave the victim and online gender justice challenged by mob-sentiment, hegemonic legal consciousness, and many other privacy concerns. Finally, we report fndings from our discussions with the participants and other stakeholders that unfold diferent complicated issues entangled with cyber-harassment and social justice and suggest feminist-HCI and ICTD possible design directions for safer online experience for women in the global south.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Mechanism design for social good", "journal": "AI Matters", "year": "2018", "authors": "Rediet Abebe; Kira Goldner"}, {"title": "Protibadinext: Sensor support to handle sexual harassment", "journal": "", "year": "2016", "authors": "Nova Ahmed; Rahat Sadd Azmeen Ur Rahman; Tanvir Jahangir Rony; Vikram Mushfque;  Mehta"}, {"title": "Protibadi: A platform for fghting sexual harassment in urban Bangladesh", "journal": "ACM", "year": "2014", "authors": "Ahmed Syed Ishtiaque; J Steven; Nova Jackson;  Ahmed;  Hasan Shahid Ferdous;  Md Rashidujjaman Rifat; Shamir Rizvi; Rifat Sabbir Ahmed;  Mansur"}, {"title": "Hearme: A smart mobile application for mitigating women harassment", "journal": "IEEE International WIE Conference on Electrical and Computer Engineering", "year": "2016", "authors": "Md Saad Ahmed Akash; Tamal Al-Zihad;  Adhikary"}, {"title": "SafeStreet: empowering women against street harassment using a privacy-aware location based application", "journal": "ACM", "year": "2015", "authors": "Shabnam Mohammed Eunus Ali; Lazima Basera Rishta; Tanzima Ansari; Ahamad Imtiaz Hashem;  Khan"}, {"title": "Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity", "journal": "", "year": "2016", "authors": "Nazanin Andalibi; Munmun De Oliver L Haimson; Andrea Choudhury;  Forte"}, {"title": "Designing cyberbullying mitigation and prevention solutions through participatory design with teenagers", "journal": "", "year": "2016", "authors": "Zahra Ashktorab; Jessica Vitak"}, {"title": "Facts and Figures", "journal": "", "year": "2020", "authors": " Un Women -Asia-Pacifc"}, {"title": "Sofa Patel, Rebekka Rumpel, and Simon Wibberley", "journal": "", "year": "2014", "authors": "Jamie Bartlett; Richard Norrie"}, {"title": "UBICOMP 2009 Workshop CFP: Globicomp -Taking Ubicomp Beyond Developed Worlds from Julie Kientz", "journal": "", "year": "2009-02", "authors": "Russell Beale; Nicola Bidwell; Eli Blevis; Stephen Brewster; Anxo Cereijo Roibas; Keith Cheverst; Andrew Deardon; Jussi Impio; A Amit; Abigal Navavati; Yvonne Sellen; Lucia Rogers;  Terrenghi"}, {"title": "Like trainer, like bot? Inheritance of bias in algorithmic content moderation", "journal": "Springer", "year": "2017", "authors": "Reuben Binns; Michael Veale; Max Van Kleek; Nigel Shadbolt"}, {"title": "Classifcation and its consequences for online harassment: Design insights from heartmob", "journal": "Proceedings of the ACM on Human-Computer Interaction", "year": "2017", "authors": "Lindsay Blackwell; Jill Dimond; Sarita Schoenebeck; Clif Lampe"}, {"title": "Understanding\" Bad Actors\" Online", "journal": "", "year": "2018", "authors": "Lindsay Blackwell; Mark Handel; T Sarah; Amy Roberts; Kimberly Bruckman;  Voll"}, {"title": "Transforming qualitative information: Thematic analysis and code development. sage", "journal": "", "year": "1998", "authors": "E Richard;  Boyatzis"}, {"title": "Shame and criminal justice", "journal": "Canadian Journal of Criminology", "year": "2000", "authors": "John Braithwaite"}, {"title": "", "journal": "", "year": "2006", "authors": "Tarana Burke"}, {"title": "Why We Need to Acknowledge the True Founder of the #MeToo Movement", "journal": "", "year": "2018", "authors": "Tarana Burke"}, {"title": "Social sustainability: an HCI agenda", "journal": "", "year": "2012", "authors": "Daniela Busse; Eli Blevis; Richard Beckwith; Shaowen Bardzell; Phoebe Sengers; Bill Tomlinson; Lisa Nathan; Samuel Mann"}, {"title": "The bag of communities: Identifying abusive behavior online with preexisting internet data", "journal": "", "year": "2017", "authors": "Eshwar Chandrasekharan; Mattia Samory; Anirudh Srinivasan; Eric Gilbert"}, {"title": "A New Survey Finds 81 Percent Of Women Have Experienced Sexual Harassment", "journal": "", "year": "2018", "authors": "Rhitu Chatterjee"}, {"title": "Transformative justice: Anti-subordination processes in cases of domestic violence", "journal": "", "year": "2002", "authors": "Donna Coker"}, {"title": "Transformative justice: Charting a path to reconciliation", "journal": "Int'l Legal Persp", "year": "2001", "authors": "Erin Daly"}, {"title": "#MeToo In India: 75 Professors", "journal": "", "year": "2018", "authors": "Priyashree Dasgupta"}, {"title": "What Happened To Raya Sarkar's List Of Sexual Harassers?", "journal": "", "year": "", "authors": " Institutes"}, {"title": "#MeToo hits home -Cover Story News", "journal": "", "year": "2018", "authors": "Damayanti Datta; Shweta Punj; Chinki Sinha"}, {"title": "70% of women facing cyber harassment are 15-25 years in age", "journal": "", "year": "2019", "authors": " Dhakatribunedeskreport"}, {"title": "Hollaback!: the role of storytelling online in a social movement organization", "journal": "ACM", "year": "2013", "authors": "Michaelanne Jill P Dimond; Daphne Dye; Amy S Larose;  Bruckman"}, {"title": "Adversarial design", "journal": "The MIT Press", "year": "2012", "authors": "Carl Disalvo"}, {"title": "Social media and Turkish feminism: New resources for social activism", "journal": "Feminist Media Studies", "year": "2013", "authors": "Hande Eslen-Ziya"}, {"title": "Feminist activists protest tax on sanitary pads: attempts to normalize conversations about menstruation in India using hashtag activism", "journal": "Feminist Media Studies", "year": "2017", "authors": "Deepa Fadnis"}, {"title": "Software engineering for'social good': integrating action research, participatory design, and agile development", "journal": "", "year": "2014", "authors": "Maria Angela Ferrario; Will Simm; Peter Newman; Stephen Forshaw; Jon Whittle"}, {"title": "A survey of online harassment at a university campus", "journal": "Journal of Interpersonal violence", "year": "2004", "authors": "Jerry Finn"}, {"title": "A behavior model for persuasive design", "journal": "", "year": "2009", "authors": "J Brian;  Fogg"}, {"title": "Women's experiences with general and sexual harassment in online video games: Rumination, organizational responsiveness, withdrawal, and coping strategies", "journal": "New Media & Society", "year": "2017", "authors": "Jesse Fox; Wai Yen Tang"}, {"title": "Exploring social justice, design, and HCI", "journal": "", "year": "2016", "authors": "Sarah Fox; Mariam Asad; Katherine Lo; Jill P Dimond; S Lynn; Shaowen Dombrowski;  Bardzell"}, {"title": "When an Indian whisper network went digital", "journal": "Communication Culture & Critique", "year": "2018", "authors": "Radhika Gajjala"}, {"title": "Image quality assessment for fake biometric detection: Application to iris, fngerprint, and face recognition", "journal": "IEEE transactions on image processing", "year": "2013", "authors": "Javier Galbally; Sébastien Marcel; Julian Fierrez"}, {"title": "Using convolutional neural networks to classify hate-speech", "journal": "", "year": "2017", "authors": "Björn Gambäck; Utpal Kumar Sikdar"}, {"title": "From transitional to transformative justice: A new agenda for practice", "journal": "International Journal of Transitional Justice", "year": "2014", "authors": "Paul Gready; Simon Robins"}, {"title": "Where did 'Me Too' come from? Activist Tarana Burke, long before hashtags", "journal": "", "year": "2017", "authors": "Cristela Guerra"}, {"title": "Faking sandy: characterizing and identifying fake images on twitter during hurricane sandy", "journal": "", "year": "2013", "authors": "Aditi Gupta; Hemank Lamba; Ponnurangam Kumaraguru; Anupam Joshi"}, {"title": "Safe mathare: a mobile system for women's safe commutes in the slums", "journal": "", "year": "2012", "authors": "Margaret Hagan; Nan Zhang; Joseph'jofsh' Kaye"}, {"title": "Putting out the Twitter trashfre. Art+ Marketing", "journal": "", "year": "2016-02-13", "authors": "Randi Lee Harper"}, {"title": "Ochlocracy in the practices of civil society: a threat for democracy?", "journal": "Studia Juridica et Politica Jaurinenisis", "year": "2015", "authors": "Jasmin Hasanović"}, {"title": "Nonparticipation of bangladeshi women in #MeToo movement", "journal": "", "year": "2019", "authors": "N Hassan; M K Mandal; M Bhuiyan; A Moitra; S I Ahmed"}, {"title": "Nonparticipation of Bangladeshi Women in# MeToo Movement", "journal": "", "year": "2019", "authors": "Naeemul Hassan; Manash Kumar Mandal; Mansurul Bhuiyan"}, {"title": "Exploring, Defning, & Advancing Community-Driven Design for Social Impact", "journal": "", "year": "2019", "authors": "B Eric; Jennifer C Hekler;  Taylor; P Steven; Michèle Dow;  Morris; J Faren;  Grant; S Sayali; Don Phatak; Dana M Norman;  Lewis"}, {"title": "JusticeforLiz: Power and Privilege in Digital Transnational Women's Rights Activism", "journal": "Feminist Media Studies", "year": "2015", "authors": "Eleanor Tiplady Higgs"}, {"title": "Deceiving google's perspective api built for detecting toxic comments", "journal": "", "year": "2017", "authors": "Hossein Hosseini; Sreeram Kannan; Baosen Zhang; Radha Poovendran"}, {"title": "Deep fake image detection based on pairwise learning", "journal": "Applied Sciences", "year": "2020", "authors": "Chih-Chung Hsu; Yi-Xiu Zhuang; Chia-Yen Lee"}, {"title": "Fighting fake news: Image splice detection via learned self-consistency", "journal": "", "year": "2018", "authors": "Minyoung Huh; Andrew Liu; Andrew Owens; Alexei A Efros"}, {"title": "Shampa Iftakhar. 2020. # MeToo in Bangladesh: Can You Change", "journal": "", "year": "2020", "authors": ""}, {"title": "Gendered contestations: An analysis of street harassment in Cairo and its implications for women's access to public spaces. Surfacing", "journal": "An Interdisciplinary Journal for Gender in the Global South", "year": "2009", "authors": "Nadia Ilahi"}, {"title": "II. More than just convenient: The scientifc merits of homogeneous convenience samples. Monographs of the Society for Research", "journal": "Child Development", "year": "2017", "authors": "Justin Jager; Diane L Putnick; Marc H Bornstein"}, {"title": "Bangladesh: Social media, extremism and freedom of expression", "journal": "TRANSNATIONAL OTHERING GLOBAL DIVERSITIES", "year": "", "authors": "Ferdous Syeda Gulshan;  Jana"}, {"title": "Online harassment and content moderation: The case of blocklists", "journal": "ACM Transactions on Computer-Human Interaction (TOCHI)", "year": "2018", "authors": "Shagun Jhaver; Sucheta Ghoshal; Amy Bruckman; Eric Gilbert"}, {"title": "Cyber Crime a New Form of Violence Against Women: From the Case Study of Bangladesh", "journal": "Available at SSRN", "year": "2018", "authors": "Natasha Kabir"}, {"title": "From democracy to ochlocracy", "journal": "Hitotsubashi journal of economics", "year": "2007", "authors": "Yoshiro Kamitake"}, {"title": "Women support each other in the face of harassment online, but policy reform is needed | LSE Women, Peace and Security blog", "journal": "", "year": "2017", "authors": "Semanur Karaman"}, {"title": "Privacy, Patriarchy, and Participation on Social Media", "journal": "", "year": "2019", "authors": "Naveena Karusala; Apoorva Bhalla; Neha Kumar"}, {"title": "Women's Safety in Public Spaces: Examining the Efcacy of Panic Buttons in New Delhi", "journal": "ACM", "year": "2017", "authors": "Naveena Karusala; Neha Kumar"}, {"title": "Technology solutions to combat online harassment", "journal": "", "year": "2017", "authors": "George Kennedy; Andrew Mccollough; Edward Dixon; Alexei Bastidas; John Ryan; Chris Loo; Saurav Sahay"}, {"title": "OC-FakeDect: Classifying Deepfakes Using One-Class Variational Autoencoder", "journal": "", "year": "2020", "authors": "Hasam Khalid; S Simon;  Woo"}, {"title": "Playing by the rules of the game: women's experiences and perceptions of sexual harassment in sport", "journal": "Canadian Review of Sociology/Revue canadienne de sociologie", "year": "1999", "authors": "Vivian Krauchek; Gillian Ranson"}, {"title": "Mobile phones for maternal health in rural India", "journal": "ACM", "year": "2015", "authors": "Neha Kumar; Richard J Anderson"}, {"title": "Engaging Feminist Solidarity for Comparative Research, Design, and Practice", "journal": "ACM", "year": "2019", "authors": "N Kumar; N Karusala; A Ismail; M Wong-Villacres; A Vishwanath"}, {"title": "Online harassment, digital abuse, and cyberstalking in America", "journal": "", "year": "2016", "authors": "Amanda Lenhart; Michele Ybarra; Kathryn Zickuhr; Myeshia Price-Feeney"}, {"title": "College students' Facebook stalking of ex-partners", "journal": "Cyberpsychology, Behavior, and Social Networking", "year": "2011", "authors": "Amy Lyndon; Jennifer Bonds-Raacke; Alyssa D Cratty"}, {"title": "Squadbox: A tool to combat email harassment using friendsourced moderation", "journal": "", "year": "2018", "authors": "Kaitlin Mahar; Amy X Zhang; David Karger"}, {"title": "Feminist theory, embodiment, and the docile agent: Some refections on the Egyptian Islamic revival", "journal": "Cultural anthropology", "year": "2001", "authors": "Saba Mahmood"}, {"title": "#MeTooIndia: 54% rise in sexual harassment reported at workplaces between", "journal": "", "year": "2018", "authors": "C Mallapur;  Alphonso"}, {"title": "Being in the Social: A cross-cultural and cross-generational study on identity processes related to Facebook use", "journal": "Computers in Human Behavior", "year": "2018", "authors": "Claudia Manzi; Sharon Coen; Camillo Regalia; Ana Maria Yévenes; Cristina Giuliani; Vivian L Vignoles"}, {"title": "Detection of gan-generated fake images over social networks", "journal": "", "year": "2018", "authors": "Francesco Marra; Diego Gragnaniello; Davide Cozzolino; Luisa Verdoliva"}, {"title": "Assessing the attack threat due to IRC channels", "journal": "IEEE", "year": "2006", "authors": "Robert Meyer; Michel Cukier"}, {"title": "How We Can Help Women Come Forward", "journal": "Time", "year": "2017-10", "authors": "Alyssa Milano"}, {"title": "Critical perspectives on SlutWalks in India", "journal": "Feminist studies", "year": "2012", "authors": "Durba Mitra"}, {"title": "Understanding the Challenges for Bangladeshi Women to Participate in# MeToo Movement", "journal": "Proceedings of the ACM on Human-Computer Interaction", "year": "2020", "authors": "Aparna Moitra; Naeemul Hassan; Manash Kumar Mandal; Mansurul Bhuiyan; Syed Ishtiaque Ahmed"}, {"title": "Stories of transformative justice", "journal": "Canadian Scholars' Press", "year": "2000", "authors": "Ruth Morris"}, {"title": "Fareeda Nawaz, Kentaro Toyama, and Agha Ali Raza. 2020. Patriarchy, Maternal Health and Spiritual Healing: Designing Maternal Health Interventions in Pakistan", "journal": "", "year": "", "authors": "Maryam Mustafa; Amna Batool; Beenish Fatima"}, {"title": "Deep learning for deepfakes creation and detection", "journal": "", "year": "2019", "authors": "Thanh Thi Nguyen; M Cuong; Dung Tien Nguyen; Duc Thanh Nguyen; Saeid Nguyen;  Nahavandi"}, {"title": "Online sexual harassment over anonymous social media in Bangladesh", "journal": "", "year": "2019", "authors": " Fayika Farhat Nova; Pratyasha Md Rashidujjaman Rifat;  Saha"}, {"title": "Fake images spark fare-up of violence in West Bengal", "journal": "", "year": "2017", "authors": ""}, {"title": "Crime, in/security and mob justice: The micropolitics of sovereignty in Cameroon", "journal": "Social Dynamics", "year": "2014", "authors": "T E Rogers;  Orock"}, {"title": "One-step and two-step classifcation for abusive language detection on twitter", "journal": "", "year": "2017", "authors": "Ji Ho; Park ; Pascale Fung"}, {"title": "Cutting Chai, Jugaad, and Here Pheri: towards UbiComp for a global community", "journal": "Personal and Ubiquitous Computing", "year": "2011", "authors": "Nimmi Rangaswamy; Nithya Sambasivan"}, {"title": "I just want to feel safe\": A Diary Study of Safety Perceptions on Social Media", "journal": "", "year": "2019", "authors": "Jessica Elissa M Redmiles; Lindsay Bodford;  Blackwell"}, {"title": "Persuasive design: Fringes and foundations", "journal": "Springer", "year": "2006", "authors": "Johan Redström"}, {"title": "Pink Hijab Day: Mediation of the Hijab as a Symbol of Protest", "journal": "International Journal of Communication", "year": "2016", "authors": " Rebecca S Robinson"}, {"title": "Fragile Masculinity: Men, Gender, and Online Harassment", "journal": "", "year": "2020", "authors": "Lindsay Jennifer D Rubin; Terri D Blackwell;  Conley"}, {"title": "Announcing Facebook lite", "journal": "Facebook Newsroom", "year": "2015", "authors": "Vijay Shankar"}, {"title": "What Is Missing In the #MeToo Movement?", "journal": "Economic and Political Weekly", "year": "2018", "authors": "Ditilekha Sharma"}, {"title": "Histories of hating", "journal": "Social Media+ Society", "year": "2015", "authors": "Tamara Shepherd; Alison Harvey; Tim Jordan; Sam Srauy; Kate Miltner"}, {"title": "Me Too: Why are women sharing stories of sexual assault and how did it start?", "journal": "", "year": "2017", "authors": "Emily Shugerman"}, {"title": "Implication of 'innocent' people irks Ramu arson victims", "journal": "", "year": "2013", "authors": "Abu Siddique"}, {"title": "The national intimate partner and sexual violence survey: 2015 data brief-updated release", "journal": "", "year": "2018", "authors": "G Sharon; Xinjian Smith; Kathleen C Zhang; Melissa T Basile; Jing Merrick; Marcie-Jo Wang; Jieru Kresnow;  Chen"}, {"title": "SMARISA: a raspberry pi based smart ring for women safety using IoT", "journal": "IEEE", "year": "2018", "authors": "Priya Navya R Sogi;  Chatterjee; V Nethra;  Suma"}, {"title": "Working to Halt Online Abuse", "journal": "WHOA Comparison Statistics", "year": "2013", "authors": ""}, {"title": "Open coding. Basics of qualitative research: Grounded theory procedures and techniques 2", "journal": "", "year": "1990", "authors": "Anselm Strauss; Juliet Corbin"}, {"title": "Witchcraft and HCI: Morality, Modernity, and Postcolonial Computing in Rural Bangladesh", "journal": "ACM", "year": "2019", "authors": "Sharifa Sultana; Ahmed Syed Ishtiaque"}, {"title": "Design within a Patriarchal Society: Opportunities and Challenges in Designing for Rural Women in Bangladesh", "journal": "ACM", "year": "2018", "authors": "Sharifa Sultana; François Guimbretière; Phoebe Sengers; Nicola Dell"}, {"title": "Threats, abuses, firting, and blackmail: Gender inequity in social media voice forums", "journal": "", "year": "2019", "authors": "Aditya Vashistha; Abhinav Garg; Richard Anderson; Agha Ali Raza"}, {"title": "Luisa Verdoliva. 2020. Media forensics and deepfakes: an overview", "journal": "", "year": "2020", "authors": ""}, {"title": "SafetiPin: an innovative mobile app to collect data on women's safety in Indian cities", "journal": "Gender & Development", "year": "2015", "authors": "Kalpana Viswanath; Ashish Basu"}, {"title": "Identifying women's experiences with and strategies for mitigating negative efects of online harassment", "journal": "", "year": "2017", "authors": "Jessica Vitak; Kalyani Chadha; Linda Steiner; Zahra Ashktorab"}, {"title": "Images from Bangladesh falsely shared as 'Rohingyas attacking Hindus and Hindu temples in West Bengal", "journal": "", "year": "2020", "authors": "Rakesh Vuppu"}, {"title": "A Honeypot for Assholes: Inside Twitters 10-Year Failure to Stop Harassment", "journal": "BuzzFeed News", "year": "2016", "authors": "Charlie Warzel"}, {"title": "Twitter is still dismissing harassment reports and frustrating victims", "journal": "", "year": "2017-07-17", "authors": "Charlie Warzel"}, {"title": "Kübra Gümüşay, Muslim digital feminism and the politics of visuality in Germany", "journal": "Feminist Media Studies", "year": "2016", "authors": "M Beverly;  Weber"}, {"title": "Digital defense: Black feminists resist violence with hashtag activism. Feminist media studies", "journal": "", "year": "2015", "authors": "Sherri Williams"}, {"title": "# SayHerName: using digital activism to document violence against black women. Feminist media studies", "journal": "", "year": "2016", "authors": "Sherri Williams"}, {"title": "CrimeID: Towards Crime Prevention and Community Safety in Indonesia using Mobile and Web Technology", "journal": "International Journal of Interactive Mobile Technologies (iJIM)", "year": "2019", "authors": "Yohanes Sigit Purnomo; W P ; Theresia Devi Indriasari; Kusworo Anindito; Yoshua Andrean; Jaka Galih Prasetyo"}, {"title": "Ex machina: Personal attacks seen at scale", "journal": "", "year": "2017", "authors": "Ellery Wulczyn; Nithum Thain; Lucas Dixon"}, {"title": "Exploring women's everyday mobile phone experiences in Nairobi", "journal": "Kenya. Interacting with Computers", "year": "2017", "authors": "Susan Wyche"}, {"title": "Facebook is a luxury\" an exploratory study of social media use in rural Kenya", "journal": "", "year": "2013", "authors": "Sarita Yardi Susan P Wyche; Andrea Schoenebeck;  Forte"}, {"title": "Patriarchy and Social Media: Women Only Facebook Groups as Safe Spaces for Support Seeking in Pakistan", "journal": "", "year": "2020", "authors": "Fouzia Younas; Mustafa Naseem; Maryam Mustafa"}, {"title": "HarassMap: using crowdsourced data to map sexual harassment in Egypt", "journal": "Technology Innovation Management Review", "year": "2014", "authors": "Chelsea Young"}, {"title": "A survey on image tampering and its detection in real-world photos", "journal": "Journal of Visual Communication and Image Representation", "year": "2019", "authors": "Lilei Zheng; Ying Zhang;  Vrizlynn;  Thing"}], "figures": [{"figure_label": "1", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 1 :1Figure 1: (Left) Break down of the forms of harassment that female Facebook users face over the messenger inbox, (right) Relationship between the harassers and female victims in context of harassment over Facebook Messenger", "figure_data": ""}, {"figure_label": "2", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 2 :2Figure 2: Work-fow diagram of Unmochon application with three major components: plugin at the user-end, the server with end-to-end encryption, and the customized Facebook group.", "figure_data": ""}, {"figure_label": "3", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 3 :3Figure 3: Unmochon application takes a screenshot of Chrome tab that is currently open. It also copies the harasser's unique Facebook id from the address-bar. Before sending it to the database and posting to the dedicated Facebook page for Unmochon, the application window only allows the users to mark the photo with red ink. (All the purple geometric shapes in the fgure were post-edited for anonymization.)", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Details of Pre-Design Survey and Interview Demographic Characteristics of the Survey and Interview Participants computer browser. A total of 91 participants completed the survey. See table-1 for the age range and occupation of the participants.", "figure_data": "Total Number of Survey Responses: 91Age Range (in Years)OccupationSurvey18-25: 52 (57%) 26-35: 36 (40%)Student: 53 (58%) Public/private job-holder: 27 (29%)36-45: 2 (2%)Teacher: 5 (6%)46+: 1 (1%)Others: 6 (7%)Total Number of Interview Participants: 43 (Female:37, Male:6)Age Range (in Years)OccupationInterview18-25: 18 (42%) 26-35: 23 (53%)Public/private job-holder: 27 (63%) Student: 7 (16%)36-45: 2 (5%)Housewife: 3 (7%)46+: 0 (0%)Others: 6 (14%)"}, {"figure_label": "2", "figure_type": "table", "figure_id": "tab_1", "figure_caption": "Demographic Characteristics of Participants of Post-design User-Feedback advantage the authenticity of the evidence presented by the victim.", "figure_data": "Details of Post-Design User-EvaluationTotal Number of FGD Participant: 29 (Female:19, Male:10)Age Range (in Years)OccupationFGD18-25: 25 (86%) 26-35: 4 (14%)Public/private job-holder: 17 (59%) Student: 12 (41%)36+: 0 (0%)Others: 0 (0%)Total Number of Interview Participants: 19 (Female:13, Male:6)Age Range (in Years)OccupationInterview18-25: 6 (32%) 26-35: 11 (58%)Student: 6 (32%) Public/private job-holder: 13 (68%)36+: 2 (11%)Others: 0 (0%)"}], "doi": "10.1145/3411764.3445154"}