{"authors": "Carla F Griggio; Midas Nouwens; Joanna Mcgrenere; Wendy E Mackay", "pub_date": "", "title": "Augmenting Couples' Communication with Lifelines: Shared Timelines of Mixed Contextual Information", "abstract": "Couples exhibit special communication practices, but apps rarely offer couple-specific functionality. Research shows that sharing streams of contextual information (e.g. location, motion) helps couples coordinate and feel more connected. Most studies explored a single, ephemeral stream; we study how couples' communication changes when sharing multiple, persistent streams. We designed Lifelines, a mobile-app technology probe that visualizes up to six streams on a shared timeline: closeness to home, battery level, steps, media playing, texts and calls. A month-long study with nine couples showed that partners interpreted information mostly from individual streams, but also combined them for more nuanced interpretations. Persistent streams allowed missing data to become meaningful and provided new ways of understanding each other. Unexpected patterns from any stream can trigger calls and texts, whereas seeing expected data can replace direct communication, which may improve or disrupt established communication practices. We conclude with design implications for mediating awareness within couples.• Human-centered computing → Collaborative and social computing systems and tools; Empirical studies in collaborative and social computing.", "sections": [{"heading": "INTRODUCTION", "text": "Couples have special mediated communication practices: they find different ways of staying in continuous touch when apart [39,40], share intimate information with each other [50], and use an entire ecosystem of communication apps to support their different relational needs [18,41]. Scissors et al. [47] show how couples switch back and forth between diverse channels to strategically mediate conflicts. Cramer and Jacobs [18] describe how couples intentionally leverage specific characteristics of diverse apps to adapt to each other's routines or add meaning to their messages: one app can become the \"working hours\" channel and another the \"leisure\"; importance or urgency can be conveyed by sending the same message via multiple apps; and a minimalist Yo signal [3] can mean \"I'm thinking about you\".\nDespite these couple-specific communication practices and needs, they end up largely using the same technology as everyone else. While there is a wealth of different commercial communication apps they can choose from, these rarely offer functionality tailored to their special communication practices and intimate knowledge of each other. Communication as imagined by these technologies is two partners intentionally sending discrete (multimedia) messages back and forth, and a mediated relationship is represented as a vertical log of that data within a single app. HCI literature has explored a more expansive view of couple communication, providing partners with diverse types of data about each others' context when apart [23]. Researchers have mediated awareness by streaming different forms of contextual information, such as location [5], motion [9] or ambient sound [32]. By leveraging the knowledge couples have of their partner's routines, this minimal information helped them to find peace of mind, coordinate everyday tasks, increase feelings of connectedness, and support other relational needs [5,8,9,24,32,46].\nHowever, these studies are limited in that they have focused on a single stream of contextual information, exploring how one type of data could be valuable for couples' communication. Bentley and Metcalf [9] speculate that the fusion of multiple streams may provide value, by sparking conversations and providing richer awareness than any stream taken alone [9]. Secondly, most previous work supports awareness via ephemeral streams of contextual information, which communicate only live data. We speculate that persistent streams communicate richer information by revealing the duration and sequence of activities.\nWe built the technology probe Lifelines [25] to explore how couples integrate multiple, persistent streams of contextual information into their communication practices by giving them access to a peripheral visualization of behavioural data (e.g. steps or location) and device state (e.g. battery level, media playing). We deploy Lifelines in the wild to generate empirical results about changes in couples' communication behaviour and inspire the design of future communication apps beyond the homogeneous landscape currently available.\nWe first review the related work on mediated communication for couples and close relationships, we then present the design and development of the Lifelines probe, and lastly report on the insights from a one month field study with nine co-located couples. We conclude with directions for future research and implications for the design of future communication technologies for couples.", "n_publication_ref": 20, "n_figure_ref": 0}, {"heading": "RELATED WORK Couples' mediated communication practices", "text": "Previous work shows couples have idiosyncratic information sharing practices relative to other social relationships.\nCouples often share sensitive data with each other, for convenience and as a symbol of trust [36]. Among diverse social relationships, users are most willing to share their location data with their partners [17]. Research shows that couples share passwords [48], online accounts for entertainment and finance services [43], calendars to manage common responsibilities [38,50,51], and their location to coordinate everyday tasks [46]. While lack of openness and trust may lead to monitoring behaviours [35,52], couples that trust each other respect the need for privacy: having access to the other's data and devices does not imply its use [26].\nResearch also shows how couples hold parallel, mediated conversations on diverse topics [4], leave video-calls running in the background to feel each other's presence when apart [39,40], share devices [26] and accounts on social media [55], and repurpose emoji with their own meanings [54].\nTo better support couple-specific communication practices, researchers proposed designing technology for disclosing availability [18,39,50,51], supporting micro-coordination of everyday tasks [8,46], encouraging reflection on the relationship [55], and increasing connectedness by sharing awareness of their daily activities [39,40]. We discuss how sharing multiple, persistent streams of contextual information serves some of these design goals.", "n_publication_ref": 26, "n_figure_ref": 0}, {"heading": "Technologies for mediating awareness within couples and close relationships", "text": "Most commercial communication systems focus on the explicit and intentional exchange of messages. By sharing small, casual messages throughout the day [16,42], close relationships try to create a sense of connected presence [30]. However, this type of communication requires symmetrical engagement between partners, risking a loss of connected presence when one person is unable to respond [30]. Technologies that mediate awareness try to address this loss of connection and instead create \"a feeling of relatedness without direct communication\" [23] by implicitly sharing presence cues between partners (e.g. music playing or ambient sounds [32]): this supports connectedness even when one partner cannot communicate explicitly [30] or during \"empty moments\" [32], i.e. times when one partner is involved in a mundane activity, such as queuing or riding the bus and misses their partner's presence. Previous work explored diverse streams of contextual information for mediating awareness, e.g. location cues [5,12]; travel time to a contact's location [8]; drinking moments through a connected cup [15]; playing music [7,32]; ambient sounds [32]; appointments in a calendar [49], in-chat heart rate visualizations [24]; and motion in front of a camera [44,45] or between locations [9].\nAll studies focus on how single streams are used by couples to support their relational needs. For example, location [5], motion (\"moving\", \"not moving\") [9], playing music [7], and heart rate information [24] correlate with increased feelings of connectedness, provide peace of mind (i.e., knowing that their partners were safe and sound), and signal availability. Heart rate [24] and music [7] also spark conversations about partners' contexts. At the same time, other studies suggest that location and motion cues reduce direct communication, because partners consult the shared data rather than calling or texting about micro-coordination, i.e. \"the exchange of information that allows for the on-going but mundane maintenance of everyday life\" [31].\nMost of the above research explores ephemeral streams, as do most commercial applications that share live location information (e.g. Life360, Couple and FindMyFriends). Hassib et al. [24] compared both ephemeral and persistent modes of sharing heart rate information within text conversations and described how most participants preferred and felt more connected in the persistent mode. Buschek et al. [14] proposed a design space for context-augmented chat systems. Their literature review shows that previous work focused on persisting sporadic sharing of contextual information (e.g. attaching context information to a sent message), and that continuous sharing (i.e. streams of contextual information) has only been explored in its ephemeral form.\nIn summary, previous studies show how couples can benefit from sharing single, ephemeral streams of contextual information. We explore more comprehensive ways of communicating context with multiple, persistent streams. Additionally, most research focuses on long-distance relationships [10], and few offer empirical results from longitudinal field studies [23]. We study co-located couples, and provide data from a month of use in realistic and everyday settings.", "n_publication_ref": 31, "n_figure_ref": 0}, {"heading": "THE LIFELINES TECHNOLOGY PROBE", "text": "The Lifelines technology probe is a mobile app that captures and shares six streams of data: battery, home, media, steps, sms and calls between the couple. Each partner's personal lifeline shows the last hour of data as a colorful visualization banner. Lifelines appear as a peripheral display: either in Android's notification drawer (Figure 1) or the iPhone's widgets screen. Each partner can choose which streams to share and customize its visualization.\nAs a technology probe, Lifelines is intended as an initial draft of a new technology that is embedded into users' real-world context for the purpose of studying behavioural changes, as well as inspiring design ideas for future technologies [25]. While the technology is important, its specific design is not central. The purpose of studying its use by people is not to evaluate the technology as a final product, but to probe how these kinds of designs could be valuable, provocative, or contentious for users.", "n_publication_ref": 1, "n_figure_ref": 1}, {"heading": "Multiple streams of contextual information", "text": "We included six streams in Lifelines to help us observe how couples obtain context cues from multiple streams that share diverse aspects of their routines. As described in Figure 2: home and steps communicate different nuances of physical activity and displacement, potentially signaling key moments of partners' routines (e.g. leaving for work, lunch breaks or errands); battery shows the power status of the device and may help partners explain missed calls or reveal traces of phone usage habits; media shows any sound activity and reveals diverse activities and habits such as listening to music, watching videos, or alarms; and calls and sms visualize traces of past direct communication that may help contextualize the other streams. We selected these streams based on two criteria: a) the data should help users infer their partner's actions and phone status; and b) the data should be easy to capture on both iPhone and Android phones.\nA lifeline visualizes all streams as a stack of layers (Figure 3) to meet three design goals: a) to show multiple streams in a compact way rather than allocating space for each; b) to help partners infer context from multiple streams simultaneously as well as from individual streams; and c) to allow partners to toggle streams on and off without hurting the aesthetics of the visualization.\nTwo authors pilot-tested these six streams with each other for approximately a month. They consistently recognized key aspects of each other's routines (e.g. playing a game, commuting patterns) and even detected unexpected incidents (e.g. missing an important train). We also pilot tested a signal strength stream, expecting it would provide location and availability cues (e.g. poor reception in the subway). However, we found it too erratic to inform context.", "n_publication_ref": 0, "n_figure_ref": 2}, {"heading": "Persistent streams of contextual information", "text": "Lifelines persists all streams in a visual timeline (Figure 3). Every three minutes, it takes a snapshot of home, battery, steps and media and adds a new 3-minute segment to the user's lifeline. sms and calls are captured as soon as they happen. Sensing data every three minutes not only helps reduce Lifelines' battery consumption, but also requires abstracting and aggregating data. This adds ambiguity to the visualization [22], encouraging users to interpret their partner's lifeline based on their knowledge of each other while also giving them plausible deniability. The Lifelines peripheral display shows the last hour of data, and tapping on it opens the associated Lifeline app where the users can scroll back in time up to 18 hours (24 hours significantly reduced the performance of the app and slowed down the phone). Users can customize all colors and textures. Data from home, battery, steps, and media is aggregated and added to the lifeline every 3 minutes. Data from sms and calls is added when they occur.\nFigure 3: A lifeline example. A user texts her partner at the bus stop (sms: zig zag). She plays a game (media: pink waves) which drains her battery (battery: thinning cross hatch). She calls her partner (calls: yellow bar) when she gets off the bus and starts walking (steps: red diagonal lines). To save power, she disables her location (home: blue solid disappears).", "n_publication_ref": 1, "n_figure_ref": 2}, {"heading": "Peripheral awareness of contextual information", "text": "We designed Lifelines to add novel couple-specific capabilities to couples' existing apps.Lifelines appears as a peripheral display to serve two purposes: a) to be explicitly used in conjunction with any communication app; and b) to allow for serendipity with peripheral awareness of each other's context, i.e. partners may glance at Lifelines accidentally.\nLifelines appears as a sticky notification in the notification drawer of Android phones that cannot be dismissed (Figure 1). Because the notification drawer overlays other apps, Lifelines can be peeked at while doing something else rather than requiring the user to switch apps. As with any other notification, users can choose to show Lifelines in their lock screen as well. iPhone users access Lifelines as a widget by swiping left from the home or notification screen.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Customizing with Linebuilder", "text": "We included a Linebuilder (Figure 4) that allows users to toggle which streams they share with their partner and to customize their textures and colors. The customizations are persistent, i.e. when a lifeline design changes it only affects the data shared from that moment on. We included these options because we expect partners to have different, asymmetrical sharing preferences depending on what data is relevant for their relationship and what privacy needs they have, as well as allowing the visual appearance of the lifeline to become another potential channel of communication.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Implementation", "text": "We took advantage of Automate [2], an app which lets users create automation flowcharts and connects to many of the phone's sensors. This greatly facilitated sensor data capture across many Android versions. We collected iPhone data via the custom-built native Lifelines app, but were unable to capture calls and sms because iOS prohibits third-party apps from accessing this data. This forced us to exclude same-OS couples using iOS. As long as one partner had an Android phone, we could register both incoming and outgoing SMS messages and calls, and use the Android phone's 'incoming' data to visualize the 'outgoing' data from the iOS phone.\nLifelines sends context data from each phone to a Node.js server that generates each lifeline on demand: when opening the Lifelines app, when accessing the Lifelines iPhone widget, or when Automate updates Lifelines' Android notification.  ", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "METHOD Participants", "text": "We recruited 9 co-located couples (9 women, 9 men, aged 22-43) via social media (Facebook, Twitter, Reddit), mailing lists, and word of mouth (Table 1). The recruitment message showed an image of two annotated lifelines for Sam and Jamie (gender-neutral names), similar to Fig. 3, and stated that partners could decide what to share with each other and how the data would look. The message also stated that partners should live in the same city and that participants would received no compensation, although Android users could keep the premium version of Automate after the study. Participants communicated via WhatsApp, Skype, WeChat, Telegram, Snapchat, Facebook Messenger, Google Hangouts, Twitter, and Email, and all but one couple stated that they rarely use SMS and phone calls. Three couples used apps we did not anticipate: Couple, a couple-specific app; Zenly, for sharing live location and battery level with contacts; and Strava, for tracking and sharing running and cycling activities. All couples used more than one app to communicate.", "n_publication_ref": 0, "n_figure_ref": 1}, {"heading": "Procedure", "text": "The study consists of four parts over a one-month period.\nPre-study configuration. We ask participants to read and sign an informed consent form that describes the type of information collected and informs them of their rights. We collect their phone number and home address via a digital questionnaire to configure the sms, calls, and home streams and create their user accounts on the Lifelines server. Finally, we send them email invitations to download and install the probe, including a description of the functionality of Lifelines.\nSetup and three-day training. We help the participants install Lifelines on their phones, either in person or via teleconference depending on their preference or location. We ask the participants to explore how Lifelines works by going into the Linebuilder (which shows dummy data), toggle data streams, and choose the patterns and color palettes they like. Once satisfied, they save the design and look at their actual lifeline (with the data captured between installation and configuration) in the notification or widget. We ask them to perform actions that trigger a response on the lifeline (e.g., walking, playing media, calling or texting their partner) so they get a sense of how the app works. They fill out a second questionnaire about their current communication apps and devices. After the setup, the participants enter the three day training period in which they only see their own lifeline, so they can learn how to read the visualization and reflect on which data streams they want to share or hide.\nWeek One: Shared Lifelines. We send participants an email explaining that they will now see their partner's lifeline in addition to their own. We also remind them that they can customize their lifeline at any time. At the end of the week we interview each partner individually for 30-45 minutes by teleconference. We prompt them for specific detailed stories of what happened using Mackay's [33] variation of the critical incident technique [19]. We link them to a webpage with a view of both their lifelines from the past week to support recall of interesting moments (this page is only available during the interview). We ask the participants to share their screen so we can see how they point at particular areas of their historical lifelines as they describe specific situations. We ask about their favorite, least favorite, or most surprising episodes with Lifelines. We probe for moments where Lifelines affected their (mediated) communication, their favorite and least favorite stream to share and to see from their partners, and motivations behind changes in the customization of their lifelines. We use changes in their lifeline designs, technology breakdowns, and toggling of data streams as moments of interest, around which we ask them to explain why something was significant, why they made that decision, or how it affected their communication with their partners.\nWeeks Two and Three: Shared Lifelines. Partners continue to share their lifelines for two more weeks. At the end of Week Three, we interview each partner individually (similar to Week One) and probe for additional stories about their experiences with Lifelines. Then, they uninstall Lifelines.\nWeek Four: Post Lifelines. We ask participants to complete a questionnaire one week after they stopped using Lifelines.\nWe ask them what they miss, if anything, and whether or not they would like to continue using Lifelines.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "Data collection", "text": "We logged all the information that Lifelines uses to construct the display: GPS coordinates, number of steps, battery level, whether media is playing or not, and the timestamp of sent SMS and outgoing calls to the participant's partner, and Linebuilder changes by each partner. We are unable to report on how often participants looked at their lifelines, as we cannot distinguish between opening the notifications drawer or widgets screen to check Lifelines or for a different purpose (e.g. reading an incoming SMS or checking the weather). We also collected questionnaires and interview data, and audio and screen-recorded teleconference interviews.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Analysis", "text": "We coded approximately 22 hours of video from 34 recorded interviews, resulting in 368 salient interview excerpts. We conducted four interviews per couple, except for one couple who only did the second interview because of time limitations. Three participants preferred conducting their interviews in Spanish, and we translated their interview excerpts to English. One author anonymized all data using participant pseudonyms, and performed open coding on the first batch of 12 interviews. A second author received the transcribed interview excerpts and the codes separately, and re-coded the data. The few disagreements in the re-coded data were discussed and incorporated into the analysis, producing 89 codes in total. The first author coded 16 additional interviews. The full research team read over the full set of interview excerpts and codes, and they were discussed over multiple meetings. After several iterations, we agreed on the latent themes [11,13] presented in the section below. The remaining six interviews (2 from each of 3 couples) provided additional examples of the established themes.", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "RESULTS AND DISCUSSION", "text": "All participants shared all streams, all of the time, with four exceptions: (1) Dory and John turned their location services off on Week Two after agreeing that home was not worth the extra battery consumption. (2) Carl disabled his location services on a work trip because Lifelines stopped showing his home and forgot to turn it back on when returning home.\n(3) Barry disabled media and steps with Linebuilder at the beginning of Week One because he felt he was disclosing \"too much information\"; however, he soon decided to turn them back on, speculating that they might help coordinating pick-ups. (4) Hugo disabled home with Linebuilder for a few hours, suspecting it was harming the communication in the couple (we revisit this story later on).\nNext, we present the most salient findings on how sharing multiple, persistent streams of contextual information affected couples' communication dynamics.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Inferring context from single vs. combined streams", "text": "Participants leveraged the multiplicity of data streams in two ways. First, by having access to diverse types of information they could choose the most appropriate data to look at when trying to answer a question or satisfy their curiosity. For example, Inez looked for isolated steps to call her partner while he was on a break at work, and whenever she saw traces from his media stream she asked him how he was liking his audiobook. Knowing which data stream was most appropriate to look at and being able to connect it to a very particular activity-steps with a work break or media with listening to an audiobook-was possible due to the intimate knowledge Inez had about her partner's routines.\nSecond, having access to multiple streams allowed participants to combine information and reveal more detail about their partners' context. While this happened only rarely (most of the stories centred around a single stream), the cases in which happened show how participants layered streams to distinguish between activities. For Hugo, if his partner's media was playing while home was changing, it meant she was driving, but if home looked dark and was not changing, it meant she was watching videos from social media at home. Mona differentiated long traces of steps depending on whether her partner was close or far from home: if far, it meant he was on the university campus, if close, it meant he was walking the dogs around the block.\nSharing multiple streams of contextual information allowed partners to infer diverse activities throughout the day by looking at individual streams, and to disambiguate the meaning of a stream by combining it with others.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Triggering vs. replacing direct communication", "text": "Single-stream studies describe how sharing some types of data replaced direct communication (e.g. knowing the partner's location replaced asking \"where are you?' [5,46]), whereas other types of data triggered direct communication (e.g. heart rate triggered \"what are you doing?\" [24]). We observed a different dynamic, where replacing and triggering communication did not depend on the type of data shared, but whether a stream confirms or challenges a partner's knowledge of the other.\nWhen a stream shows data that challenges partners' knowledge of each other, it sparks curiosity and triggers direct communication. Surprising data often exposed previously undiscussed topics, stimulating partners' relationships with novel information about their habits and interests: John asked his partner about her steps at home and learned more about her daily routines. He was happily surprised when she asked about his media use: \"She saw on my lifeline that I was playing media a lot, and she asked me what it was. And it was because I had installed one of those farming games. And then she installed it, and now we're both playing. (...) The game created a new bond. So now we have this new conversation topic\". Inez used steps and media as conversation starters: \"I can ask him \"Where are you? What are you doing? I can see that you're walking\". So it did improve the communication because I have these small hints\". Similarly but inverted, the surprising absence of calls and sms triggered participants to reach out to one another: \"You look at the lifeline and you say 'oh, there are no calls, no messages' and that encourages you to text him or call him\" Dory.\nWhen a stream shows data that confirms partners' knowledge or expectations of the other, it replaces the need for direct communication, in particular common check-in moments such as asking whether the other was safe, determining their availability, and managing micro-coordination. For example, Hugo knew his partner listened to music while driving, so he checked her home and media to see whether she arrived home safely. Rick used his partners' home stream (Figure 5) to estimate when he should have dinner ready: \"I remembered her closeness to home started to show about 50km from home, so I know that means she'll arrive home in about an hour. I decided to order outside. So I estimated when she would be arriving (...) and actually she was at the door with the delivery guy. I didn't check with a message because she was driving, she wouldn't be able to answer\".\nOur evidence shows that the value of each stream is highly subjective, depending on each couple's routines, needs and knowledge of each other. Thus, whether a stream triggered or replaced communication did not depend on the type of data that was being shared, but on the value of the information for the participant. For example, Dory used media to ask her partner about surprising patterns (trigger), but Kelly used it to implicitly coordinate pick-ups (replace). That relative connection between each stream and the way a participant used it settled into stable new communication dynamics: they would frequently use some streams to trigger and others to replace direct communication.", "n_publication_ref": 3, "n_figure_ref": 1}, {"heading": "Consequences of new communication dynamics. Previous work", "text": "extensively discussed how sharing contextual information supports micro-coordination without direct communication (e.g. [9]) and how it helps increase feelings of connectedness and reassurance between partners (e.g. [5,24], see review in [23]). While our results largely echo the literature, an exception stood out: Hugo felt less connected to his partner because he missed her \"checking on you\" messages: \"just by sending a message, it was a closer act than checking the app without talking to other\". This prompted Hugo to hypothesize that \"home is the most significant factor that takes place instead of sending a message\", so he turned it off as a test (Figure 6). Hugo's partner noticed his home was missing and felt he was hiding something. asked about this change, and Hugo explained that he turned his GPS off \"to save battery\"-since disabling the GPS and turning off home result in the same visualization, Lifelines offered Hugo plausibile deniability in this situation [29].\nThis story emphasizes that, when sharing contextual information, the shared streams must attain the right balance between triggering and replacing direct communication within the couple, otherwise, partners may feel more distant rather than more connected. In such cases, couples may require explicit discussions to agree on new codes of conduct around their new communication dynamics: I think we're in this transition of learning how to use the app and what is \"polite\" in a way. (...) Maybe using it longer I would learn how to use it properly, or rather just send a message instead of just waiting to receive a message (Hugo).", "n_publication_ref": 5, "n_figure_ref": 1}, {"heading": "Persistent streams inspire deeper understanding", "text": "Persistent streams of usage and phone state data allowed participants to augment ongoing conversations. For example, using recent information from their partner's lifeline gave them a richer picture of the situation (Figure 7): \"She was getting a bit drunk and dancing and having fun with her group mates. And there were some funny messages between us. And while that was happening you could see all these steps counting as she was dancing. And that was amusing \" (Owen).\nAdditionally, using information of the more distant past allowed participants to understand their partner from a different perspective: \"I saw on the app that he listened to something until like 3 AM, so I was like \"oh, you didn't sleep very well, did you?\" because I had all the information on the app. Otherwise I wouldn't have known, or I wouldn't have been as patient with him. So, this helped manage my expectations \" (Inez). Some participants, after seeing persisted histories of unexpected activity, suddenly questioned how well they knew each other: Sometimes you think the other one isn't doing anything. In my case, I leave at 9 and I come back at 6. I left and came back and it's like she's been there the whole day. Instead if I look at the steps I realize that she's been doing house chores, going out. It's just a detail, but it changes your perspective (John).\nThe above examples illustrate the added value of persisting contextual data, adding temporality and sequentiality as an extra layer of information that enhanced partner's shared understanding of each other.  ", "n_publication_ref": 1, "n_figure_ref": 1}, {"heading": "Persistent streams inform context through patterns of missing data", "text": "Persistent streams of data also allowed gaps in the stream to become meaningful. Participants perceived the lack of data as yet another type of contextual information that informed them about: 1) their partners' phone usage habits, and 2) the materiality of the technological infrastructure around them.\nPartners interpreted missing data based on their knowledge of phone usage habits. Some Android versions prevented Lifelines from sensing and transmitting data when the phone had been unplugged and stationary for a period of time [1]. Partners came up with their own explanations for these technological glitches. In Barry's case, he treated the absence of glitches as a signal that his partner was actively using the phone (Figure 8):\nYou can see that there are many gaps, but when she's using the phone, she's connected to Wi-Fi and you can see the full line. So I know when that's happening and... she's fine, she's using the phone, she has some peace time with the children not doing anything strange, or not running to the hospital or something like that. (Barry) Participants also knew how the technological infrastructure surrounding their partners affected Lifelines' data streaming. For example, Dory knew her partner always lost reception in the area around his office: \"When I see a gap on his lifeline, I know he arrived at work\". Barry reported that the Internet connection often stops working in his office, but his phone remains connected to the Wi-Fi network. When this happens, he misses his partner's Whatsapp messages. He explained that because Lifelines also stops streaming data when this happens, his partner can easily figure out why he is not replying.", "n_publication_ref": 1, "n_figure_ref": 1}, {"heading": "Customizing streams to express identity and care", "text": "Participants were able to express their identity and care for their partner in new ways through customizing the aesthetics of their lifeline. All participants customized their lifelines during the training period, and half customized them again at least once during the study. All lifeline designs were unique across the study, and some participants even asked for more color options and the possibility of adding their own texture designs. Customizability allowed the lifeline to reflect the personality and needs of the participant. For example, Kelly proudly explained that her partner was using his favorite soccer team colors. Nina changed her design to help her \"spot new surprising things\" about her own routines. Some participants customized to show caring: Lucy and her partner decided on a design as a couple using the same palette but inverting which color went with which stream. Others did it by themselves, but with their partner in mind: Owen adapted his lifeline design to match the textures of his partner's, so she would understand his better. Three participants changed their design simply because their partners changed it first.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "Individual differences in privacy preferences", "text": "Technologies for sharing contextual awareness raise privacy concerns, and our study provides further evidence that there are substantial individual differences in this area [53] . On the one hand, we had difficulty recruiting participants, with some candidates explicitly saying the idea was \"creepy\". On the other hand, the people that did participate raised no overarching significant privacy concerns, and some wanted to share even more diverse data.\nOpposite to concerns about monitoring behaviour in the literature [5,9,24,34], we found that our participants were generally quite open with each other. A few participants showed concerns about their privacy regarding us-the research team-rather than their partners. Pete explained: \"I was just concerned about the server and whether that information was stored somewhere... but not about her\".\nOur participants wanted their partners to use Lifelines, e.g., to replace asking where they were or what they were doing, which echos findings by Schildt et al. [46]. We also found that participants expected their partners to look at their lifelines as an expression of caring: Mona and John felt reassured by thinking that if anything bad happened to them while commuting, their partners would know. Lucy even felt disappointed at her partner because he checked Lifelines less often than her. The most contrasting example to concerns about monitoring behaviour was a participant that shared her information for her partner's sake, having no interest in his data: \"I rarely look at the phone. So for me, Lifelines doesn't add too much value. But I think it's valuable for him. If I arrive too late, he gets worried, he texts me and I don't even look at the phone. So this gives him information about whether I'm still in class, or if I'm heading home\" (Nina).\nWe did find individual differences in privacy concerns around specific individual streams. For example, many suggested unpacking media into more revealing streams: \"Right now media doesn't show exactly what I'm doing. I want to show him if I'm chilling, relaxing, watching Youtube videos or Spotify\" (Amy). On the other hand, others felt that media was, at times, too revealing, e.g. Owen felt embarrassed on a day he overslept, as media revealed an alarm snoozing pattern. Similarly, Mona explained that while commuting, she would appreciate sharing her exact location to feel safer, in case something bad happened. In contrast, Eva felt that the home stream exposed too much information, preventing her from surprising her partner by arriving home early or meeting him at a restaurant. These individual differences expose deeply personal preferences about how revealing or discreet each stream should be, which can be context dependent [6].\nWestin [28] studied trends in individual differences around privacy needs and classified people as (1) Fundamentalists, (2) Pragmatists, and (3) Unconcerned. While these categories refer to concerns towards companies collecting personal data, we find them helpful to describe the trends in privacy needs in our data as well. We suspect that our participants were largely from the unconcerned category. For example, Fay and her partner shared their exact location and battery level with Zenly in addition to using Lifelines. Some participants fit better in the pragmatists category. For example, Barry had concerns about media and steps, but decided to share them to show his commute patterns. Fundamentalists are probably less likely to want to share any contextual information with their partners. Some of the people who chose not to participate in our study are almost surely from this category.", "n_publication_ref": 8, "n_figure_ref": 0}, {"heading": "Post Lifelines", "text": "One week after interrupting the use of Lifelines, participants answered questions about the data they missed sharing. Fifteen reported missing at least two streams. Another two missed only one (home and battery). Some participants explained how they compensated for the absence of Lifelines: Barry checked the \"last seen\" status of his partner's Whatsapp more often to see if she was busy with the kids or using the phone; Rick mentioned he really needed to ask \"Where are you?\" or \"Are you at home?\" before anything else; and Lucy considered sharing her location via Facebook Messenger for the first time. Barry also started to share his location via Google Maps while on the train, so he could relax instead of coordinating the pick-up, implying: \"here, you check where I am\". Google Maps recently added battery level information when users share their location. As a result, Barry excitedly reached out to us to say how happy he was to have this functionality again after months without Lifelines. also asked whether participants wanted to keep using Lifelines: Four couples did, three couples did not, and two disagreed (see \"Keep Lifelines?\" in Table 1). The main reason mentioned for answering \"No\" was the battery drain and slower phone performance caused by the probe. Some said they knew each other well enough to find the Lifelines data useful. One participant felt uncomfortable because they saw it as \"surveilling\" their partner. Nevertheless, half of those answering \"No\" still missed some aspects of Lifelines: Owen missed seeing steps because it felt intimate. Inez especially missed media for texting \"hey, what are you listening to?\".", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "LIMITATIONS", "text": "Our longitudinal field study provided grounded data from couples over a one-month period, which mitigated novelty effects, and captured stories from diverse life circumstances. While our sample of 9 couples does capture diverse cultures, representing different parts of Europe, North and Latin America, and Asia, it does have limitations. All our couples are middle-class and heterosexual. Perhaps most importantly, participants were self-selected, so they all had at least a degree of comfort sharing contextual data with their partners from the outset. Lifelines is not intended for all couples-it is a technology probe for studying how multiple, persistent streams affect the communication dynamics of couples that feel comfortable sharing contextual data. Designers and researchers should be aware it is likely that our sample-and thus our results-are biased in favour of people who have little privacy concerns and thus were happy to participate. While our data lacks examples of deliberate misuse, future work should consider how to mitigate the potential abuse of context data in cases of intimate partner violence [20,21]. Since mitigating digital abuse via privacy settings may trigger other forms violence [37], context-data sharing technologies may have to restrict their streams to ambiguous representations that support plausible deniability.", "n_publication_ref": 3, "n_figure_ref": 0}, {"heading": "IMPLICATIONS FOR DESIGN Multiple streams", "text": "Inspirations to try new streams that challenge or confirm partners' knowledge each other. Encouraging partners to try new streams may help them discover data they had not anticipated to be useful. For example, a random stream of the week may help partners spark conversations and discover new things about each other, or recognize expected patterns of their routines that replace the need for frequent coordination and reassurance questions. Rotating through new streams periodically can also help maintaining partners' interest in each other's data, as they may find less surprises from the same streams over time. Exploring new streams may help couples such as Hugo and Mona, where the selections of streams they shared failed to balance the convenience of skipping frequent questions with the closer act of sparking conversations throughout the day.\nIntegration of communication apps with mediated awareness channels. Communication apps could offer their own streams to integrate in mediated awareness channels, e.g. timestamps of audio messages from Whatsapp or snaps from Snapchat. Some participants regretted that Lifelines showed no traces of their communication via apps, but no couple \"moved out\" from their usual communication places [41] to use sms and calls instead. This highlights the importance of integrating rather than competing with existing apps.", "n_publication_ref": 1, "n_figure_ref": 0}, {"heading": "Persistent streams", "text": "Discreet changes to privacy preferences. When persisting data over time, gaps in the data stream convey technology-related issues (e.g. no reception), but also potential changes in a partner's privacy settings (e.g. toggling home off). Rather than turning individual streams off, designers could offer alternative ways of preserving partners privacy, e.g. entering into \"incognito mode\" to hide all streams temporarily as if there was no reception. As a different approach, visualizations of contextual information could mix persistent and ephemeral streams, allowing users to choose ephemeral representations for the streams they expect to toggle more often.\nExplicit expressions of caring. Most participants expected their partners to look at their lifelines as an expression of caring, pointing to an opportunity for letting partners explicitly indicate that they looked at each other's data. For example, some suggested leaving minimalist marks [27,44] or caring messages on a particular moment of their partner's past data. Other ideas revolved around saving fragments of their lifelines as \"digital souvenirs\" of nice moments together, capturing \"a different perspective than a photo\" (Owen).", "n_publication_ref": 2, "n_figure_ref": 0}, {"heading": "CONCLUSION & FUTURE WORK", "text": "We explored how sharing multiple, persistent streams of contextual information affects couples' communication dynamics. We presented Lifelines, a technology probe that shares up to six persistent streams of contextual data in a peripheral display within a smartphone, allowing each partner to choose among home, battery, media, steps, sms and calls.\nIn a one-month field study with nine couples, we found that partners used the multiplicity of streams to infer diverse activities from their lifelines by looking at individual streams throughout the day, or by combining streams together to obtain more precise meaning. We also observed that, regardless the type of data shared, streams that challenged a partner's knowledge of the other triggered direct communication, and streams that confirmed a partner's knowledge of the other replaced direct communication. This introduced new communication dynamics that most leveraged to coordinate tasks implicitly, find reassurance, and feel more connected. We also found that a poor balance between triggering and replacing direct communication can lead to feeling more distant rather than more connected. Sharing persistent streams revealed patterns of missing data, from which partners obtained extra contextual information. Accessing past data also helped partners be more understanding with each other.\nWe encourage further research on combining streams of alternative types of data, mixing persistent and ephemeral representations, and helping partners find the right selection streams that balances their needs for triggering and replacing direct communication over time.", "n_publication_ref": 0, "n_figure_ref": 0}, {"heading": "ACKNOWLEDGMENTS", "text": "This work was partially supported by European Research Council (ERC) grant n°321135 CREATIV: Creating Co-Adaptive Human-Computer Partnerships. We thank Germán Leiva for the implementation of Lifelines for iOS and Lucien Bobo for his early design contributions to the Linebuilder. We also thank John Maccallum, Andrew Webb, Philip Tchernavskij and Ignacio Avellino for insightful discussions that greatly improved the paper. Last but not least, we thank all participants for the time they generously invested in our study and their enlightening comments.", "n_publication_ref": 0, "n_figure_ref": 0}], "references": [{"title": "Android Developers: Optimize for Doze and App Standby", "journal": "", "year": "", "authors": ""}, {"title": "Multi-Channel Topic-Based Mobile Messaging in Romantic Relationships", "journal": "Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article", "year": "2017-12", "authors": "Nazanin Andalibi; Frank Bentley; Katie Quehl"}, {"title": "CoupleVIBE: Mobile Implicit Communication to Improve Awareness for (Longdistance) Couples", "journal": "ACM", "year": "2011", "authors": "Elizabeth Bales; Kevin A Li; William Griwsold"}, {"title": "The mismeasurement of privacy: using contextual integrity to reconsider privacy in HCI", "journal": "ACM", "year": "2012", "authors": "Louise Barkhuus"}, {"title": "The use of mobile social presence", "journal": "IEEE Pervasive Computing", "year": "2009", "authors": "Frank Bentley; Crysta J Metcalf"}, {"title": "Reducing the Stress of Coordination: Sharing Travel Time Information Between Contacts on Mobile Phones", "journal": "ACM", "year": "2015", "authors": "R Frank; Ying-Yu Bentley; Christian Chen;  Holz"}, {"title": "Sharing Motion Information with Close Family and Friends", "journal": "ACM", "year": "2007", "authors": "R Frank; Crysta J Bentley;  Metcalf"}, {"title": "Expanding the Design Space for Intimacy: Supporting Mutual Reflection for Local Partners", "journal": "ACM", "year": "2012", "authors": "M Stacy; Steve H Branham; Tad Harrison;  Hirsch"}, {"title": "Using thematic analysis in psychology", "journal": "Qualitative research in psychology", "year": "2006", "authors": "Virginia Braun; Victoria Clarke"}, {"title": "Locating Family Values: A Field Trial of the Whereabouts Clock", "journal": "Springer-Verlag", "year": "2007", "authors": "Barry Brown; Alex S Taylor; Shahram Izadi; Abigail Sellen; Joseph 'jofish' Kaye; Rachel Eardley"}, {"title": "Examining the Use of Thematic Analysis As a Tool for Informing Design of New Family Communication Technologies", "journal": "British Computer Society", "year": "2013", "authors": "Nela Brown; Tony Stockman"}, {"title": "Personal Mobile Messaging in Context: Chat Augmentations for Expressiveness and Awareness", "journal": "ACM Trans. Comput.-Hum. Interact", "year": "2018-08", "authors": "Daniel Buschek; Mariam Hassib; Florian Alt"}, {"title": "Lover's Cups: Drinking Interfaces As New Communication Channels", "journal": "ACM", "year": "2006", "authors": "Hyemin Chung; Chia-Hsun Jackie Lee; Ted Selker"}, {"title": "What's Up with Whatsapp?: Comparing Mobile Instant Messaging Behaviors with Traditional SMS", "journal": "ACM", "year": "2013", "authors": "Karen Church; Rodrigo De Oliveira"}, {"title": "Location Disclosure to Social Relations: Why, when, & What People Want to Share", "journal": "ACM", "year": "2005", "authors": "Sunny Consolvo; Ian E Smith; Tara Matthews; Anthony Lamarca; Jason Tabert; Pauline Powledge"}, {"title": "Couples' Communication Channels: What, When & Why?", "journal": "ACM", "year": "2015", "authors": "Henriette Cramer; Maia L Jacobs"}, {"title": "The critical incident technique", "journal": "Psychological bulletin", "year": "1954", "authors": "C John;  Flanagan"}, {"title": "âĂĲA Stalker's ParadiseâĂİ: How Intimate Partner Abusers Exploit Technology", "journal": "ACM", "year": "2018", "authors": "Diana Freed; Jackeline Palmer; Diana Minchala; Karen Levy; Thomas Ristenpart; Nicola Dell"}, {"title": "Digital technologies and intimate partner violence: A qualitative analysis with multiple stakeholders", "journal": "Proceedings of the ACM on Human-Computer Interaction", "year": "2017", "authors": "Diana Freed; Jackeline Palmer; Diana Elizabeth Minchala; Karen Levy; Thomas Ristenpart; Nicola Dell"}, {"title": "Ambiguity As a Resource for Design", "journal": "ACM", "year": "2003", "authors": "William W Gaver; Jacob Beaver; Steve Benford"}, {"title": "All You Need is Love: Current Strategies of Mediating Intimate Relationships Through Technology", "journal": "ACM", "year": "2012", "authors": "Marc Hassenzahl; Stephanie Heidecker; Kai Eckoldt; Sarah Diefenbach; Uwe Hillmann"}, {"title": "19, 4, Article 30", "journal": "Comput.-Hum. Interact", "year": "2012-12", "authors": ""}, {"title": "HeartChat: Heart Rate Augmented Mobile Chat to Support Empathy and Awareness", "journal": "ACM", "year": "2017", "authors": "Mariam Hassib; Daniel Buschek; W Pawel; Florian Wozniak;  Alt"}, {"title": "Technology Probes: Inspiring Design for and with Families", "journal": "ACM", "year": "2003", "authors": "Hilary Hutchinson; Wendy Mackay; Bo Westerlund; Benjamin B Bederson; Allison Druin; Catherine Plaisant; Michel Beaudouin-Lafon; Stéphane Conversy; Helen Evans; Heiko Hansen; Nicolas Roussel; Björn Eiderbäck"}, {"title": "Caring About Sharing: Couples' Practices in Single User Device Access", "journal": "ACM", "year": "2016", "authors": "Maia Jacobs; Henriette Cramer; Louise Barkhuus"}, {"title": "I Just Clicked to Say I Love You: Rich Evaluations of Minimal Communication", "journal": "ACM", "year": "2006", "authors": "Joseph 'jofish' Kaye"}, {"title": "Privacy indexes: a survey of Westin's studies", "journal": "", "year": "2005", "authors": "Ponnurangam Kumaraguru; Lorrie Faith Cranor"}, {"title": "Personal Privacy Through Understanding and Action: Five Pitfalls for Designers", "journal": "Personal Ubiquitous Comput", "year": "2004-11", "authors": "Scott Lederer; Jason I Hong; Anind K Dey; James A Landay"}, {"title": "Connected' presence: The emergence of a new repertoire for managing social relationships in a changing communication technoscape. Environment and planning D: Society and space", "journal": "", "year": "2004", "authors": "Christian Licoppe"}, {"title": "10 Hyper-coordination via mobile phones in Norway", "journal": "", "year": "2002", "authors": "Richard Ling; Birgitte Yttri"}, {"title": "Sharing Empty Moments: Design for Remote Couples", "journal": "", "year": "2009", "authors": "Danielle Lottridge; Nicolas Masson; Wendy Mackay"}, {"title": "", "journal": "ACM", "year": "", "authors": ""}, {"title": "Using video to support interaction design", "journal": "DVD Tutorial", "year": "2002", "authors": "E Wendy;  Mackay"}, {"title": "Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11)", "journal": "ACM", "year": "2011", "authors": "Clara Mancini; Yvonne Rogers; Keerthi Thomas; Adam N Joinson; Blaine A Price; Arosha K Bandara; Lukasz Jedrzejczyk; Bashar Nuseibeh"}, {"title": "Attachment styles as predictors of Facebook-related jealousy and surveillance romantic relationships", "journal": "Personal Relationships", "year": "2013", "authors": "C Tara; Kathrine Marshall; Gaia Di Bejanyan; Ruth A Castro;  Lee"}, {"title": "She'Ll Just Grab Any Device That's Closer\": A Study of Everyday Device &#38; Account Sharing in Households", "journal": "ACM", "year": "2016", "authors": "Tara Matthews; Kerwell Liao; Anna Turner; Marianne Berkovich; Robert Reeder; Sunny Consolvo"}, {"title": "Stories from survivors: Privacy & security practices when coping with intimate partner abuse", "journal": "ACM", "year": "2017", "authors": "Tara Matthews; O' Kathleen; Anna Leary; Manya Turner; Jill Palzkill Sleeper; Martin Woelfer;  Shelton; Elizabeth F Manthorne; Sunny Churchill;  Consolvo"}, {"title": "The Calendar is Crucial: Coordination and Awareness Through the Family Calendar", "journal": "ACM Trans. Comput.-Hum. Interact", "year": "2009-04", "authors": "Carman Neustaedter; A J Bernheim Brush; Saul Greenberg"}, {"title": "Intimacy in longdistance relationships over video chat", "journal": "ACM", "year": "2012", "authors": "Carman Neustaedter; Saul Greenberg"}, {"title": "Sharing Domestic Life Through Long-Term Video Connections", "journal": "ACM Trans. Comput.-Hum. Interact", "year": "2015-02", "authors": "Carman Neustaedter; Carolyn Pang; Azadeh Forghani; Erick Oduor; Serena Hillman; K Tejinder; Michael Judge; Saul Massimi;  Greenberg"}, {"title": "What-sApp is for Family; Messenger is for Friends\": Communication Places in App Ecosystems", "journal": "ACM", "year": "2017", "authors": "Midas Nouwens; Carla F Griggio; Wendy E Mackay"}, {"title": "Everyday Dwelling with WhatsApp", "journal": "ACM", "year": "2014", "authors": "Kenton P O'hara; Michael Massimi; Richard Harper; Simon Rubens; Jessica Morris"}, {"title": "Share and Share Alike? An Exploration of Secure Behaviors in Romantic Relationships", "journal": "", "year": "2018", "authors": "Cheul Young Park; Cori Faklaris; Siyan Zhao; Alex Sciuto; Laura Dabbish; Jason Hong"}, {"title": "markerClock : A Communicating Augmented Clock for Elderly", "journal": "Springer Verlag", "year": "2007", "authors": "Yann Riche; Wendy Mackay"}, {"title": "PeerCare: supporting awareness of rhythms and routines for better aging in place", "journal": "Computer Supported Cooperative Work (CSCW)", "year": "2010", "authors": "Yann Riche; Wendy Mackay"}, {"title": "Communication, Coordination and Awareness Around Continuous Location Sharing", "journal": "ACM", "year": "2016", "authors": "Emily Schildt; Martin Leinfors; Louise Barkhuus"}, {"title": "Back and Forth, Back and Forth\": Channel Switching in Romantic Couple Conflict", "journal": "ACM", "year": "2013", "authors": "Lauren E Scissors; Darren Gergle"}, {"title": "Password Sharing: Implications for Security Design Based on Social Practice", "journal": "ACM", "year": "2007", "authors": "Supriya Singh; Anuja Cabraal; Catherine Demosthenous"}, {"title": "ConNexus to Awarenex: Extending Awareness to Mobile Users", "journal": "ACM", "year": "2001", "authors": "John C Tang; Nicole Yankelovich; James Begole; Max Van Kleek; Francis Li; Janak Bhalodia"}, {"title": "2012. I Love You, Let's Share Calendars: Calendar Sharing As Relationship Work", "journal": "ACM", "year": "", "authors": "Alexander Thayer; Matthew J Bietz; Katie Derthick; Charlotte P Lee"}, {"title": "Recalibrating the Ratio: Enacting Accountability in Intimate Relationships Using Shared Calendars", "journal": "ACM", "year": "2013", "authors": "Alexander Thayer; Behzod Sirjani; Charlotte P Lee"}, {"title": "Why do close partners snoop? Predictors of intrusive behavior in newlywed couples", "journal": "Personal Relationships", "year": "2011", "authors": "D W Charlotte; Catrin Vinkers; Skyler T Finkenauer;  Hawk"}, {"title": "Moving Beyond a \"One-size Fits All\": Exploring Individual Differences in Privacy", "journal": "ACM", "year": "2018", "authors": "Daricia Wilkinson; Moses Namara; Karla Badillo-Urquiola; Pamela J Wisniewski; Bart P Knijnenburg; Xinru Page; Eran Toch; Jen Romano-Bergstrom"}, {"title": "Repurposing Emoji for Personalised Communication: Why &#x1F355; Means \"I Love You", "journal": "ACM", "year": "2018", "authors": "Sarah Wiseman; J J Sandy;  Gould"}, {"title": "It's Complicated: How Romantic Partners Use Facebook", "journal": "ACM", "year": "2012", "authors": "Xuan Zhao; Victoria Schwanda Sosik; Dan Cosley"}], "figures": [{"figure_label": "1", "figure_type": "", "figure_id": "fig_0", "figure_caption": "Figure 1 :1Figure 1: Lifelines displayed peripherally as a notification (Android). Each banner is a lifeline visualizing multiple persistent streams of contextual information: the user's (top) and their partner's (bottom).", "figure_data": ""}, {"figure_label": "2", "figure_type": "", "figure_id": "fig_1", "figure_caption": "Figure 2 :2Figure 2: Lifelines' six streams of contextual information. The table only shows an example visualization for each stream.Users can customize all colors and textures. Data from home, battery, steps, and media is aggregated and added to the lifeline every 3 minutes. Data from sms and calls is added when they occur.", "figure_data": ""}, {"figure_label": "4", "figure_type": "", "figure_id": "fig_2", "figure_caption": "Figure 4 :4Figure 4: The Linebuilder app. In (a) all streams are active; in (b) home is off and media now appears as a blue crosshatch instead of pink waves.", "figure_data": ""}, {"figure_label": "5", "figure_type": "", "figure_id": "fig_3", "figure_caption": "Figure 5 :5Figure 5: Rick's partner going back home by car. She is outside the city around 21:00hs (home: pink crosshatch) and arrives home around 22:30hs.", "figure_data": ""}, {"figure_label": "6", "figure_type": "", "figure_id": "fig_4", "figure_caption": "Figure 6 :6Figure 6: Hugo disabled his home stream (solid brown) around 8:50am. The persistent character of Lifelines reveals the moment he toggled home off.", "figure_data": ""}, {"figure_label": "7", "figure_type": "", "figure_id": "fig_5", "figure_caption": "Figure 7 :7Figure 7: Owen's partner dances (steps: magenta bars) as they text about her night out via Facebook Messenger.", "figure_data": ""}, {"figure_label": "8", "figure_type": "", "figure_id": "fig_6", "figure_caption": "Figure 8 :8Figure 8: Barry's partner's lifeline shows regular gaps of missing data while her phone is unattended (until 18:30hs).", "figure_data": ""}, {"figure_label": "1", "figure_type": "table", "figure_id": "tab_0", "figure_caption": "Study participants. Couple 5 had a 9 year-old; couple 6 had 2 children under 5.", "figure_data": "CoupleRelationshipLivingAlias Age NationalityResidenceGenderOSKeepdurationtogetherLifelines?16 years3 yearsFay24 VenezuelanFranceFemaleAndroidYesPete30 VenezuelanFranceMaleAndroidYes23.5 years2 yearsEva30ItalianUKFemaleAndroidNoGary30BritishUKMaleiOSNo37 years-Hugo 25BrazilianBrazilMaleiOSNoMona 24BrazilianBrazilFemaleAndroidYes42 years9 months Quin28UKNew ZealandMaleiOSNoLucy25USANew ZealandFemaleAndroidNo58 years7 yearsDory 30 Argentinian ArgentinaFemaleAndroidYesJohn31 Argentinian ArgentinaMaleAndroidYes67 years6 yearsKelly 39 Argentinian ArgentinaFemaleAndroidYesBarry 43 Argentinian ArgentinaMaleAndroidYes78 years3 yearsRick31 Argentinian ArgentinaMaleAndroidYesNina28 Argentinian ArgentinaFemaleAndroidYes87 months7 monthsCarl22BritishUKMaleAndroidNoInez22RomanianUKFemaleAndroidNo91.3 years-Owen 27KoreanSwitzerlandMaleAndroidNoAmy24ChineseSwitzerlandFemaleiOSYes"}], "doi": "10.1145/3290605.3300853"}