{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.48400115966797,
      "x2": 295.5624084472656,
      "y1": 524.4481201171875,
      "y2": 588.8330078125
    },
    "text": "ABSTRACT Audiovisual recordings of user studies and interviews provide important data in qualitative HCI research. Even when a textual transcription is available, researchers frequently turn to these recordings due to their rich information content. However, the temporal, unstructured nature of audiovisual recordings makes them less"
  },
  "figures": [],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 197.4890899658203,
        "y1": 600.878662109375,
        "y2": 607.3049926757812
      },
      "text": "∗Both authors contributed equally to this research."
    }, {
      "page": 0,
      "region": {
        "x1": 53.31680679321289,
        "x2": 294.8095703125,
        "y1": 621.2330932617188,
        "y2": 707.3472290039062
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for proft or commercial advantage and that copies bear this notice and the full citation on the frst page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specifc permission and/or a fee. Request permissions from permissions@acm.org. CHI ’21, May 8–13, 2021, Yokohama, Japan © 2021 Association for Computing Machinery. ACM ISBN 978-1-4503-8096-6/21/05. . . $15.00 https://doi.org/10.1145/3411764.3445458"
    }, {
      "page": 0,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7188720703125,
        "y1": 525.1032104492188,
        "y2": 640.8880004882812
      },
      "text": "efcient to work with than text. Through interviews and a survey, we explored how HCI researchers work with audiovisual recordings. We investigated researchers’ transcription and annotation practice, their overall analysis workfow, and the prevalence of direct analysis of audiovisual recordings. We found that a key task was locating and analyzing inspectables, interesting segments in recordings. Since locating inspectables can be time consuming, participants look for detectables, visual or auditory cues that indicate the presence of an inspectable. Based on our fndings, we discuss the potential for automation in locating detectables in qualitative audiovisual analysis."
    }, {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.19580078125,
        "y1": 675.839111328125,
        "y2": 707.3469848632812
      },
      "text": "CCS CONCEPTS • Human-centered computing → Empirical studies in HCI ; User studies; • Information systems → Video search."
    }, {
      "page": 1,
      "region": {
        "x1": 53.50199890136719,
        "x2": 295.561279296875,
        "y1": 86.7980728149414,
        "y2": 118.3060302734375
      },
      "text": "KEYWORDS Video analysis, qualitative research, researchers, information behavior"
    }, {
      "page": 1,
      "region": {
        "x1": 53.50299835205078,
        "x2": 295.2685241699219,
        "y1": 133.72476196289062,
        "y2": 188.54302978515625
      },
      "text": "ACM Reference Format: Krishna Subramanian, Johannes Maas, Jan Borchers, and James Hollan. 2021. From Detectables to Inspectables: Understanding Qualitative Analysis of Audiovisual Data. In CHI Conference on Human Factors in Computing Systems (CHI ’21), May 8–13, 2021, Yokohama, Japan. ACM, New York, NY, USA, 10 pages. https://doi.org/10.1145/3411764.3445458"
    }]
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.58460998535156,
        "x2": 295.5633850097656,
        "y1": 229.91920471191406,
        "y2": 323.7860107421875
      },
      "text": "Qualitative research methods are often employed when data cannot be quantifed. They are commonly used in human-computer interaction (HCI) [1] and social science [18, 35] research. In HCI, qualitative methods are becoming increasingly prevalent. While 44% of papers from CHI 2014 used qualitative analysis methods [5], a survey of CHI 2019 papers [34] shows that this has increased to 62%. With qualitative research paradigms and software tools being employed more frequently, we need to understand how these research practices and accompanying tools are being used."
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5584716796875,
        "y1": 328.5492248535156,
        "y2": 499.12799072265625
      },
      "text": "Coding (also called annotation) is an important component of qualitative analysis. Researchers use keywords to categorize data and subsequently use these categories to detect patterns and anomalies. Researchers often code textual transcripts, e.g., of interviews, instead of the audiovisual recordings themselves. An important reason for this is that text is easier to search and navigate than audiovisual recordings [20, 25, 32]. However, audiovisual recordings contain additional rich information about behavior and user interaction not available in text transcripts [12]. Further, creating transcripts is tedious, and researchers often avoid doing it themselves, e.g., by paying student assistants or professionals to create them [28]. Because of these reasons, researchers often need to work directly with the audiovisual recordings. Despite the increasing frequency and importance of qualitative analyses of text-based transcripts and audiovisual recordings, there is a lack of research aimed at understanding researchers’ needs and workfows."
    }, {
      "page": 1,
      "region": {
        "x1": 53.7955322265625,
        "x2": 294.0464172363281,
        "y1": 503.8912353515625,
        "y2": 575.8410034179688
      },
      "text": "To address this, we conducted interviews and a survey to help understand researchers’ workfows when qualitatively analyzing audiovisual recordings. Specifcally, we addressed the following questions: How common is direct analysis of audiovisual recordings? Are transcripts involved when audiovisual recordings are available? How do researchers analyze audiovisual recordings? What do they look for? Where do they look?"
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5668640136719,
        "y1": 580.6041870117188,
        "y2": 707.3469848632812
      },
      "text": "As we will detail below, we found that researchers employ a predominantly bottom-up coding approach, in which they determine ‘what to look for’ only after watching the recordings, often multiple times. Signifcant time and efort during analysis is dedicated to locating and analyzing the segments in the recordings that researchers deem interesting. To locate these interesting segments, researchers search for visual and auditory cues, such as a button click or a particular sound, in the recordings that signal the presence of an interesting segment. Towards the end of the analysis, researchers seek information in the recordings, such as interesting user quotations and screenshots, with the purpose of reporting them in a publication or report. We discuss these and other fndings,"
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1615600585938,
        "y1": 87.45491027832031,
        "y2": 104.60797119140625
      },
      "text": "and present some design recommendations to improve researchers’ analysis workfows."
    }, {
      "page": 1,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.720703125,
        "y1": 116.46156311035156,
        "y2": 213.927001953125
      },
      "text": "The novel contributions of this paper are: • Results from interviews and a survey that help to provide an understanding of the prevalence of direct audiovisual analysis in qualitative HCI research, and researchers’ corresponding transcription, coding, and navigation practices. Our contribution here includes the vocabulary and concepts of inspectables, detectables, and reportables which help understand and structure discussions about qualitative audiovisual analysis."
    }, {
      "page": 1,
      "region": {
        "x1": 333.91766357421875,
        "x2": 559.7141723632812,
        "y1": 218.30262756347656,
        "y2": 257.76300048828125
      },
      "text": "• A discussion of how automation could help researchers deal with the important but laborious task of locating interesting audiovisual segments in recordings, and design recommendations based on our fndings."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 156.52899169921875,
        "y1": 215.56509399414062,
        "y2": 222.416015625
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.7125244140625,
        "y1": 288.18621826171875,
        "y2": 349.177001953125
      },
      "text": "In this section, we present some background information about qualitative analysis approaches and researchers’ analysis workfows. We then provide an overview of previous research-based and commercial tools that support qualitative analysis of audiovisual data, before discussing existing techniques for audiovisual navigation, summary, and visualization."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 529.482421875,
        "y1": 273.83306884765625,
        "y2": 280.6839904785156
      },
      "text": "2 BACKGROUND AND RELATED WORK"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.721435546875,
        "y1": 379.6002197265625,
        "y2": 473.4679870605469
      },
      "text": "Common qualitative research methods include grounded-theory based qualitative coding [36] and afnity diagramming [2]. In both methods, researchers identify interesting text or audiovisual snippets, categorize them, and use these categories to detect patterns or trends. While these methods dictate the researchers’ overall approach to analysis, individual research felds tend to follow more specifc analysis methods. For example, in interaction analysis in HCI, the focus is to understand how humans interact with other humans, objects, and interfaces [22]."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 512.85693359375,
        "y1": 365.2470703125,
        "y2": 372.0979919433594
      },
      "text": "2.1 Approaches to qualitative analysis"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.94586181640625,
        "x2": 559.7197875976562,
        "y1": 503.8912353515625,
        "y2": 652.552978515625
      },
      "text": "Previous research has investigated how researchers perform qualitative analysis. Melgar et al. proposed a generic process model that describes the various steps in media analysis by researchers [30]; this work is grounded in earlier research on media analysis workfows. The resulting model includes four phases that help us understand researchers’ workfows: exploration (background research, develop research intent, gather data), assembly (select corpus, collect more data if needed, select part of the corpus for analysis), analysis (pre-analyze corpus, conduct exploratory data analysis via visualizations, annotate data), and presentation (organize data and collect evidence for presentation). Although this model provides an overview of various tasks in media analysis by researchers, it does not investigate the mechanics of interaction employed in these tasks."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7191162109375,
        "y1": 657.316162109375,
        "y2": 707.3469848632812
      },
      "text": "Our paper is motivated in particular by Marathe and Toyama’s CHI ’18 paper that sought to understand how qualitative researchers interact with current software tools [27]. They found that the granularity and type of codes vary across diferent disciplines, and investigated opportunities to automate certain tasks in qualitative"
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.211669921875,
        "y1": 87.45320129394531,
        "y2": 115.5670166015625
      },
      "text": "analysis, e.g., with codebook development and management. Their paper focused on text-based qualitative analysis. We investigate direct analysis of audiovisual recordings."
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 498.3915100097656,
        "y1": 489.5380859375,
        "y2": 496.3890075683594
      },
      "text": "2.2 Researchers’ analysis workfow"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04644775390625,
        "y1": 158.32423400878906,
        "y2": 219.31402587890625
      },
      "text": "Software applications used for qualitative analysis are referred to as Qualitative Data Analysis (QDA) tools. QDA tools beneft researchers with organization of media fles and powerful features to manage codebooks. While there is concern that QDA tools impact the analysis method [13], the core of this concern has largely been refuted [3, 38, 41]."
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5582580566406,
        "y1": 224.0772247314453,
        "y2": 296.0270080566406
      },
      "text": "To understand how efective QDA tools are in supporting qualitative analysis, a comprehensive study of QDA tools was conducted as a part of the KWALON experiment [12]. A multimedia data corpus was analyzed by diferent teams utilizing various mainstream QDA tools. The results showed that due to the wide variety of tools, researchers would have to assess whether a specifc tool will suit their workfow [31]."
    }, {
      "page": 2,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.560791015625,
        "y1": 298.70556640625,
        "y2": 361.7799987792969
      },
      "text": "The most widely used commercial QDA tools are ATLAS.ti,1 NVIVO,2 MAXQDA,3 Transana,4 and HyperRESEARCH.5 Transana is the only listed tool that prioritizes audiovisual data over text [12]. There are some research-based QDA tools that support audiovisual analysis, such as ELAN (EUDICO Linguistic Annotator) [40], INTERACT,6 and Observer.7"
    }, {
      "page": 2,
      "region": {
        "x1": 53.79643249511719,
        "x2": 295.5648193359375,
        "y1": 366.5432434082031,
        "y2": 449.45098876953125
      },
      "text": "Some research tools tackle specifc problems in audiovisual analysis. ChronoViz allows users to view and annotate diferent types of time-coded data streams, such as videos, sensor data, and feld notes, to support more comprehensive analysis [14]. MiMeG8 (Mixed Media Grid) and DRS [4] help with collaboration and organization of multimedia fles respectively. The goal of our research is to understand how HCI researchers use these commercial and researchbased tools, in order to identify potential avenues for improvement."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 292.9908752441406,
        "y1": 131.01907348632812,
        "y2": 150.819091796875
      },
      "text": "2.3 Software support for qualitative analysis of audiovisual data"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.0309143066406,
        "y1": 492.209228515625,
        "y2": 564.1580200195312
      },
      "text": "The fnding that navigating time-coded media streams is more tedious than navigating textual data is well established in research [20, 25, 32]. This has spurred several techniques that aim to improve video navigation, e.g., by allowing multiple perspectives of videos [10], media navigation at diferent levels of granularity [6, 9, 33], and video navigation through direct manipulation of objects in the video [11, 17, 23]."
    }, {
      "page": 2,
      "region": {
        "x1": 53.57400131225586,
        "x2": 295.5586853027344,
        "y1": 568.9212036132812,
        "y2": 618.9530029296875
      },
      "text": "There have also been eforts to summarize audiovisual content in order to reduce viewing or listening time. For audio, this includes eliminating silence or speeding up clips [37] and summarizing spoken text [15]. For video, techniques include providing video thumbnails [24], video skims [8], and keyframe summaries"
    }, {
      "page": 2,
      "region": {
        "x1": 53.672000885009766,
        "x2": 295.1822204589844,
        "y1": 633.8167114257812,
        "y2": 707.3469848632812
      },
      "text": "1https://atlasti.com/ 2https://www.qsrinternational.com/nvivo-qualitative-data-analysis-software/home 3https://www.maxqda.com/ 4https://www.transana.com/ 5http://www.researchware.com/ 6http://www.noldus.com 7https://www.mangold-international.com/ 8https://www.surrey.ac.uk/sites/default/fles/MiMeG_distinguishingfeaturesFINAL. pdf"
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7178344726562,
        "y1": 87.45320129394531,
        "y2": 170.36102294921875
      },
      "text": "[16]. In addition to summaries, salient information in audiovisual recordings can be visualized to support ‘micro-analysis’ [29], i.e., detection of patterns or structure in the recordings. For example, DIVA visualizes annotations in a pseudo-3D representation to help researchers detect patterns and relationships more easily [26]. In music research there are many diferent visualizations used for analyzing music [21]. Simpler visualizations, such as waveform views and timelines, are more commonplace in QDA tools."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 276.3000183105469,
        "y1": 464.9040832519531,
        "y2": 484.7041015625
      },
      "text": "2.4 Techniques to navigate, summarize, and visualize audiovisual content"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.62109375,
        "x2": 559.714599609375,
        "y1": 213.1411895751953,
        "y2": 252.2130126953125
      },
      "text": "In this section, we present fndings from interviews with researchers who analyze audiovisual recordings using qualitative research methods. We conducted a survey to validate our interview fndings, the results of which are discussed in the next section."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 497.7041931152344,
        "y1": 185.83609008789062,
        "y2": 205.6361083984375
      },
      "text": "3 HOW RESEARCHERS ANALYZE AUDIOVISUAL RECORDINGS"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7178344726562,
        "y1": 282.0412292480469,
        "y2": 343.0320129394531
      },
      "text": "To recruit participants for our interviews, we reached out to experienced HCI researchers who had conducted audiovisual analyses as well as qualitative researchers we knew personally or through connections. We also recruited participants through mailing lists and by emailing psychology researchers at our university. We recruited ten participants (IP1–IP10, see Table 1) for the interview."
    }, {
      "page": 2,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.5364379882812,
        "y1": 347.7931823730469,
        "y2": 551.2509765625
      },
      "text": "The frst three interviews (IP1–IP3) were exploratory, designed to give us a general understanding of their workfows and where the most acute problems lie. These exploratory interviews helped us identify research questions9 that guided the next fve interviews (IP4–IP8). In all interviews, after inquiring about each participant’s background and expertise, we had them discuss their intentions during their most recent analysis and walk us through their data collection and analysis. We encouraged participants to keep their recent analysis fles and analysis tool ready so that they could walk us through their work. This simultaneously provided us with better understanding of their analysis and gave participants the opportunity to refect on their analysis process. Then we probed for specifc things our participants looked for and discussed how they looked for each. Analyzing data from these eight participants revealed patterns that were strong enough to warrant triangulation via a survey (see Section 4). After the survey, since we wanted to gather specifc examples of what researchers look for in audiovisual recordings, we recruited two more participants (IP9 and IP10) for these focused interviews."
    }, {
      "page": 2,
      "region": {
        "x1": 317.6210632324219,
        "x2": 559.7158203125,
        "y1": 556.0142211914062,
        "y2": 606.0460205078125
      },
      "text": "Our participants included two Master’s students, six PhD students, and two professors; they had varying amounts of experience with qualitative analyses of audiovisual recordings. All participants conducted research in the feld of HCI, except for IP6 who worked in psychology."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.718505859375,
        "y1": 610.8092041015625,
        "y2": 638.9219970703125
      },
      "text": "Due to COVID-19, all interviews were conducted remotely using Jitsi10 and Skype11. We recorded the session audio with the participants’ consent, and took notes to inform our analysis."
    }, {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7152709960938,
        "y1": 643.6851806640625,
        "y2": 660.8399658203125
      },
      "text": "The second author transcribed the interviews, and identifed interesting text snippets and insights from the transcripts and study"
    }, {
      "page": 2,
      "region": {
        "x1": 317.8290100097656,
        "x2": 558.2012939453125,
        "y1": 675.876708984375,
        "y2": 707.3469848632812
      },
      "text": "9Our principal research questions were “What do researchers look for in audiovisual recordings?” and “How do they look for it?” 10https://meet.jit.si/ 11https://www.skype.com/"
    }, {
      "page": 3,
      "region": {
        "x1": 65.97799682617188,
        "x2": 509.84039306640625,
        "y1": 88.31574249267578,
        "y2": 107.09698486328125
      },
      "text": "ID Field a Status b Duration c (minutes) Research intent d General approach e Tools used"
    }, {
      "page": 3,
      "region": {
        "x1": 64.1654052734375,
        "x2": 545.04248046875,
        "y1": 118.56294250488281,
        "y2": 177.37347412109375
      },
      "text": "IP1 HCI PhD 71 Understand UI usage Exploratory, direct annotation ELAN IP2 HCI Prof 41 Understand UI usage Exploratory, partial transcription ELAN IP3 HCI PhD 60 Understand UI usage Exploratory, partial transcription ELAN IP4 HCI MSc 43 Validate a prototype Rough scheme, tabular notes Spreadsheet software IP5 HCI PhD 28 Find infuence of an"
    }, {
      "page": 3,
      "region": {
        "x1": 211.76132202148438,
        "x2": 504.9755859375,
        "y1": 171.16822814941406,
        "y2": 188.3304443359375
      },
      "text": "intervention on a task Exploratory with POIs, direct annotation MAXQDA"
    }, {
      "page": 3,
      "region": {
        "x1": 64.16943359375,
        "x2": 310.13580322265625,
        "y1": 195.28089904785156,
        "y2": 212.43365478515625
      },
      "text": "IP6 Psy PhD 29 Understand people’s relationship with an object"
    }, {
      "page": 3,
      "region": {
        "x1": 326.60699462890625,
        "x2": 494.0096740722656,
        "y1": 195.28089904785156,
        "y2": 201.4766845703125
      },
      "text": "Exploratory, full transcription NVIVO"
    }, {
      "page": 3,
      "region": {
        "x1": 64.16943359375,
        "x2": 535.8110961914062,
        "y1": 219.3915557861328,
        "y2": 238.74102783203125
      },
      "text": "IP7 HCI MSc 30 Validate a prototype Rough scheme, tabular notes Notepad, MS Excel IP8 HCI Prof 31 Understand usage of a"
    }, {
      "page": 3,
      "region": {
        "x1": 211.76535034179688,
        "x2": 539.5321655273438,
        "y1": 232.53822326660156,
        "y2": 249.697998046875
      },
      "text": "teaching medium Exploratory, full transcription, direct annotation, and clips Video player, ELAN"
    }, {
      "page": 3,
      "region": {
        "x1": 64.16943359375,
        "x2": 552.9874267578125,
        "y1": 256.6482238769531,
        "y2": 273.802978515625
      },
      "text": "IP9 HCI PhD 17 Assess a UI Exploratory with POIs, freeform notes Paper-based notebook, video player"
    }, {
      "page": 3,
      "region": {
        "x1": 59.9962158203125,
        "x2": 494.0096740722656,
        "y1": 280.7572326660156,
        "y2": 297.9119873046875
      },
      "text": "IP10 HCI PhD 64 Find usability issues in UI Exploratory with POIs, full transcription NVIVO"
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 558.2005615234375,
        "y1": 303.8116455078125,
        "y2": 352.2409973144531
      },
      "text": "a HCI: Human-Computer Interaction; Psy: Psychology. b PhD: PhD student; Prof: Professor; MSc: Master’s student. c Duration of the recordings. Does not include the time taken for the initial introductions and fnal debriefng/feedback from participants. d We deliberately provide abstract descriptions of participants’ research intent to retain their anonymity. For some concrete examples, see Section 3.2.1. e Exploratory with POIs: exploratory, but with points of interest they were looking for; rough scheme: started with a rough scheme that then evolved; tabular notes: noted observations in a table; clips: extracted clips for detailed inspection."
    }, {
      "page": 3,
      "region": {
        "x1": 53.50199890136719,
        "x2": 558.2026977539062,
        "y1": 363.24810791015625,
        "y2": 379.8359375
      },
      "text": "Table 1: Information about interview participants, including their research intent, analysis approach in a recent analysis, and analysis tools."
    }, {
      "page": 3,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5602111816406,
        "y1": 413.7912292480469,
        "y2": 463.822998046875
      },
      "text": "notes. Some interviews were not conducted in English; the corresponding verbatim quotes reported in this paper are translations. The frst and second authors organized the snippets and insights in the style of an afnity diagram12 [19], in which the categories were developed from the data."
    }, {
      "page": 3,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.56304931640625,
        "y1": 482.75921630859375,
        "y2": 576.6259765625
      },
      "text": "We now present the main fndings from our analysis of the interviews organized into three subsections. In Section 3.2, we discuss participants’ overall research intent, and how this afected whether they analyze mainly transcripts or audiovisual recordings. In Section 3.3 and Section 3.4, we discuss what information participants looked for in audiovisual recordings, the navigation methods they used to look for this information, and introduce inspectables, detectables, and reportables. We summarize the key fndings in Section 3.5."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 478.9187927246094,
        "y1": 267.6880798339844,
        "y2": 274.53900146484375
      },
      "text": "3.1 Data collection and method"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.57830810546875,
        "x2": 295.5608215332031,
        "y1": 618.9852294921875,
        "y2": 679.9739379882812
      },
      "text": "3.2.1 Exploratory workflow and opportunistic navigation. Our participants reported beginning their analysis with broad research questions. Several research questions were theory-building, e.g., understanding how users perform a complex task using various programming IDEs, understanding how users react to sensory interventions at regular intervals, or investigating how users use certain"
    }, {
      "page": 3,
      "region": {
        "x1": 53.672000885009766,
        "x2": 294.0424499511719,
        "y1": 692.69970703125,
        "y2": 707.3469848632812
      },
      "text": "12An overview of the categories that resulted from our afnity diagram is available in the supplements."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549255371094,
        "x2": 558.204345703125,
        "y1": 413.7912292480469,
        "y2": 463.822998046875
      },
      "text": "tools for learning. Other research questions were about validating a prototype or software application, e.g., by understanding what insights users of a tool would develop, by checking if users could understand the interaction ofered by the tool, or by determining the efect a prototype has on learning outcomes."
    }, {
      "page": 3,
      "region": {
        "x1": 316.6099853515625,
        "x2": 559.7217407226562,
        "y1": 468.58624267578125,
        "y2": 650.1240234375
      },
      "text": "These research questions served as a starting point for the qualitative analysis. Participants reported to know what events to look for only at an abstract level; none reported using a predefned codebook or annotation scheme before watching or listening to the recordings. This is similar to the open coding phase in text-based qualitative analysis, in which researchers determine an initial set of codes only after getting acquainted with the data. To get acquainted with the recordings, participants reported employing an opportunistic style of navigation, such as playing videos at a faster speed (IP2, IP5, and IP7), listening to the discourse in the background (IP5), and scrubbing the video to identify salient video segments (IP7). Also, several participants (IP1, IP2, IP3, IP6, and IP8) explicitly mentioned that they approached the analysis with an open mind, trying to “pursue what the data says” (IP6), which indicates the prevalence of an inductive analysis approach. The evolution of their codebooks or annotation schemes continues throughout the analysis (IP1, IP4, and IP6), sometimes over multiple iterations (IP6)."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.5845336914062,
        "y1": 669.3467407226562,
        "y2": 707.3438720703125
      },
      "text": "3.2.2 What gets annotated—transcripts vs. audiovisual recordings. Our participants’ research questions dictated their transcription practice as well as what gets annotated. Transcripts are textual descriptions that capture information in audiovisual recordings."
    }, {
      "page": 4,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.5575256347656,
        "y1": 87.45320129394531,
        "y2": 159.4019775390625
      },
      "text": "While certain kinds of information, such as the verbal discourse and observable user actions, require little to no interpretation, others, such as body language and other non-verbal cues, require more nuanced interpretation and are difcult to describe adequately in transcripts. We found that participants either annotated the audiovisual recordings directly, or they analyzed mainly textual transcripts, using the audiovisual recordings for clarifcation."
    }, {
      "page": 4,
      "region": {
        "x1": 53.57400131225586,
        "x2": 295.42742919921875,
        "y1": 164.1652374267578,
        "y2": 345.7040100097656
      },
      "text": "IP1 and IP8 did most of the analysis working directly with the audiovisual recordings. IP8 extracted about 20 video clips from their recordings, so that these clips could be played in a loop via a conventional video player for a more focused analysis. Many participants (IP2, IP3, IP4, IP5, and IP7) performed what we classify as partial transcription of the recordings, and mainly used these transcripts for analysis. However, they also relied upon recordings during the analysis: IP2 and IP3 viewed certain video segments after transcription to observe details, such as a user’s emotions, that were missing from the transcript (“[The] participant did not say anything while they [were] struggling. [. . . ] if we watch the video, we will be able to note down that [. . . ] the participant [. . . ] expressed some frustrations.” – IP2). IP4, IP5, and IP7 did not transcribe the verbal discourse in a conventional sense, but took notes on specifc events while watching the videos that were used in the analysis. IP6 prepared full transcripts and used them exclusively during the analysis."
    }, {
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.0251159667969,
        "y1": 350.46722412109375,
        "y2": 400.49798583984375
      },
      "text": "Transcripts are not always limited to verbal information. For example, IP3 included what component of the interface the user was using into the transcript for context (“[. . . ] we had to see, OK, so he is moving the slider, and then write in brackets behind that that it was the [bottom] slider.” – IP3)."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 268.2926940917969,
        "y1": 591.6801147460938,
        "y2": 611.4801025390625
      },
      "text": "3.2 How researchers prepare to work with audiovisual recordings"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.464111328125,
        "x2": 295.42388916015625,
        "y1": 449.37823486328125,
        "y2": 521.3280029296875
      },
      "text": "Our fndings indicate that most participants either worked with audiovisual recordings directly or used them as a supplement when analyzing partial transcripts, e.g., to watch salient events in detail. In this section, we present fndings about participants’ annotation practice, which typically begins after getting sufciently acquainted with the videos to determine an initial set of codes or events to look for."
    }, {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0447082519531,
        "y1": 526.0911865234375,
        "y2": 543.2459716796875
      },
      "text": "There are broadly two types of information participants looked for in the recordings, which we coin inspectables and reportables."
    }, {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.58209228515625,
        "y1": 560.7431640625,
        "y2": 632.6929931640625
      },
      "text": "3.3.1 Inspectables. During analysis, one main task was to identify content in the recordings or transcripts that needed to be further inspected and refected upon. We call the audiovisual segments that correspond to this content inspectables. The goal is to fnd these inspectables in the recordings, and analyze them further to derive useful insights. Below are a few examples of inspectables (in italics) that are inspired by examples from our interviews."
    }, {
      "page": 4,
      "region": {
        "x1": 69.76065063476562,
        "x2": 295.5647277832031,
        "y1": 645.9722290039062,
        "y2": 707.3469848632812
      },
      "text": "• To determine whether users understand how a slider interaction works, the researcher wants to inspect the audiovisual segments after the user interacts with the slider. • To determine how users converse with a voice assistant, the researcher wants to inspect the audiovisual segments in which the user responds to the voice assistant."
    }, {
      "page": 4,
      "region": {
        "x1": 333.91973876953125,
        "x2": 559.720703125,
        "y1": 87.0693588256836,
        "y2": 115.5670166015625
      },
      "text": "• To determine reasons why a user paused a video, the researcher wants to inspect the audiovisual segments before and after the video is paused in the recording."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.3713989257812,
        "y1": 122.55323791503906,
        "y2": 150.6669921875
      },
      "text": "To analyze inspectables, researchers need to fnd them in the recordings, which can be time-consuming. We discuss how our participants located these inspectables in Section 3.4."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.723388671875,
        "y1": 161.22718811035156,
        "y2": 255.093994140625
      },
      "text": "3.3.2 Reportables. Towards the end of the analysis, some participants looked for information in the recordings or transcripts, which they reported in their publication. We call such content reportables. From our interviews, we identifed several instances of reportables, such as quotes from participants (IP1, IP2, IP3, and IP5), images or screenshots of the interface or user behavior (IP1, IP5, and IP8), and video clips for creating a supplementary videos accompanying a written publication (IP5). For IP1, IP5, and IP7, identifying reportables was a separate task, disjoint from the main coding task."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 280.66363525390625,
        "y1": 422.0730895996094,
        "y2": 441.87310791015625
      },
      "text": "3.3 What researchers look for in audiovisual recordings"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.72265625,
        "y1": 297.0372314453125,
        "y2": 379.94500732421875
      },
      "text": "We discussed earlier that to develop an initial set of codes and determine what events to look for, participants used an opportunistic approach. Participants also used the three following targeted information-seeking approaches, in which they used specifc features to locate the inspectables and reportables in recordings. The frst two approaches result in time-based navigation, whereas the last approach requires the user to look for audiovisual cues in the recordings to locate inspectables."
    }, {
      "page": 4,
      "region": {
        "x1": 317.6820068359375,
        "x2": 559.5858154296875,
        "y1": 390.5052185058594,
        "y2": 473.4129943847656
      },
      "text": "3.4.1 Time codes for backtracking. Many participants recorded time codes13 alongside their feld notes or during transcription. These time codes allow participants to backtrack to the relevant audiovisual segment in the recording. For example, IP2, IP3, and IP5 recorded time codes of relevant audiovisual segments alongside the user quotations they transcribed in case they needed clarifcation. Some participants captured time codes by annotating the relevant audiovisual segments before analysis, e.g., during transcription."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7156982421875,
        "y1": 478.1762390136719,
        "y2": 550.1259765625
      },
      "text": "Although time codes reduce the time required to locate interesting audiovisual segments, they need to be manually recorded either during the study itself or during transcription. Due to the exploratory nature of qualitative research, researchers cannot reliably determine which audiovisual segments are interesting before they begin the analysis. Therefore, backtracking via time codes is not a readily available navigation method in most qualitative research."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7135620117188,
        "y1": 560.6862182617188,
        "y2": 654.5509033203125
      },
      "text": "3.4.2 Using information about the study structure. Information about the study structure, such as timeline of tasks and experimental conditions, can help researchers locate inspectables. IP5 provided a good example of using a study’s structure to help narrow down possible locations where inspectables might occur (“[The event] happens fve times, every three minutes, [for] 15 seconds, right? [I] have basically looked at minute 3—and looked, uh, about half a minute before, what they are talking about, and then a minute later, has something else [i.e. interesting] happened?” – IP5)."
    }, {
      "page": 4,
      "region": {
        "x1": 317.7309875488281,
        "x2": 558.2042236328125,
        "y1": 665.1132202148438,
        "y2": 707.3469848632812
      },
      "text": "3.4.3 Detectables. Some participants provided examples of using visual or auditory cues in the recording to locate inspectables. The 13A time code represents a point of time in the recordings. For example, 1:15 represents 1 minute and 15 seconds into the recording."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04638671875,
        "y1": 87.45320129394531,
        "y2": 115.5670166015625
      },
      "text": "inspectables represented events that were too hard to fnd in the recording, but were usually signaled by the presence of another cue that they could more easily detect. We call these cues detectables."
    }, {
      "page": 5,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5624084472656,
        "y1": 120.33021545410156,
        "y2": 203.23797607421875
      },
      "text": "To help understand how inspectables and detectables work together, consider the following hypothetical analysis. Imagine that we would like to understand how people use Wikipedia.14 We want to investigate why users navigate within and across a wiki page. We perform a screen capture of participants using Wikipedia. When watching the recordings, we observe that participants often go back to previous pages, and we become interested in understanding the various reasons why users backtrack."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79777526855469,
        "x2": 295.5572509765625,
        "y1": 208.00123596191406,
        "y2": 323.7860107421875
      },
      "text": "To make progress with this research question, we want to locate and analyze all video segments before users backtrack—these are our inspectables. We can locate them using certain cues, e.g., we notice that participants always press the browser’s back button to backtrack.15 Thus, the back button getting pressed is a detectable that acts as an indicator for the inspectable. We can navigate the recording looking specifcally for back button presses, e.g., by quickly going through the video to identify instances where the back button is clicked. Note that we were not aware of this detectable before collecting our data, and thus could not have generated logs to allow for an easier detection of button clicks."
    }, {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5602111816406,
        "y1": 328.5492248535156,
        "y2": 411.4570007324219
      },
      "text": "While in the given example the detectable was objective and concrete, we also consider more abstract, subjective cues detectables. For example, if you want to investigate the instances where participants became angry, a suitable detectable might involving analyzing participants’ facial expressions. One reason for distinguishing detectables and inspectables is that detectables lend themselves more readily to automatic detection—a topic we will return to in Section 5."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 537.5116577148438,
        "y1": 269.7320861816406,
        "y2": 289.5321044921875
      },
      "text": "3.4 How researchers navigate recordings to seek information"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 252.1885528564453,
        "y1": 449.65423583984375,
        "y2": 455.8500061035156
      },
      "text": "In summary, the key fndings from our interviews are:"
    }, {
      "page": 5,
      "region": {
        "x1": 69.76065063476562,
        "x2": 295.56353759765625,
        "y1": 471.3080749511719,
        "y2": 609.4000244140625
      },
      "text": "• Audiovisual recordings contain rich information not available in text. Most participants either coded the recordings directly, or used them in addition to transcripts. • Most participants do not know what to look for before the analysis begins. • After familiarizing themselves with the recordings, participants’ wanted to locate and analyze interesting audiovisual segments called inspectables. • To fnd inspectables, which can be tedious, participants used visual and auditory cues called detectables. • Towards the end of the analysis, participants also sought information like screenshots and quotes to report in their work. We call such information reportables."
    }, {
      "page": 5,
      "region": {
        "x1": 53.672000885009766,
        "x2": 294.22186279296875,
        "y1": 668.3477172851562,
        "y2": 707.3469848632812
      },
      "text": "14Wikipedia is an online, crowd-sourced encyclopedia. https://www.wikipedia.org/ 15 In reality, users may use multiple diferent ways to backtrack, e.g., also use keyboard shortcuts—an inspectable might have multiple detectables. But in such a case we simply need to fnd more detectables. For the sake of simplicity, we assume a single detectable in our example."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 53.79800033569336,
        "x2": 152.17625427246094,
        "y1": 435.3000793457031,
        "y2": 442.1510009765625
      },
      "text": "3.5 Key takeaways"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7137451171875,
        "y1": 101.15119934082031,
        "y2": 129.2650146484375
      },
      "text": "To triangulate the fndings from our interviews, and better understand what researchers need when doing qualitative audiovisual analysis, we conducted an online survey.16"
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 376.853271484375,
        "y1": 86.7980728149414,
        "y2": 93.64898681640625
      },
      "text": "4 SURVEY"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.1865844726562,
        "y1": 159.39320373535156,
        "y2": 187.50701904296875
      },
      "text": "To get responses from a representative sample of HCI researchers, we sent the survey to frst authors of CHI ’19 papers that reported qualitative analysis of audiovisual recordings.17"
    }, {
      "page": 5,
      "region": {
        "x1": 317.95416259765625,
        "x2": 559.5819091796875,
        "y1": 192.2702178955078,
        "y2": 242.29693603515625
      },
      "text": "We excluded two authors who had given feedback on a pilot of our survey to avoid any conficts or biases. We also sent the survey to a local HCI research lab’s mailing list and a Slack18 group for HCI researchers. The survey was closed after two weeks. 66 respondents took the survey, and the survey took about ten minutes to complete."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 380.7477722167969,
        "y1": 145.03909301757812,
        "y2": 151.8900146484375
      },
      "text": "4.1 Method"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.6409912109375,
        "x2": 559.7181396484375,
        "y1": 272.4292297363281,
        "y2": 388.2139892578125
      },
      "text": "Although we had no mechanism to detect whether the answer came from a CHI ’19 author or from our other postings, we suspect that the majority of respondents are CHI authors, as many of them had responded to our email confrming their participation. Respondents from ten diferent nationalities took the survey, with most from the US (54%) or the UK (19%), and were either PhD students (65%), academic researchers (12%), e.g., postdoctoral researchers and professors, or Master’s students (12%). Only 23% of the respondents had conducted fewer than three qualitative analyses with audiovisual data, while 36% had fnished 3–5, 23% between 6 and 20, and 18% had conducted over 20 analyses."
    }, {
      "page": 5,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.5826416015625,
        "y1": 407.1502380371094,
        "y2": 468.1400146484375
      },
      "text": "We present selected results from the survey that informed our understanding of how researchers analyze audiovisual recordings. Respondents were asked to answer the survey questions in the context of their most recent qualitative analyses of audiovisual data. If they wanted to contribute multiple analyses, they were instructed to take the survey multiple times."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 489.1842041015625,
        "y1": 258.0751037597656,
        "y2": 264.926025390625
      },
      "text": "4.2 Details of survey respondents"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.6860046386719,
        "x2": 558.2069702148438,
        "y1": 498.2682189941406,
        "y2": 570.2169799804688
      },
      "text": "24% of respondents used only audio recordings, 61% used both audio and video recordings, and only 3% used solely video recordings (i.e., without audio). Analyses that used only audio tend to follow a similar workfow, e.g., all such analyses utilized a full transcription of the recordings. Analyses that involved both audio and video, on the other hand, did not exhibit a unifed workfow. We found two sub-groups of analyses that involved both audio and video:"
    }, {
      "page": 5,
      "region": {
        "x1": 333.91766357421875,
        "x2": 559.574462890625,
        "y1": 577.91015625,
        "y2": 661.2059936523438
      },
      "text": "• Analyses that focused primarily on the audio, in which the video acted as a supplement, e.g., a think-aloud study with a screen recording. Here, the analysis was done primarily on transcripts, and the recordings were used only to clarify ambiguous statements, e.g., “this button is broken.” • Analyses that focused on rich behavior in both audio and video, e.g., a longitudinal study about drivers’ GPS usage. Since such studies are interested in nuanced behavior that is"
    }, {
      "page": 5,
      "region": {
        "x1": 317.8290100097656,
        "x2": 558.20458984375,
        "y1": 675.876708984375,
        "y2": 707.3469848632812
      },
      "text": "16For the questions and an anonymized data set of responses, please see the supplements. 17We used Reinhard’s analysis of CHI ’19 papers to identify these papers [34]. 18Slack is an enterprise communication platform. https://slack.com/intl/en-de/."
    }, {
      "page": 6,
      "region": {
        "x1": 78.20700073242188,
        "x2": 294.0445556640625,
        "y1": 87.45320129394531,
        "y2": 104.60797119140625
      },
      "text": "difcult to capture in transcripts, researchers need to analyze the recordings directly."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 521.682373046875,
        "y1": 483.9140930175781,
        "y2": 490.7650146484375
      },
      "text": "4.3 What gets analyzed? Audio vs. video"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.55963134765625,
        "y1": 136.90821838378906,
        "y2": 165.02197265625
      },
      "text": "From our interviews, we identifed diferent types of qualitative analyses. Respondents were asked which of the following descriptions better ft their research questions:"
    }, {
      "page": 6,
      "region": {
        "x1": 69.76065063476562,
        "x2": 294.9438781738281,
        "y1": 174.80433654785156,
        "y2": 258.10302734375
      },
      "text": "• “Theory building. For example, modeling people’s behavior when using a piece of technology, or understanding the meaning of objects in people’s lives.” • “Validation of an artifact or hypothesis. For example, testing a software prototype, or testing retention of information with a new learning method.” • “Measurement. For example, the time spent in diferent locations, or the time spent talking about diferent topics.”"
    }, {
      "page": 6,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.0302734375,
        "y1": 268.2752380371094,
        "y2": 307.34698486328125
      },
      "text": "Respondents could select multiple answers and give an open-ended text comment. 63% of analyses were categorized as theory building, and 29% as validation. Analyses involving measurement were rare (3%), as expected for qualitative analysis."
    }, {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5572204589844,
        "y1": 312.1102294921875,
        "y2": 373.10101318359375
      },
      "text": "Most validation studies had both audio and video recordings available (17 out of 19 responses). On the other hand, 67% of analyses involving only audio were theory building. This is to be expected since most feld researchers use interviews, focus groups, and diaries for data collection, and the largely verbal content is typically audio-recorded and transcribed to allow for text-based analysis."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 221.0671844482422,
        "y1": 122.55509185791016,
        "y2": 129.406005859375
      },
      "text": "4.4 Types of qualitative research"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5596008300781,
        "y1": 405.4022216796875,
        "y2": 477.35101318359375
      },
      "text": "In our interviews, we found that most researchers adopt a rather exploratory style of analysis, where they identify what is interesting only after watching the recordings. With our survey, we wanted to see if this fnding holds true for a larger sample and, more importantly, assess the degree of exploration in typical analyses. To do this, we asked respondents to rate the two following statements on a fve-point Likert scale:"
    }, {
      "page": 6,
      "region": {
        "x1": 64.70359802246094,
        "x2": 294.9408874511719,
        "y1": 487.5189208984375,
        "y2": 526.5960083007812
      },
      "text": "(1) “Before starting the analysis, I knew clearly where in the recordings to look and what concretely to look for.” (2) “Only after I watched (some or all of) the recordings did I fnd concrete events or aspects to focus the analysis on.”"
    }, {
      "page": 6,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.0353088378906,
        "y1": 536.7681884765625,
        "y2": 608.7169799804688
      },
      "text": "We designed the statements to be contrasting—if a researcher knew where and what to look for (1), they would not need to watch the recordings before fnding concrete aspects to focus on (2). Most respondents disagreed with the frst statement (51% rated it 1 or 2, 29% rated it 4 or 5), while most agreed with the second statement (63% rated it 4 or 5, 18% rated it 1 or 2), mostly confrming that the statements are contrasting."
    }, {
      "page": 6,
      "region": {
        "x1": 53.57400131225586,
        "x2": 295.558837890625,
        "y1": 613.480224609375,
        "y2": 707.3469848632812
      },
      "text": "The frst question, which we anticipated to provoke disagreement, had 29% agree (rated it 4 or 5), whereas the second statement does not refect this group—only 15% disagreed (rated it 1 or 2). Upon further inspection, out of the 14 respondents who rated the frst statement with 4 or 5, 12 used audio and video recordings. It thus appears that there are certain researchers using audio-andvideo recordings who have a predetermined notion of what to look for. Interestingly, with their higher rating for the second statement, they agree that they need to watch the recordings before fnding"
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7124633789062,
        "y1": 87.45320129394531,
        "y2": 126.5260009765625
      },
      "text": "concrete aspects. One explanation for this is that while these researchers might have had predetermined research questions, they nevertheless had to explore the recordings before they can defne their inspectables (see Section 3.3.1)."
    }, {
      "page": 6,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7131958007812,
        "y1": 131.28822326660156,
        "y2": 214.197021484375
      },
      "text": "We also aimed to quantify how often the coding scheme is modifed during the analysis, another measure for how exploratory it is. We asked respondents to rate the following statement: “I had a coding or classifcation scheme (from the start or after observing some of the recordings) that was mostly fxed and that I applied in the rest of the analysis.” 65% indicated that their coding scheme was not fxed (rated 1 or 2). Only 24% reported using a fxed scheme (rated 4 or 5)."
    }, {
      "page": 6,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.2034301757812,
        "y1": 218.96022033691406,
        "y2": 258.031982421875
      },
      "text": "Overall, these statistics show that more than half of analyses are exploratory, evident from the evolving coding schemes and the researchers’ need to immerse in the recordings before knowing what to focus the analysis on."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 290.4272766113281,
        "y1": 391.0480651855469,
        "y2": 397.89898681640625
      },
      "text": "4.5 How exploratory are audiovisual analyses?"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 317.4079895019531,
        "x2": 559.7139282226562,
        "y1": 288.4602355957031,
        "y2": 382.3269958496094
      },
      "text": "We asked respondents to rate the following statement on a Likert scale of 1–5: “All information necessary for the analysis was frst extracted from the recordings into a more convenient form for analysis. (For example, into a transcript, as quotes, or as video clips.)” 58% of the responses indicated a strong agreement (rating of 5) with the statement. Only 15% indicated that they do not extract the information for the analysis (ratings of 1 or 2). While the statement deliberately left open what kind of extraction was used, this suggests that the recordings had to be prepared for analysis."
    }, {
      "page": 6,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.5810546875,
        "y1": 387.0902404785156,
        "y2": 437.11993408203125
      },
      "text": "The most common form of such data preparation is transcription. The survey contained two questions that aimed to identify the role of transcripts in qualitative analysis: what type of transcripts were used (full, partial, or none), and how much they were used during analysis."
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.10302734375,
        "y1": 441.88421630859375,
        "y2": 491.9139404296875
      },
      "text": "72% of respondents reported preparing a full transcription of their recording, 20% prepared a partial transcription (“only interesting statements” ), and 8% prepared no transcripts. As mentioned earlier, all respondents who had only audio recordings prepared a full transcription."
    }, {
      "page": 6,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.2071533203125,
        "y1": 496.6792297363281,
        "y2": 524.79296875
      },
      "text": "To understand our respondents’ reliance on transcripts versus working with the recordings directly, we identifed four levels of transcript use based on our interviews and literature review:"
    }, {
      "page": 6,
      "region": {
        "x1": 333.91766357421875,
        "x2": 559.098876953125,
        "y1": 532.7730712890625,
        "y2": 605.1109619140625
      },
      "text": "• “I used only the transcript and did not revisit the recordings at all.” • “I used mainly the transcript and revisited the recordings only to clarify in case of ambiguity or errors in the transcript.” • “The analysis required information not present in the transcript, so I used both the transcript and the recordings.” (in the following referred to as having an insufcient transcript.)"
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7157592773438,
        "y1": 609.486572265625,
        "y2": 674.4710083007812
      },
      "text": "• “I primarily used the recordings instead of the transcript.” 13% of respondents used transcripts exclusively in the analysis, and 60% used the audiovisual recordings only for corrections. 25% had insufcient transcripts and one respondent (2%) reported having a full transcript but primarily used the recordings in the analysis."
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1910400390625,
        "y1": 679.2341918945312,
        "y2": 707.3469848632812
      },
      "text": "All respondents whose analyses involved only audio recordings either completely relied on transcripts or used recordings only for corrections. However, when both audio and video was available,"
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5574645996094,
        "y1": 87.45320129394531,
        "y2": 137.4840087890625
      },
      "text": "the use of transcripts was split: 50% of audio-and-video analyses with a transcript used the recordings only for corrections, whereas 44% considered their transcripts insufcient. The two remaining participants either relied entirely on the transcript or on the recordings."
    }, {
      "page": 7,
      "region": {
        "x1": 53.576751708984375,
        "x2": 295.564697265625,
        "y1": 142.24720764160156,
        "y2": 192.27899169921875
      },
      "text": "This confrms our interview fnding that in most analyses that involve audiovisual recordings, recordings are either used exclusively, for corrections, or for specifc tasks alongside transcripts. Overall, 32% of participants reportedly did not rely solely on a transcript, but required direct analysis.19"
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 410.845947265625,
        "y1": 274.1060791015625,
        "y2": 280.9570007324219
      },
      "text": "4.6 Transcription"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.2811584472656,
        "y1": 222.08424377441406,
        "y2": 239.239013671875
      },
      "text": "In summary, the following are the key fndings we can takeaway from our survey:"
    }, {
      "page": 7,
      "region": {
        "x1": 69.76065063476562,
        "x2": 295.55657958984375,
        "y1": 246.62733459472656,
        "y2": 362.7950134277344
      },
      "text": "• Text-based analysis is dominant: 58% of respondents extracted information from their recordings into a more convenient form for analysis. 71% used full transcripts, and 20% used partial transcript. • Transcripts are not always adequate: 32% of respondents could not rely solely on transcripts and needed to work with the recordings directly. • Most qualitative analyses that involve audiovisual recordings are exploratory: 63% are theory building. 53% of respondents did not know what to look for in the videos before analysis, and 65% changed their coding scheme during the analysis."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 152.17625427246094,
        "y1": 207.73104858398438,
        "y2": 214.58197021484375
      },
      "text": "4.7 Key takeaways"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5637512207031,
        "y1": 405.5522155761719,
        "y2": 543.2550048828125
      },
      "text": "From our interviews and survey, we found that a substantial number of qualitative analyses involve direct analysis of audiovisual recordings. In such analyses, researchers face the laborious task of locating and further analyzing interesting segments, the inspectables, in the recording (see Section 3.3.1). Since inspectables can be abstract and hard to fnd in the recordings, we found that researchers locate them using information about study structure, backtracking, or detectables (see Section 3.4). Of these, information about study structure and backtracking are time-based navigation techniques, and are already well supported by the traditional timebased media navigation interfaces in QDA tools. On the other hand, to fnd detectables, which are visual or auditory cues, researchers have to manually search the recordings."
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.558837890625,
        "y1": 548.0181884765625,
        "y2": 587.0899658203125
      },
      "text": "To help with this tedious task of searching for detectables, automation via software support could be useful, as suggested by IP3 when prompted to imagine a magical tool that could help them with qualitative analysis:"
    }, {
      "page": 7,
      "region": {
        "x1": 78.2052993774414,
        "x2": 270.5319519042969,
        "y1": 595.6573486328125,
        "y2": 644.8930053710938
      },
      "text": "“We have done the analysis once completely. And then we go back and see, aha, OK, is that maybe an interesting pattern which we haven’t yet thought of. Then [a magical tool] would, so to say, let us extract these [. . . ]” – IP3"
    }, {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.0287170410156,
        "y1": 652.6632080078125,
        "y2": 669.8179931640625
      },
      "text": "In this section, we discuss whether such automation is warranted, how efective it can be, and discuss considerations for design."
    }, {
      "page": 7,
      "region": {
        "x1": 53.672000885009766,
        "x2": 294.8656311035156,
        "y1": 684.7296752929688,
        "y2": 707.3469848632812
      },
      "text": "19We counted participants with the following criteria as requiring direct analysis: reported having no transcript, having an insufcient transcript, or using primarily the recordings to require direct analysis."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 279.5182189941406,
        "y1": 378.2470703125,
        "y2": 398.0470886230469
      },
      "text": "5 DISCUSSION: AUTOMATION IN FINDING DETECTABLES"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.9549560546875,
        "x2": 558.8554077148438,
        "y1": 101.15119934082031,
        "y2": 162.14202880859375
      },
      "text": "Since the detectables lend themselves more readily to detection, we propose to use simple techniques like image recognition and sound detection to automatically fnd potential locations of detectables in audiovisual segments. The goal is not to automate the entire analysis, but only to help researchers with a tedious task, that of locating possible locations of detectables of audiovisual segments."
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.1975708007812,
        "y1": 166.9052276611328,
        "y2": 184.05999755859375
      },
      "text": "To show how automation can be used to fnd detectables, we provide two examples inspired by our interview fndings:"
    }, {
      "page": 7,
      "region": {
        "x1": 333.91766357421875,
        "x2": 559.720703125,
        "y1": 192.2821807861328,
        "y2": 341.3320007324219
      },
      "text": "• Building on the example from Section 3.4.3, imagine we want to fnd all instances where users click the browser’s back button. Since the button gets darker when it is clicked, we could capture the average brightness of the button’s pixels and mark all frames where the brightness is below a certain threshold. This would lead us to all segments where the back button was clicked. • Imagine that we want to investigate what participants said to trigger a voice assistant. Since the assistant makes a characteristic activation sound before replying, we could automatically search for that activation sound in the recording. After marking all such instances, we could much more easily inspect the segments of the recording leading up to the response."
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.202880859375,
        "y1": 349.9432373046875,
        "y2": 378.0570068359375
      },
      "text": "We now discuss the scope of such automation across various tasks in qualitative analysis and its application to various research questions."
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.1910400390625,
        "y1": 390.3042297363281,
        "y2": 429.37701416015625
      },
      "text": "5.1.1 Scope of automation. The most prominent application of automation is to fnd inspectables via detectables. Additionally, fnding reportables, i.e., user quotes or screenshots, may also require audiovisual cues, which can beneft from automation."
    }, {
      "page": 7,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7208251953125,
        "y1": 434.1402282714844,
        "y2": 495.1310119628906
      },
      "text": "Automation can even be useful before the analysis. From our interviews, we found that researchers who perform partial transcription often look for interesting segments in their recordings, which they transcribe for a later in-depth analysis. This process is similar to searching for detectables, and can beneft from automation."
    }, {
      "page": 7,
      "region": {
        "x1": 317.62298583984375,
        "x2": 558.4384155273438,
        "y1": 499.8932189941406,
        "y2": 571.843017578125
      },
      "text": "The approach to automation we propose is not dependent on the research question (see Section 4.4). It is instead limited only by whether the detectables in the recording, which are informed by the research questions, can be reliably detected by software. For example, in behavioral analysis, researchers often looks for subtle non-verbal cues in study participants. Such detectables are hard to detect automatically."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 544.7115478515625,
        "y1": 86.7980728149414,
        "y2": 93.64898681640625
      },
      "text": "5.1 Call to automation in fnding detectables"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7123413085938,
        "y1": 602.5211791992188,
        "y2": 707.3469848632812
      },
      "text": "Our call for automation brings up a classic question in qualitative research: Is it desirable to automate qualitative researchers’ workfow? Earlier research has called for the use of computation techniques in qualitative analysis [7]. Work from Marathe and Toyama on qualitative analysis of textual content fnds that there is potential to automate many parts of qualitative research [27], but that researchers want automation to be transparent, and desire automation only after coming up with a codebook and coding some data. Our interview participants expressed similar concerns for automation in analysis of audiovisual content: (“[. . . ] Sort of a"
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04638671875,
        "y1": 88.2467269897461,
        "y2": 115.5670166015625
      },
      "text": "good balance between not letting others analyze my data so that [as a consequence] I have no connection to the data, but also removing the redundant parts of the analysis.” – IP1)."
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0497741699219,
        "y1": 120.33021545410156,
        "y2": 148.4429931640625
      },
      "text": "We now discuss some design considerations for automation based on the insights we obtained in our interviews, survey, and literature review:"
    }, {
      "page": 8,
      "region": {
        "x1": 53.57400131225586,
        "x2": 295.5633850097656,
        "y1": 160.62869262695312,
        "y2": 242.46600341796875
      },
      "text": "5.2.1 Use simple, explainable, and reproducible techniques that focus on detecting primitives. It is important for automation to be transparent and allow users to operate at a concrete level, e.g., by detecting and tracking basic auditory and visual properties like color, position, and audio frequency. Automation could also combine simple operations that target primitives, e.g., to fnd all red squares that are within a rectangle, similar to existing stream or video algebras [26, 39]."
    }, {
      "page": 8,
      "region": {
        "x1": 53.48400115966797,
        "x2": 295.555419921875,
        "y1": 247.2292022705078,
        "y2": 352.05499267578125
      },
      "text": "While complex techniques like neural networks may allow us to detect more abstract, complex instances of detectables, they may also cause the researcher to lose trust in the software, especially for subjective tasks like determining whether a person in a recording is frustrated. For this reason, it is preferable to use simple deterministic algorithms that can be easily understood, replicated, and explained to others. In addition to promoting trust in automation, such an approach also results in a more reproducible research. This discussion is related to the ongoing discussion about explainable AI."
    }, {
      "page": 8,
      "region": {
        "x1": 53.79798889160156,
        "x2": 295.55963134765625,
        "y1": 364.2406921386719,
        "y2": 457.0360107421875
      },
      "text": "5.2.2 Limit the role of automation to finding potential locations of detectables. Automation should take a backseat in qualitative analysis. Its role is to help the researcher fnd potential locations of detectables, not analyze the inspectables. It is important for automation to minimize false negatives even if that increases false positives. False positives can be manually inspected and removed by the researcher. False negatives, however, would require the researcher to look through the entire recording, which is what the automation was supposed to prevent."
    }, {
      "page": 8,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.55743408203125,
        "y1": 468.1502380371094,
        "y2": 605.85302734375
      },
      "text": "5.2.3 Incorporate other data when available. Software that uses automation should incorporate other data collected in user studies, when available, so that automation can use these additional data sources to help locate detectables. For example, assume that, in a study, the researcher has captured feld notes along with time codes in a digital format. These notes can then be used as an additional data source for locating detectables, e.g., to highlight video segments corresponding to all occurrences of a keyword in the feld notes. ChronoViz is an existing tool that supports visualization of time series data from multiple sources, such as sensors, digital notes, and GPS, to provide a holistic view of the data collected in user studies [14]. We envision future QDA tools to adopt a similar approach, with an added support for automatically fnding detectables."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 529.6134033203125,
        "y1": 588.1680908203125,
        "y2": 595.0189819335938
      },
      "text": "5.2 Design considerations for automation"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.55963134765625,
        "y1": 635.398193359375,
        "y2": 685.4299926757812
      },
      "text": "Our work with this research is meant to be a useful frst step in understanding and supporting qualitative researchers perform audiovisual analysis. We recommend the reader to take the intended benefts of automation with reservations, and consider the following challenges."
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.4327392578125,
        "y1": 690.1931762695312,
        "y2": 707.3469848632812
      },
      "text": "For one, we do not yet know how automation will be used in practice. Will it help researchers develop insights more efectively?"
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.1912231445312,
        "y1": 87.45491027832031,
        "y2": 192.27899169921875
      },
      "text": "Or will it lead to less involvement from researchers, and thus lower the quality of research fndings? It is also conceivable that, in certain analyses, there are no repetitive cues, i.e., detectables, that can be detected reliably by software. For example, in HCI studies that aim to understand human behavior, software detection may fail, or lead to too many false positives, requiring much efort from the researcher to manually flter them. From a development perspective, it is also possible that since detectables may be unique to each analysis, the automation techniques need to be comprehensive, covering several data dimensions."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 253.24908447265625,
        "y1": 621.0441284179688,
        "y2": 627.89501953125
      },
      "text": "6 LIMITATIONS AND FUTURE WORK"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.581298828125,
        "y1": 221.61622619628906,
        "y2": 326.4429931640625
      },
      "text": "In this paper, we studied how qualitative researchers work with audiovisual recordings. We found that 32% of respondents could not work solely with a transcript but relied on audiovisual recordings. An important task is to locate the inspectables to analyze in detail. Finding the abstract inspectables is achieved through time codes, by exploiting study structure, or by looking for concrete detectables that indicate the inspectables. Towards the end of the analysis, researchers look for reportables, which are pieces of information from the recordings that they report in their publication to illustrate their fndings."
    }, {
      "page": 8,
      "region": {
        "x1": 317.9549255371094,
        "x2": 559.7144165039062,
        "y1": 331.2052307128906,
        "y2": 414.114013671875
      },
      "text": "We also discussed the potential for the search for detectables and presented our design recommendations. We also discussed the potential for the search for detectables and presented our design recommendations. Our vision is that such automation can save qualitative researchers time and efort in locating inspectables, allowing them to focus on analyzing them. We hope that our work sparks further research and development to improve the tool support for qualitative analysis of audiovisual data."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 405.7296142578125,
        "y1": 207.26309204101562,
        "y2": 214.114013671875
      },
      "text": "7 CONCLUSION"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 317.5249938964844,
        "x2": 559.7141723632812,
        "y1": 443.45123291015625,
        "y2": 515.4010009765625
      },
      "text": "We thank Prof. Dr. Chat Wacharamanothan and Alexander Eiselmayer for their helpful comments on the survey, Dr. Adam Fouse and Sebastian Hueber for their valuable input to our research, Oliver Nowak and Adrian Wagner for their help in preparing this manuscript, all interview and survey participants for their valuable contributions, and all reviewers for their feedback. This work was funded in part by the German B-IT Foundation."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 435.5114440917969,
        "y1": 429.09808349609375,
        "y2": 435.9490051269531
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 321.197998046875,
        "x2": 558.19970703125,
        "y1": 543.1260986328125,
        "y2": 547.9450073242188
      },
      "text": "[1] Anne Adams, Peter Lunt, and Paul Cairns. 2008. A Qualitative Approach to"
    }, {
      "page": 8,
      "region": {
        "x1": 321.2007751464844,
        "x2": 559.2785034179688,
        "y1": 551.09716796875,
        "y2": 707.3469848632812
      },
      "text": "HCI Research. Cambridge University Press, Burlington, US, 138–157. https: //doi.org/10.1017/CBO9780511814570.008 [2] Hugh Beyer and Karen Holtzblatt. 1999. Contextual Design. Interactions 6, 1 (Jan. 1999), 32–42. https://doi.org/10.1145/291224.291229 [3] Joy D. Bringer, Lynne Halley Johnston, and Celia H. Brackenridge. 2006. Using Computer-Assisted Qualitative Data Analysis Software to Develop a Grounded Theory Project. Field Methods 18, 3 (Aug. 2006), 245–266. https://doi.org/10. 1177/1525822X06287602 [4] Patrick Brundell, Paul Tennent, Chris Greenhalgh, Dawn Knight, Andy Crabtree, Claire O’Malley, Shaaron Ainsworth, David Clarke, Ronald Carter, and Svenja Adolphs. 2008. Digital Replay system (DRS): A Tool for Interaction Analysis. In Proceedings of the International Conference on Learning Sciences (Workshop on Interaction Analysis). World Academy of Science, Engineering and Technology, Turkey, 12 pages. [5] Kelly Caine. 2016. Local Standards for Sample Size at CHI. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, USA, 981–992. https://doi.org/10.1145/2858036. 2858498 [6] Juan Casares, A. Chris Long, Brad A. Myers, Rishi Bhatnagar, Scott M. Stevens, Laura Dabbish, Dan Yocum, and Albert Corbett. 2002. Simplifying Video Editing"
    }, {
      "page": 9,
      "region": {
        "x1": 53.79800033569336,
        "x2": 176.6275634765625,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 8–13, 2021, Yokohama, Japan"
    }, {
      "page": 9,
      "region": {
        "x1": 53.80097961425781,
        "x2": 295.2235107421875,
        "y1": 88.83009338378906,
        "y2": 643.5870361328125
      },
      "text": "Using Metadata. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (London, England) (DIS ’02). ACM, New York, USA, 157–166. https://doi.org/10.1145/778712.778737 [7] Nan-Chen Chen, Margaret Drouhard, Rafal Kocielnik, Jina Suh, and Cecilia R. Aragon. 2018. Using Machine Learning to Support Qualitative Coding in Social Science: Shifting the Focus to Ambiguity, In Using Machine Learning to Support Qualitative Coding in Social Science: Shifting the Focus to Ambiguity. ACM Trans. Interact. Intell. Syst. 8, 2, Article 9, 20 pages. https://doi.org/10.1145/3185515 [8] Michael G. Christel, Michael A. Smith, C. Roy Taylor, and David B. Winkler. 1998. Evolving Video Skims into Useful Multimedia Abstractions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Los Angeles, California, USA) (CHI ’98). ACM Press/Addison-Wesley Publishing Co., USA, 171–178. https://doi.org/10.1145/274644.274670 [9] Christian Corsten, Chat Wacharamanotham, and Jan Borchers. 2013. Fillables: Everyday Vessels as Tangible Controllers with Adjustable Haptics. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). ACM, New York, USA, 2129–2138. https://doi.org/10.1145/2468356. 2468732 [10] Miguel Costa, Nuno Correia, and Nuno Guimarães. 2002. Annotations as Multiple Perspectives of Video Content. In Proceedings of the Tenth ACM International Conference on Multimedia (Juan-les-Pins, France) (MULTIMEDIA ’02). ACM, New York, USA, 283–286. https://doi.org/10.1145/641007.641065 [11] Pierre Dragicevic, Gonzalo Ramos, Jacobo Bibliowitcz, Derek Nowrouzezahrai, Ravin Balakrishnan, and Karan Singh. 2008. Video Browsing by Direct Manipulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). ACM, New York, USA, 237–246. https://doi.org/10.1145/1357054.1357096 [12] Jeanine Evers, Christina Silver, Katja Mruck, and Bart Peeters. 2011. Introduction to the KWALON Experiment: Discussions on Qualitative Data Analysis Software by Developers and Users. In Forum: Qualitative Social Research, Vol. 12. FQS, Berlin, Germany, 12 pages. https://doi.org/10.17169/fqs-12.1.1637 [13] Nigel G. Fielding and Raymond M. Lee. 2002. New Patterns in the Adoption and Use of Qualitative Software. Field Methods 14, 2 (May 2002), 197–216. https: //doi.org/10.1177/1525822X02014002005 [14] Adam Fouse, Nadir Weibel, Edwin Hutchins, and James D. Hollan. 2011. ChronoViz: A System for Supporting Navigation of Time-Coded Data. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). ACM, New York, USA, 299–304. https://doi.org/10.1145/ 1979742.1979706 [15] Sadaoki Furui. 2005. Spontaneous speech recognition and summarization. In The Second Baltic Conference on Human Language Technologies. AIP publishing, Melville, US, 39–50. [16] Andreas Girgensohn, John Boreczky, and Lynn Wilcox. 2001. Keyframe-Based User Interfaces for Digital Video. Computer 34, 9 (Sep. 2001), 61–67. https: //doi.org/10.1109/2.947093 [17] Dan B. Goldman, Chris Gonterman, Brian Curless, David Salesin, and Steven M. Seitz. 2008. Video Object Annotation, Navigation, and Composition. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (Monterey, CA, USA) (UIST ’08). ACM, New York, USA, 3–12. https: //doi.org/10.1145/1449715.1449719 [18] Nicky Hayes. 2013. Doing Qualitative Analysis In Psychology. Psychology Press, Hove, UK. 295 pages. [19] Karen Holtzblatt, Jessamyn Burns Wendell, and Shelley Wood. 2005. Rapid Contextual Design: A How-to Guide to Key Techniques for User-Centered Design. Elsevier/Morgan Kaufmann, San Francisco. https://doi.org/10.1016/B978-0-12354051-5.X5000-9 [20] Wolfgang Hürst and Patrick Stiegeler. 2002. User Interfaces for Browsing and Navigation of Continuous Multimedia Data. In Proceedings of the Second Nordic Conference on Human-Computer Interaction (Aarhus, Denmark) (NordiCHI ’02). ACM, New York, USA, 267–270. https://doi.org/10.1145/572020.572062 [21] Eric Isaacson. 2005. What You See Is What You Get: on Visualizing Music. In 6th International Conference on Music Information Retrieval Online Proceedings (ISMIR 2005). International Society for Music Information Retrieval, London, UK, 389–395. http://ismir2005.ismir.net/proceedings/index.html [22] Brigitte Jordan and Austin Henderson. 1995. Interaction Analysis: Foundations and Practice. Journal of the Learning Sciences 4, 1 (1995), 39–103. https://doi.org/ 10.1207/s15327809jls0401_2 [23] Thorsten Karrer, Malte Weiss, Eric Lee, and Jan Borchers. 2008. DRAGON: A Direct Manipulation Interface for Frame-Accurate in-Scene Video Navigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems"
    }, {
      "page": 9,
      "region": {
        "x1": 472.7720031738281,
        "x2": 558.2009887695312,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "Subramanian and Maas, et al."
    }, {
      "page": 9,
      "region": {
        "x1": 317.9512023925781,
        "x2": 559.3814697265625,
        "y1": 88.83009338378906,
        "y2": 641.9409790039062
      },
      "text": "(Florence, Italy) (CHI ’08). ACM, New York, USA, 247–250. https://doi.org/10. 1145/1357054.1357097 [24] Jongdae Kim, Charles Gray, Paul Asente, and John Collomosse. 2015. Comprehensible Video Thumbnails. Computer Graphics Forum 34, 2 (2015), 167–177. https://doi.org/10.1111/cgf.12550 [25] Eric Lee, Henning Kiel, and Jan Borchers. 2006. Scrolling Through Time: Improving Interfaces for Searching and Navigating Continuous Audio Timelines. Technical Report AIB-2006-17. RWTH Aachen University. http://sunsite.informatik.rwthaachen.de/Publications/AIB/2006/2006-17.pdf [26] Wendy E. Mackay and Michel Beaudouin-Lafon. 1998. DIVA: Exploratory Data Analysis with Multimedia Streams. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Los Angeles, California, USA) (CHI ’98). ACM Press/Addison-Wesley Publishing Co., USA, 416–423. https://doi.org/10. 1145/274644.274701 [27] Megh Marathe and Kentaro Toyama. 2018. Semi-Automated Coding for Qualitative Research: A User-Centered Inquiry and Initial Prototypes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, USA, 1–12. https://doi.org/10.1145/3173574. 3173922 [28] D. Thomas Markle, Richard E. West, and Peter J. Rich. 2011. Beyond Transcription: Technology, Change, and Refnement of Method. Forum: Qualitative Social Research 12, 3 (2011), 21 pages. https://doi.org/10.17169/fqs-12.3.1564 [29] Alan Marsden, Adrian Mackenzie, Adam Lindsay, Harriet Nock, John Coleman, and Greg Kochanski. 2007. Tools for Searching, Annotation and Analysis of Speech, Music, Film and Video—A Survey. Literary and Linguistic Computing 22, 4 (July 2007), 469–488. https://doi.org/10.1093/llc/fqm021 [30] Liliana Melgar, Marijn Koolen, Hugo Huurdeman, and Jaap Blom. 2017. A Process Model of Scholarly Media Annotation. In Proceedings of the 2017 Conference on Conference Human Information Interaction and Retrieval (Oslo, Norway) (CHIIR ’17). ACM, New York, USA, 305–308. https://doi.org/10.1145/3020165.3022139 [31] Liliana Melgar Estrada and Marijn Koolen. 2018. Audiovisual Media Annotation Using Qualitative Data Analysis Software: A Comparative Analysis. The Qualitative Report 23, 13 (March 2018), 40–60. https://nsuworks.nova.edu/tqr/vol23/ iss13/4 [32] Liliana María Melgar Estrada. 2015. From Social Tagging to Polyrepresentation: A Study of Expert Annotating Behavior of Moving Images. Ph.D. Dissertation. Universidad Carlos III de Madrid. http://hdl.handle.net/10016/22290 [33] Michael Mills, Jonathan Cohen, and Yin Yin Wong. 1992. A Magnifer Tool for Video Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). ACM, New York, USA, 93–98. https://doi.org/10.1145/142750.142764 [34] Jenny Reinhard. 2020. Participants, Incentives and User Studies: A Survey of CHI 2019. Bachelor thesis. RWTH Aachen University, Aachen, Germany. https: //hci.rwth-aachen.de/publications/reinhard2020a.pdf [35] Jane Ritchie, Jane Lewis, Carol McNaughton Nicholls, Rachel Ormston, et al. 2013. Qualitative Research Practice: A Guide for Social Science Students and Researchers. SAGE Publications, London, UK. [36] Anselm Strauss and Juliet Corbin. 1994. Grounded Theory Methodology. Handbook of qualitative research 17 (1994), 273–285. [37] Simon Tucker and Steve Whittaker. 2005. Novel Techniques for TimeCompressing Speech: an Exploratory Study. In Proceedings of the 2005 IEEE International Conference on Acoustics, Speech, and Signal Processing, Vol. 1. IEEE, Philadelphia, PA, 477–480. https://doi.org/10.1109/ICASSP.2005.1415154 [38] Jonathan Tummons. 2014. Using Software for Qualitative Data Analysis: Research Outside Paradigmatic Boundaries. In Studies in Qualitative Methodology, Martin Hand and Sam Hillyard (Eds.). Vol. 13. Emerald Group Publishing Limited, Bingley, UK, 155–177. https://doi.org/10.1108/S1042-319220140000013010 [39] Ron Weiss, Andrzej Duda, and David K. Giford. 1995. Composition and Search with a Video Algebra. IEEE MultiMedia 2, 1 (1995), 12–25. https://doi.org/10. 1109/93.368596 [40] Peter Wittenburg, Hennie Brugman, Albert Russel, Alex Klassmann, and Han Sloetjes. 2006. ELAN: A Professional Framework for Multimodality Research. In 5th International Conference on Language Resources and Evaluation (LREC 2006). European Language Resources Association (ELRA), Genoa, Italy, 1556–1559. https://archive.mpi.nl/tla/elan [41] Megan Woods, Trena Paulus, David P. Atkins, and Rob Macklin. 2016. Advancing Qualitative Research Using Qualitative Data Analysis Software (QDAS)? Reviewing Potential Versus Practice in Published Studies using ATLAS.ti and NVivo, 1994–2013. Social Science Computer Review 34, 5 (Oct. 2016), 597–617. https://doi.org/10.1177/0894439315596311"
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 387.3695983886719,
        "y1": 530.3840942382812,
        "y2": 537.2349853515625
      },
      "text": "REFERENCES"
    }
  }]
}