{
  "abstractText": {
    "page": 0,
    "region": {
      "x1": 53.52899932861328,
      "x2": 295.5609436035156,
      "y1": 307.41400146484375,
      "y2": 503.7749938964844
    },
    "text": "ABSTRACT Cinematic Virtual Reality (CVR), or 360° video, engages users in immersive viewing experiences. However, as users watch one part of the 360° view, they will necessarily miss out on events happening in other parts of the sphere. Consequently, fear of missing out (FOMO) is unavoidable. However, users can also experience the joy of missing out (JOMO). In a repeated measures, mixed methods design, we examined the fear and joy of missing out (FOMO and JOMO) and sense of presence in two repeat viewings of a 360° flm using a head-mounted display. We found that users experienced both FOMO and JOMO. FOMO was caused by the users’ awareness of parallel events in the spherical view, but users also experienced JOMO. FOMO did not compromise viewers’ sense of presence, and FOMO also decreased in the second viewing session, while JOMO remained constant. The fndings suggest that FOMO and JOMO can be two integral qualities in an immersive video viewing experience and that FOMO may not be as negative a factor as previously thought."
  },
  "figures": [{
    "caption": "Table 1: FOMO in the two viewing sessions in Conditions A (free choice), B (30-second timed rotation), and C (90-second timed rotation) analyzed using the sign test.",
    "captionBoundary": {
      "x1": 53.50199890136719,
      "x2": 294.3753356933594,
      "y1": 85.34053802490234,
      "y2": 113.27093505859375
    },
    "figType": "Table",
    "imageText": ["A", "4.48", "4.43", "(0.8)", "3.81", "3.5", "(1.2)", "29", "0.003***", "B", "3.42", "3.32", "(1.2)", "3.11", "2.95", "(1.3)", "16", "0.152", "C", "4.32", "4.12", "(1.4)", "3.15", "3.29", "(1.1)", "17", "0.064", "Note:", "***p", "<", "0.001", "Condition", "Session", "1", "Session", "2", "S", "p", "Mdn", "Mean", "(SD)", "Mdn", "Mean", "(SD)"],
    "name": "1",
    "page": 5,
    "regionBoundary": {
      "x1": 53.0,
      "x2": 295.0,
      "y1": 128.0,
      "y2": 201.02508544921875
    }
  }, {
    "caption": "Table 2: JOMO in the two viewing sessions in Conditions A (free choice), B (30-second timed rotation), and C (90-second timed rotation) analyzed using the sign-test.",
    "captionBoundary": {
      "x1": 317.66119384765625,
      "x2": 558.5346069335938,
      "y1": 85.33882904052734,
      "y2": 113.26922607421875
    },
    "figType": "Table",
    "imageText": ["A", "5.13", "5.25", "(1.04)", "4.83", "4.96", "(1.15)", "17", "1", "B", "5.70", "5.7", "(0.86)", "5.54", "5.64", "(0.85)", "15", "0.424", "C", "5.54", "5.56", "(0.91)", "5.67", "5.53", "(0.99)", "15", "0.21", "Condition", "Session", "1", "Session", "2", "S", "p", "Mdn", "Mean", "(SD)", "Mdn", "Mean", "(SD)"],
    "name": "2",
    "page": 5,
    "regionBoundary": {
      "x1": 317.0,
      "x2": 560.0,
      "y1": 128.0,
      "y2": 193.0
    }
  }, {
    "caption": "Table 3: Presence scores for Session 1 and Session 2 analyzed using a paired-sample sign test.",
    "captionBoundary": {
      "x1": 317.6523132324219,
      "x2": 558.19384765625,
      "y1": 85.33882904052734,
      "y2": 102.312255859375
    },
    "figType": "Table",
    "imageText": ["Note:", "***p", "<", "0.001,", "**p", "<", "0.01", "Presence", "Spatial", "5.86", "5.70", "(0.95)", "5.24", "5.18", "(1.18)", "75", "<0.001***", "Social", "5.03", "4.82", "(1.32)", "4.80", "4.61", "(1.48)", "67", "0.006**", "Body", "ownership", "Female", "4.57", "4.39", "(1.42)", "4.49", "4.37", "(1.52)", "39", "0.911", "Male", "3.21", "3.25", "(1.38)", "3.45", "3.40", "(1.47)", "32", "0.075", "Session", "1", "Session", "2", "Z/S", "p", "Mdn", "Mean", "(SD)", "Mdn", "Mean", "(SD)"],
    "name": "3",
    "page": 6,
    "regionBoundary": {
      "x1": 317.0,
      "x2": 586.0,
      "y1": 117.0,
      "y2": 222.93719482421875
    }
  }, {
    "caption": "Figure 2: An example participant in Condition A (free choice) who in the second round watched parts of the flm they missed in the frst round.",
    "captionBoundary": {
      "x1": 53.79800033569336,
      "x2": 558.202880859375,
      "y1": 187.00357055664062,
      "y2": 203.97698974609375
    },
    "figType": "Figure",
    "imageText": [],
    "name": "2",
    "page": 13,
    "regionBoundary": {
      "x1": 104.0,
      "x2": 508.0,
      "y1": 83.0,
      "y2": 174.0
    }
  }, {
    "caption": "Table 4: Side switches in the two viewing sessions in Condition A (free choice).",
    "captionBoundary": {
      "x1": 53.50199890136719,
      "x2": 295.6485900878906,
      "y1": 85.34053802490234,
      "y2": 102.31396484375
    },
    "figType": "Table",
    "imageText": ["•", "I", "wish", "I", "had", "spent", "more", "time", "watching", "the", "other", "side.", "–", "If", "[", "I", "would", "prefer", "watching", "one", "side", "of", "the", "flm", "in", "full", "at", "a", "time.", "]", ">", "4", "*", "Why", "would", "you", "prefer", "watching", "one", "side", "of", "the", "flm", "in", "full", "at", "a", "time?", "A", "17", "27", "(25)", "10", "16", "(19)", "Condition", "Session", "1", "Session", "2", "Mdn", "Mean", "(SD)", "Mdn", "Mean", "(SD)"],
    "name": "4",
    "page": 12,
    "regionBoundary": {
      "x1": 75.0,
      "x2": 294.0472412109375,
      "y1": 117.0,
      "y2": 229.21795654296875
    }
  }, {
    "caption": "Table 5: Rotational speed in the two viewing sessions in all the conditions. The units are degrees per second.",
    "captionBoundary": {
      "x1": 317.65899658203125,
      "x2": 558.2005004882812,
      "y1": 85.34053802490234,
      "y2": 102.31396484375
    },
    "figType": "Table",
    "imageText": ["(5)", "Why", "was", "it", "easy", "to", "choose", "which", "side", "to", "watch?", "(6)", "How", "did", "it", "feel", "to", "rewatch", "the", "video?", "(7)", "Why", "didn’t", "you", "have", "fun", "watching", "the", "video?", "(8)", "Why", "did", "you", "have", "fun", "watching", "the", "video?", "18.2", "13.9", "11.7", "11.8", "21.1", "(11.0)", "14.2", "(3.5)", "12.8", "(4.9)", "11.8", "(4.3)", "15.5", "14.0", "10.2", "12.2", "16.1", "(8.1)", "13.8", "(2.5)", "11.8", "(4.2)", "12.1", "(4.6)", "A", "B", "C", "D", "Condition", "Session", "1", "Session", "2", "Mdn", "Mean", "(SD)", "Mdn", "Mean", "(SD)"],
    "name": "5",
    "page": 12,
    "regionBoundary": {
      "x1": 328.8669738769531,
      "x2": 537.0,
      "y1": 117.0,
      "y2": 251.093505859375
    }
  }, {
    "caption": "Figure 1: Example of the participants’ viewing patterns in each condition. Positive yaw (blue) indicates that the participant was looking at the female’s side, and negative yaw (green) indicates that the participant was looking at the male’s side.",
    "captionBoundary": {
      "x1": 53.448333740234375,
      "x2": 558.202880859375,
      "y1": 385.8995361328125,
      "y2": 402.8729248046875
    },
    "figType": "Figure",
    "imageText": [],
    "name": "1",
    "page": 3,
    "regionBoundary": {
      "x1": 79.0,
      "x2": 533.0,
      "y1": 83.0,
      "y2": 373.0
    }
  }],
  "sections": [{
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0453186035156,
        "y1": 519.6950073242188,
        "y2": 551.669921875
      },
      "text": "CCS CONCEPTS • Human-centered computing → Virtual reality; Empirical studies in HCI."
    }, {
      "page": 0,
      "region": {
        "x1": 53.57400131225586,
        "x2": 294.0419006347656,
        "y1": 567.5919799804688,
        "y2": 599.5700073242188
      },
      "text": "KEYWORDS virtual reality, presence, embodiment, FOMO, JOMO, immersive technologies, storytelling, 360° video"
    }, {
      "page": 0,
      "region": {
        "x1": 53.31680679321289,
        "x2": 294.8095703125,
        "y1": 621.4981079101562,
        "y2": 707.3472290039062
      },
      "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for proft or commercial advantage and that copies bear this notice and the full citation on the frst page. Copyrights for components of this work owned by others than ACM must be honored. Abstracting with credit is permitted. To copy otherwise, or republish, to post on servers or to redistribute to lists, requires prior specifc permission and/or a fee. Request permissions from permissions@acm.org. CHI ’21, May 8–13, 2021, Yokohama, Japan © 2021 Association for Computing Machinery. ACM ISBN 978-1-4503-8096-6/21/05. . . $15.00 https://doi.org/10.1145/3411764.3445183"
    }, {
      "page": 0,
      "region": {
        "x1": 317.6600036621094,
        "x2": 559.430419921875,
        "y1": 309.3860778808594,
        "y2": 384.47198486328125
      },
      "text": "ACM Reference Format: Tanja Aitamurto, Andrea Stevenson Won, Sukolsak Sakshuwong, Byungdoo Kim, Yasamin Sadeghi, Krysten Stein, Peter Royal, and Catherine Lynn Kircos. 2021. From FOMO to JOMO: Examining the Fear and Joy of Missing Out and Presence in a 360° Video Viewing Experience. In CHI Conference on Human Factors in Computing Systems (CHI ’21), May 8–13, 2021, Yokohama, Japan. ACM, New York, NY, USA, 14 pages. https://doi.org/10.1145/3411764. 3445183"
    }]
  }, {
    "paragraphs": [{
      "page": 0,
      "region": {
        "x1": 317.6409912109375,
        "x2": 559.58349609375,
        "y1": 427.5199279785156,
        "y2": 521.0460205078125
      },
      "text": "Cinematic Virtual Reality (CVR), or 360° video, engages users in immersive viewing experiences [2, 40, 42, 48, 69, 74]. 360° video uses either computer-generated imagery (CGI) or photorealistic footage. In this paper, we focus on photorealistic 360° video and use the terms 360° video and Cinematic Virtual Reality (CVR) interchangeably. As users watch one part of the 360° view, they will necessarily miss out on other parts of the sphere. Consequently, the fear of missing out (FOMO) on important aspects of the storyline is unavoidable in a 360° video viewing experience [2, 51, 73, 75]."
    }, {
      "page": 0,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.1890869140625,
        "y1": 526.1499633789062,
        "y2": 608.7149658203125
      },
      "text": "FOMO has been much studied in the context of social media and defned as the feelings of concern and anxiety that can arise when one is presented with a variety of mutually exclusive options and the freedom to choose among them [3, 11, 13, 18, 19, 46, 55]. However, despite expanding consumer use of 360° video, studies on FOMO in virtual reality (VR) contexts are sparse. In immersive storytelling, FOMO has been described as a negative factor that distracts users and may compromise their sense of presence [2, 51, 73]."
    }, {
      "page": 0,
      "region": {
        "x1": 317.7489929199219,
        "x2": 559.587646484375,
        "y1": 613.8209838867188,
        "y2": 707.3469848632812
      },
      "text": "The concept of the joy of missing out (JOMO) has emerged alongside FOMO. JOMO refers to positive feelings, such as joy and excitement, that arise when one has an abundance of mutually exclusive options and the freedom to choose among them [14, 22, 79]. Similar to FOMO, JOMO is a potentially useful concept for characterizing factors shaping immersive storytelling experiences. Inquiry into FOMO and JOMO in CVR is particularly timely as social, shared VR experiences are becoming more common [44, 71, 77]. As a result, the FOMO and JOMO that people feel about"
    }, {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0464172363281,
        "y1": 87.79393005371094,
        "y2": 104.60797119140625
      },
      "text": "an abundance of options on social media could translate to VR experiences."
    }, {
      "page": 1,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5574951171875,
        "y1": 109.71195983886719,
        "y2": 323.7860107421875
      },
      "text": "To further our understanding of FOMO and JOMO in immersive storytelling, we explored how users experience FOMO and JOMO when viewing a 360° video in a head-mounted display. We ask how having the freedom to choose the feld of view (FOV) afects users’ FOMO, JOMO, and sense of presence. To accomplish this, we manipulated an aspect of the viewing experience that is normally under the viewer’s control: changes in the FOV. We used a split-sphere 360° video as a stimulus. In a split-sphere 360° video the spherical view is split into two 180° parts, with each part representing one perspective on the storyline. To keep up with the story, the user has to rotate actively to change the feld of view (FOV) within the 360° sphere. FOMO and JOMO can be particularly salient when viewing such a video. Participants viewed the split-sphere 360° video in a mixed-methods, between subjects experiment with four conditions. In the free choice condition, participants had the most freedom to choose the FOV and manage their awareness of parallel events in the 360°sphere. In two timed rotation conditions, the researchers rotated the participants at 30- or 90-second intervals, so they were aware of the parallel events but could not control rotation. In the 180° view condition, viewers could only view half of the sphere."
    }, {
      "page": 1,
      "region": {
        "x1": 53.654998779296875,
        "x2": 295.4233093261719,
        "y1": 328.8899230957031,
        "y2": 433.3729248046875
      },
      "text": "We used a repeated measures design to gauge the evolution of the user experience over the course of two viewing sessions. As consumer VR further penetrates the market and CVR experiences become more common among consumers, users will have the choice to revisit CVR content at will. To our knowledge, previous research has not yet examined how repeated viewings of CVR content might afect the user experience, yet this could be a key contributor to many aspects of the user experience, and especially FOMO and JOMO. Therefore, it is important and timely to examine the efects of repeated viewings on the user experience in immersive storytelling."
    }, {
      "page": 1,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.03411865234375,
        "y1": 438.47894287109375,
        "y2": 499.12799072265625
      },
      "text": "This exploratory study examines the efect of multiple viewings on FOMO, JOMO, and presence, and takes the frst step towards conceptualizing JOMO in immersive storytelling. Following this, we ofer recommendations for storytellers and designers to better leverage the dynamics of FOMO and JOMO for an enjoyable and immersive 360° video viewing experience."
    }],
    "title": {
      "page": 0,
      "region": {
        "x1": 317.9549865722656,
        "x2": 420.68597412109375,
        "y1": 412.3559875488281,
        "y2": 419.6759948730469
      },
      "text": "1 INTRODUCTION"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 157.587158203125,
        "y1": 516.2169799804688,
        "y2": 523.5369873046875
      },
      "text": "2 RELATED WORK"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 53.48400115966797,
        "x2": 295.52471923828125,
        "y1": 547.0719604492188,
        "y2": 673.4739990234375
      },
      "text": "Fear of missing out (FOMO) arises in situations in which a user has more than one option. It refers to the anxiety people feel when choosing to do one thing results in missing out on another activity. An abundance of choices can cause anxiety, fear of making a “wrong” choice, and, eventually, regret [46]. Most research on FOMO has examined its association with social media use [13, 25, 34, 39, 55]. In this context, FOMO has been defned as a pervasive apprehension that others are having more rewarding experiences than oneself and a desire to stay continuously connected with what others are doing by monitoring communication platforms such as social media [13, 55]. FOMO is associated with a decreased sense of well-being due to feelings of anxiety, concern, and stress [3, 11, 13, 18, 19, 55]."
    }, {
      "page": 1,
      "region": {
        "x1": 53.57400131225586,
        "x2": 294.7620544433594,
        "y1": 678.5779418945312,
        "y2": 695.3919677734375
      },
      "text": "FOMO has also been identifed in VR, particularly in 360° video viewing experiences [2, 51, 60, 73]. The omnidirectional view in 360°"
    }, {
      "page": 1,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.71533203125,
        "y1": 87.79393005371094,
        "y2": 279.95001220703125
      },
      "text": "video provides multiple felds of view (FOV) from which the user can choose. By choosing to watch one slice of the 360° sphere, the user misses out on events occurring elsewhere in the sphere. 360° video can thus cause users to experience FOMO. In CVR, FOMO refers to the viewers’ concern about missing important parts of the story [2, 47, 73]. Previous studies have described FOMO as a negative factor that can distract the user, decrease enjoyment, and risk compromising the immersive experience [2, 51, 70, 73, 75, 80]. To address these issues and help users focus their attention in the spherical view, designers have started to develop solutions to mitigate FOMO [16, 26, 63, 76]. These solutions include visual indicators and diegetic cues, such as sound and audiovisual guidance, which are provided to the user during the viewing experience [35, 48, 59]. FOMO, however, could also have positive efects. Newton and Soukup [47] suggest that the awareness of multiple, parallel options for choosing the FOV could nudge the viewer to actively use the full spherical view instead of sticking with only one focal point."
    }, {
      "page": 1,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7218627929688,
        "y1": 285.0539245605469,
        "y2": 356.6629943847656
      },
      "text": "In this study, we defne FOMO in 360° video as a fear of missing out on parts of the narrative occurring outside of the viewer’s current feld of view. Developing a better understanding of the nature of FOMO in the context of 360° video will help us understand the user experience of CVR storytelling, compose more engaging stories, and design functional technologies to mediate them. Therefore, we propose the following research question:"
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.7429809570312,
        "y1": 361.6034851074219,
        "y2": 378.5799865722656
      },
      "text": "RQ1a How do users experience the fear of missing out (FOMO) in a 360° video viewing experience?"
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 53.79800033569336,
        "x2": 264.2236328125,
        "y1": 531.9042358398438,
        "y2": 539.2242431640625
      },
      "text": "2.1 The Fear of Missing Out in 360° Video"
    }
  }, {
    "paragraphs": [{
      "page": 1,
      "region": {
        "x1": 317.81201171875,
        "x2": 559.7134399414062,
        "y1": 415.56494140625,
        "y2": 563.885009765625
      },
      "text": "Joy of missing out (JOMO) refers to feelings of enjoyment prompted by being able to choose not to participate, to “opt out” of keeping up with and engaging in social activities [5, 14, 22, 79]. A key aspect of JOMO is the freedom to choose where to direct one’s attention [22, 53]. JOMO arises in situations in which the user has an abundance of choices. The user is aware of alternatives and enjoys the opportunity to choose and the choices they make. Although FOMO and JOMO are often framed as opposite, antagonistic factors, they are not necessarily mutually exclusive and may occur simultaneously during an immersive viewing experience. The user may feel concern and anxiety while trying to capture the full storyline but may also simultaneously experience positive feelings, such as joy and excitement about the choice of content. Thus, the user could experience FOMO and JOMO as co-occurring factors."
    }, {
      "page": 1,
      "region": {
        "x1": 317.9515380859375,
        "x2": 559.1903076171875,
        "y1": 568.9889526367188,
        "y2": 673.4739990234375
      },
      "text": "Despite increasing attention to JOMO in the popular press [20, 54, 57], JOMO remains an understudied phenomenon in academic scholarship. JOMO has been mentioned as an observation in a study about disconnecting from mobile use [4], yet no formal studies about JOMO have been conducted to our knowledge. 360° video creates a user experience in which positive feelings similar to JOMO could be present. Freedom to choose the FOV could induce feelings of enjoyment, excitement, and control. In this paper, we examine these positive feelings as JOMO in the 360° viewing experience, asking the following question:"
    }, {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 558.74267578125,
        "y1": 678.4144287109375,
        "y2": 695.3919677734375
      },
      "text": "RQ1b How do users experience the joy of missing out (JOMO) in a 360° video viewing experience?"
    }],
    "title": {
      "page": 1,
      "region": {
        "x1": 317.9549865722656,
        "x2": 523.0023803710938,
        "y1": 400.4010009765625,
        "y2": 407.72100830078125
      },
      "text": "2.2 The Joy of Missing Out in 360° Video"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 52.78499984741211,
        "x2": 295.56390380859375,
        "y1": 101.49192810058594,
        "y2": 216.93701171875
      },
      "text": "A key quality of immersive media such as 360° video is the user’s sense of presence, which refers to the psychological state of experiencing the virtual environment as the one in which the user is consciously present [38, 56, 65, 67]. Spatial or environmental presence refers to the feeling of being in the virtual environment, the sense of “being there” [28, 33]. Social presence is the feeling of “being with others” or perceiving virtual social actors as actual social actors [10, 33]. Another aspect of presence is self-presence, also referred to as body ownership or embodiment, which refers to the user’s illusory perception of a virtual body as their own—an experience that a frst-person VR experience can create [12, 31, 41, 64, 66]."
    }, {
      "page": 2,
      "region": {
        "x1": 53.57400131225586,
        "x2": 295.563232421875,
        "y1": 222.0399627685547,
        "y2": 348.4429931640625
      },
      "text": "Decades of work have examined presence and self-presence or body ownership in VR experiences, mostly based on computer generated imagery (CGI) environments [28, 33] and computergenerated avatars [24, 27, 52, 61]. More recent studies show that photorealistic 360° video can also create a sense of presence similar to CGI-based VR experiences [2, 45, 69, 73, 74]. A sense of body ownership may also be possible to achieve in a photorealistic 360° video, in which the cameras are rigged on the actors to simulate their frst-person perspectives. The relationship between sense of presence and FOMO/JOMO is unknown, but sense of presence is a key element of an immersive storytelling experiences [15]. We therefore pose the following research question:"
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.4327087402344,
        "y1": 353.38348388671875,
        "y2": 370.3609924316406
      },
      "text": "RQ2 What is the association between FOMO and JOMO and users’ sense of presence in an immersive video viewing experience?"
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 232.3363494873047,
        "y1": 86.3289794921875,
        "y2": 93.64898681640625
      },
      "text": "2.3 Sense of Presence in 360° Video"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.4273376464844,
        "y1": 416.5609130859375,
        "y2": 542.9639892578125
      },
      "text": "Due to the advent of inexpensive consumer VR devices, users can now view 360° video content at home. This difers from the past, in which traditional, CGI-based VR experiences mostly took place in research labs. The user experience of watching 360° video at home can difer signifcantly from that of lab-based experiences. One diference is that the user can decide to rewatch 360° videos at will, similarly to how other consumer content is consumed, such as episodes of television shows. This evolution of the user experience of 360° video prompts an important question about how the user’s reactions to the virtual content may develop over the course of several viewings, or when the user is aware that they have the option to revisit content. We thus ask:"
    }, {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.0452880859375,
        "y1": 547.9044799804688,
        "y2": 564.8820190429688
      },
      "text": "RQ3 How does viewing the 360° video content more than once afect FOMO, JOMO, and sense of presence?"
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 273.9654235839844,
        "y1": 388.44598388671875,
        "y2": 408.715087890625
      },
      "text": "2.4 Efects of Repeated Viewings on FOMO, JOMO, and Sense of Presence"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 249.60546875,
        "y1": 582.9660034179688,
        "y2": 590.2860107421875
      },
      "text": "3 METHODS, DATA, AND MEASURES"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 53.52899932861328,
        "x2": 294.2794494628906,
        "y1": 613.8209838867188,
        "y2": 707.3469848632812
      },
      "text": "The stimulus was a 10-minute, fctional 360° flm called UTURN produced by NativeVR [43]. The flm is situated in a technology startup in San Francisco. The female engineer and the male CTO are the lead actors. The team’s female engineer works hard, but her work goes unrecognized by the company executives. In most scenes, the main characters operate in diferent environments: the female engineer works at the company’s ofce, while the male CTO travels to New York to raise funding. The flm shows him at his hotel room and in meetings and dinner with prospective funders. The"
    }, {
      "page": 2,
      "region": {
        "x1": 317.68975830078125,
        "x2": 559.5843505859375,
        "y1": 87.79393005371094,
        "y2": 159.4019775390625
      },
      "text": "360° sphere of the flm is vertically divided into two 180° spheres, each of which shows one character’s frst-person point of view. The two concurrent sides of the story run in parallel: while the user is watching one side, the other main character’s narrative also proceeds on the other side. By choosing the FOV in the 360° view, the user can watch the engineer solve technical problems or follow the CTO’s preparation for the pitch."
    }, {
      "page": 2,
      "region": {
        "x1": 317.73529052734375,
        "x2": 558.2117919921875,
        "y1": 164.50596618652344,
        "y2": 268.99102783203125
      },
      "text": "The flm was shot with a modifed two-camera GoPro rig. The cameras were rigged on the two main actors’ heads to provide the viewer a frst-person perspective, allowing the viewer to see part of each main actor’s body and hands when looking down. The video has spatialized sound that adjusts according to the user’s head position. When the user’s view centers on the midline between the two 180° sides, the user sees a thin black divider line along with about 30° of both views and hears dialogue from both sides. As the user’s FOV approaches this midline, sound cues from the other side of the sphere become increasingly audible."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 53.79800033569336,
        "x2": 236.75453186035156,
        "y1": 598.6532592773438,
        "y2": 605.9732666015625
      },
      "text": "3.1 Stimulus: 360° Split-Sphere Film"
    }
  }, {
    "paragraphs": [{
      "page": 2,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.1864624023438,
        "y1": 306.971923828125,
        "y2": 422.4159851074219
      },
      "text": "The between-subjects, mixed method experiment was conducted in July-September 2018. 119 participants were randomly assigned to watch the video in one of the four conditions: as a 360° split sphere in a HMD, freely choosing the FOV in the 360° sphere (Condition A, also called “Free choice”); as a 360° split sphere in a HMD, in timed rotation to another FOV every 30 seconds (Condition B, “30-second timed rotation”); as a 360° split sphere in a HMD, in timed rotation every 90 seconds (Condition C, “90-second timed rotation”); or as a half-sphere 180° flm, seeing the flm from start to fnish from each perspective, with the backside of the video being blank (Condition D, “180° view”)."
    }, {
      "page": 2,
      "region": {
        "x1": 317.7263488769531,
        "x2": 559.7171630859375,
        "y1": 427.5199279785156,
        "y2": 619.676025390625
      },
      "text": "Whether participants started from the female or male characters’ perspective frst was counterbalanced across conditions. In the second round, they started from the opposite perspective. Thus, all participants saw the entire flm over the course of the two sessions. In condition A, participants were free to rotate between the two viewpoints. In condition D, participants watched one 180° view from start to fnish in each round. In conditions B and C, the researcher rotated the participants’ from one FOV to another at 30- or 90-second intervals by rotating the swivel chair. We tracked the rotation time intervals by recording the lap rounds using a stop watch and rotational tracking. If the timing and frequency of the rotation were not consistent, the data were removed. Figure 1 shows the participants’ rotational activity in each condition. Participants were not told in advance that they would see the video twice to avoid afecting their experience during the frst viewing session. The two viewing sessions allowed us to examine the evolution of FOMO, JOMO, and presence between the frst and second viewings."
    }, {
      "page": 2,
      "region": {
        "x1": 317.7388916015625,
        "x2": 559.7174072265625,
        "y1": 624.7799682617188,
        "y2": 707.3469848632812
      },
      "text": "The four conditions represented diferent types of viewing experiences, where FOMO, JOMO, and presence could potentially vary. In the free choice condition (A), the user could freely rotate to choose the FOV in the 360° sphere to gain awareness of simultaneous events. In the timed rotation conditions (B and C), the user did not have the ability to choose the FOV but had awareness of simultaneous events. The two frequencies for alternating the FOV in Conditions B (every 30 seconds) and C (every 90 seconds) were"
    }, {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.5574951171875,
        "y1": 425.21392822265625,
        "y2": 485.8630065917969
      },
      "text": "chosen to vary the degree to which participants had access to simultaneous events occurring on the two sides of the spherical view. The 180° viewing modality (Condition D) provided a single perspective on the storyline from start to fnish of a session. The viewer could then get the full story. Condition D provided a point of comparison for presence."
    }],
    "title": {
      "page": 2,
      "region": {
        "x1": 317.9549865722656,
        "x2": 437.9114685058594,
        "y1": 291.8079833984375,
        "y2": 299.12799072265625
      },
      "text": "3.2 Experiment Design"
    }
  }, {
    "paragraphs": [{
      "page": 3,
      "region": {
        "x1": 53.36800003051758,
        "x2": 295.56243896484375,
        "y1": 515.1909790039062,
        "y2": 575.8410034179688
      },
      "text": "We recruited participants via email and posters, and they received a gift card as compensation. Each session with a participant lasted about 75 minutes. Participants frst flled out an IRB-approved consent form and a pre-questionnaire in which they answered demographic questions and attitudes toward VR and new technologies. We report these results in the section “Sample Profle.”"
    }, {
      "page": 3,
      "region": {
        "x1": 53.796417236328125,
        "x2": 295.4286804199219,
        "y1": 580.9449462890625,
        "y2": 630.635009765625
      },
      "text": "All participants were seated in a swivel chair and then received a demo of the video in a headset. In the timed rotation conditions, the participants practiced side switching rotation with the researcher. Participants viewed the video twice and flled out a survey after each viewing."
    }, {
      "page": 3,
      "region": {
        "x1": 53.464080810546875,
        "x2": 295.5574951171875,
        "y1": 635.7389526367188,
        "y2": 707.3438720703125
      },
      "text": "Participants wore a Samsung Gear VR head-mounted display with a Samsung Galaxy S6 mobile phone and Bose QuietComfort 35 headphones. The participants’ head rotation was tracked in the HMD. The HMD sensor recorded approximately 60 events/second. Each event includes the yaw (horizontal movement) and pitch (vertical movement) of the user’s head and the time duration of the event, which is approximately 1/60 second. Some data loss occurred: Both"
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7171630859375,
        "y1": 580.9449462890625,
        "y2": 707.3469848632812
      },
      "text": "In this study, 106 people participated from the communities surrounding two universities on the east and west coasts of the United States. Eight participants were eliminated in total from Conditions B and C because of uneven rotation intervals. In addition, fve participants were eliminated because they had seen the flm before, or they had omitted or incorrectly repeated sections of the survey data. This left 106 participants, of whom 51 were women and one person preferred not to state their gender. After removals, Condition A had 34 participants (16 female, one preferred not to report), B had 25 (13 female), C 24 (10 female) and D 23 (12 female). The participants were a young, educated, and international crowd. The majority (85%) were between 18 and 34 years old. 72% had either a"
    }, {
      "page": 3,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7152099609375,
        "y1": 425.2071228027344,
        "y2": 474.90399169921875
      },
      "text": "viewing sessions were completely captured for 96 of the 119 participants. Participants whose sessions were not completely captured were discarded. After exclusions, Condition A had 31 participants, B 22, C 20, and D 23. Full rotational data analysis is reported in the Appendix."
    }, {
      "page": 3,
      "region": {
        "x1": 317.6679992675781,
        "x2": 559.7216796875,
        "y1": 480.0079345703125,
        "y2": 551.6170043945312
      },
      "text": "This paper is a part of a larger study, in which we examined several aspects of an immersive viewing experience, including participants’ reasons to choose a FOV [78] and usability. The anonymized data reported in this paper is available at the OSF archive: https: //osf.io/3f9vr/. In addition, the raw data and code are published at the Cornell Institute for Social and Economic Research, which is linked to through our OSF repository."
    }, {
      "page": 3,
      "region": {
        "x1": 317.9549865722656,
        "x2": 402.67498779296875,
        "y1": 565.781005859375,
        "y2": 573.1010131835938
      },
      "text": "3.4 Participants"
    }, {
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.5799255371094,
        "y1": 87.79393005371094,
        "y2": 148.4429931640625
      },
      "text": "Bachelor’s, Master’s or doctorate degree. Most participants (52%) were born outside the United States. The majority of participants (55%) had never watched a 360° video. One-third had never used a HMD before, one-third had used a HMD once, and one-ffth had used a HMD 2-4 times. Most of the participants did not play video games actively: 43% played once a year and 31% never."
    }],
    "title": {
      "page": 3,
      "region": {
        "x1": 53.79800033569336,
        "x2": 128.89625549316406,
        "y1": 500.0269775390625,
        "y2": 507.34698486328125
      },
      "text": "3.3 Procedure"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.55560302734375,
        "y1": 178.32896423339844,
        "y2": 260.89697265625
      },
      "text": "Participants flled out surveys before viewing the videos and after the frst and second viewings of the flm. A full listing of the questions can be found in the Appendix. Survey questions included both Likert-type scales and open-ended questions. In order to capture subtle changes in surveys taken in the same experimental session, we used a continuous rating scale with two decimal places rather than discrete 1-7 point scales, so that participants would not be biased by remembering their exact previous ratings."
    }, {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.55889892578125,
        "y1": 272.3518981933594,
        "y2": 333.0010070800781
      },
      "text": "3.5.1 Spatial and Social Presence and Body Ownership. We used measures for presence and body ownership from [1, 21, 49, 50]. We averaged spatial presence from a 4-item scale (α=.86), social presence a 4-item scale (α=.91) and self-presence and body ownership using a 3-item scale (α= .87.) The questions for each scale are listed in the Appendix."
    }, {
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5616760253906,
        "y1": 344.4559326171875,
        "y2": 558.531005859375
      },
      "text": "3.5.2 Fear of Missing Out. Existing measures for FOMO have been developed for social media contexts and therefore refer to apprehension about missing out on or learning about friends’ rewarding experiences [3, 13, 18, 46, 55]. We adapted items from these measures based on fndings from CVR studies in which FOMO has been observed [2, 47], with a goal to capture feelings associated with FOMO such as distraction, frustration, concern about missing scenes playing out on the other side of the 360 °sphere, and regret over the choices made. Our 5-item scale (α=.84) included the following statements: “The fear of missing out on parts of the story distracted me when watching the video”; “I felt frustrated because I couldn’t see the both sides of the story in full”; “I was concerned that while I was watching one side, there were more important events happening on the other side”; “I wish I had spent more time watching the other side”; “I would prefer watching one side of the flm in full at a time.” Participants answered these questions in Conditions A, B, and C, in which the participants had access to the two parallel storylines and therefore could experience FOMO. Because participants assigned to Condition D did not have simultaneous access to both storylines, FOMO was not measured in Condition D."
    }, {
      "page": 4,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.5802307128906,
        "y1": 569.9859619140625,
        "y2": 707.3469848632812
      },
      "text": "3.5.3 Joy of Missing Out. Due to a lack of existing measures for JOMO, we developed a scale to measure JOMO based on fndings from [2, 4, 22, 47, 53]. The scale measured fun, excitement and joy associated with (1) the awareness of the two parallel storylines and (2) the freedom to choose the FOV. We measured JOMO in Conditions A, B and C using a 3-item scale (α=.82), which included the following statements: “It was exciting that the story proceeded on two sides at the same time”; “It was fun to switch the sides while watching the flm”; “I enjoyed switching between the two perspectives.” We further examined factors related to FOMO and JOMO in the viewing experience in the free choice condition (A) with a single question that asked participants how easy it was to choose the feld of view in the 360° sphere."
    }, {
      "page": 4,
      "region": {
        "x1": 317.7309875488281,
        "x2": 559.7144775390625,
        "y1": 88.52468872070312,
        "y2": 170.36102294921875
      },
      "text": "3.5.4 Open-ended Qestions about FOMO, JOMO, and User Experience. We also examined FOMO and JOMO with open-ended questions:“Why was/wasn’t it exciting that the story proceeded on two sides simultaneously?”; “Please describe how it felt to feel distracted”; “Why would/wouldn’t you prefer watching one side of the flm in full at a time?”; “Why was it difcult/easy to choose which side to watch?”; “Why did/didn’t you have fun while watching the video?”"
    }, {
      "page": 4,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.1903686523438,
        "y1": 175.46495056152344,
        "y2": 247.072998046875
      },
      "text": "We analyzed the open-ended survey answers using an analytical coding system [68]. We employed open coding in the frst round of analysis to discern key themes and patterns in the data that then guided further analysis. The conceptual framework of FOMO and JOMO from the existing literature also guided the analysis. Finally, we applied selective coding to integrate and synthesize the results, which we report in the Findings section."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 53.79800033569336,
        "x2": 125.00170135498047,
        "y1": 163.166015625,
        "y2": 170.48602294921875
      },
      "text": "3.5 Measures"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.5828247070312,
        "y1": 282.68792724609375,
        "y2": 387.1730041503906
      },
      "text": "Because the data for the presence, FOMO, and JOMO scales were not normally distributed, we analyzed the data with non-parametric tests. The diferences between the conditions were analyzed using the Kruskal-Wallis test [30, 62] and the Dunn test as a post-hoc test. P-values were adjusted using the Benjamini-Hochberg method [7]. Because we used presence, FOMO, and JOMO as outcome measures both between conditions and between Session 1 and Session 2, we adjusted our alpha from .05 to .025 for these sets of analyses. The diferences between the two viewing rounds per condition were analyzed using a dependent samples sign test."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 411.1950378417969,
        "y1": 267.52398681640625,
        "y2": 274.843994140625
      },
      "text": "3.6 Data Analysis"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 386.0605163574219,
        "y1": 407.6239929199219,
        "y2": 414.9440002441406
      },
      "text": "4 FINDINGS"
    }
  }, {
    "paragraphs": [{
      "page": 4,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7166137695312,
        "y1": 438.47894287109375,
        "y2": 521.0460205078125
      },
      "text": "4.1.1 Fear of Missing Out Across the Rotation Conditions. To address RQ1a about FOMO in the 360° video viewing experience, we analyzed the diferences in the FOMO scale between the free choice condition (A) and the two timed rotation conditions (B and C). We only found a diference in FOMO between the free choice condition (A) and the 30-second timed rotation condition (B) in the frst viewing session ( 2χ =12.45, p=0.006), and FOMO was greater in the free choice condition."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549255371094,
        "x2": 558.441162109375,
        "y1": 526.1499633789062,
        "y2": 619.676025390625
      },
      "text": "These results suggest that the key factor driving FOMO may be awareness of simultaneous events, with or without the freedom or need to choose the FOV. This indicates that FOMO seemed to result from awareness of options rather than the freedom or the need to choose, which was absent in the timed rotation conditions B and C. Viewers in Condition B (30-second timed rotation) may have reported less FOMO because they felt they had more access to all events, since they saw at least part of all scenes due to the rapid rate of rotation."
    }, {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7146606445312,
        "y1": 624.7799682617188,
        "y2": 707.3469848632812
      },
      "text": "In the free choice condition, there was a statistically signifcant decrease in FOMO between the frst and second viewing sessions, as Table 1 shows. In contrast, there were no signifcant changes between the viewing sessions in the timed rotation conditions (B and C). Consequently, in the second viewing session, there were no statistically signifcant diferences in FOMO between the conditions ( 2χ =3.25, p=0.355). This result suggests that FOMO may not be a permanent feature of a 360° video storytelling experience."
    }, {
      "page": 5,
      "region": {
        "x1": 53.36800003051758,
        "x2": 294.28106689453125,
        "y1": 227.96092224121094,
        "y2": 244.7750244140625
      },
      "text": "When users can view the same content multiple times, FOMO may decrease over the course of multiple viewings."
    }, {
      "page": 5,
      "region": {
        "x1": 52.78499984741211,
        "x2": 295.5574951171875,
        "y1": 256.5079040527344,
        "y2": 371.9519958496094
      },
      "text": "4.1.2 FOMO as Concern and Anxiety. In their open-ended survey answers, the participants described FOMO as a concern about missing out on important parts of the story and distraction associated with frustration over not being able to view the content in full. “While watching one storyline, I would be engaged with it, but at the back of my head I’d be wondering if there was something going on on the other side so I would feel a need to keep going back and forth to make sure I did not miss anything major on either side” (68A). “The only thing that concerned me is that I could have had missed out important information or nuances of one of the characters given the two stories were so parallel” (24A)."
    }, {
      "page": 5,
      "region": {
        "x1": 53.46699905395508,
        "x2": 294.04974365234375,
        "y1": 377.0559387207031,
        "y2": 426.7460021972656
      },
      "text": "The participants described FOMO as both a constant feeling and an intermittent concern: “There was the constant sense that you might miss an important aspect of the story” (4A). “At times, I was concerned that I had missed a key moment in the story that occurred on the other side” (39A)."
    }, {
      "page": 5,
      "region": {
        "x1": 52.77870178222656,
        "x2": 295.1005859375,
        "y1": 431.84991455078125,
        "y2": 503.4590148925781
      },
      "text": "The participants described FOMO similarly in Conditions A, B, and C—whether they could choose the FOV (as in the free choice condition) or were assigned to it (as in the timed rotation conditions): “I did not want to miss things going on one side after the transition to the other side happened” (24C). “This one gave a little bit anxiety about whether I was missing something important to the plot, what I missed, can I still understand the story” (20B)."
    }, {
      "page": 5,
      "region": {
        "x1": 53.57400131225586,
        "x2": 294.0464172363281,
        "y1": 515.1909790039062,
        "y2": 564.8820190429688
      },
      "text": "4.1.3 Ease and Dificulty of Choosing the FOV. In the free choice condition, the ease of choosing the FOV increased between the viewing sessions based on the paired t-test (t=−3.2, p=0.003) (Mean Round 1: 4.23 (SD:1.52); Mean Round 2: 5.06 (SD:1.18); Median Round 1: 4.19; Median Round 2 :5)."
    }, {
      "page": 5,
      "region": {
        "x1": 52.78499984741211,
        "x2": 295.1005554199219,
        "y1": 569.9859619140625,
        "y2": 707.3469848632812
      },
      "text": "FOMO was the main reason for difculty in choosing the feld of view. In the frst viewing session, the participants were equally divided between those who found choosing the FOV more difcult than easy (50% of the respondents) and those who found choosing more easy than difcult (50% of the respondents). Those who found it difcult to choose the FOV described FOMO as the main reason for the difculty in their open-ended survey answers. All those responses mentioned FOMO as the primary reason for the difculty: “[It was difcult] because I wasn’t sure if I was missing out on important parts in the other part of the story” (35A). The users who found choosing the FOV more easy than difcult cited the freedom to choose the FOV as the main reason for the ease. “[It was easy] because I can just rotate to get the side I want to follow” (21A)."
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.5844116210938,
        "y1": 233.86192321777344,
        "y2": 360.262939453125
      },
      "text": "After the second viewing session, the users who still felt that it was more difcult than easy to choose the FOV were a minority (21%). FOMO remained the primary reason for the difculty: 100% of the responses mentioned FOMO as the primary reason. Those (76% of the respondents) who perceived choosing the FOV as more easy than difcult mentioned a desire to get the full story (72% of the responses) as the main reason for the ease: “Since it was my second time watching the flm, I watched all the scenes I did not see the frst time” (55A). Freedom to choose remained a secondary reason for the ease of choosing the FOV (28% of the responses). These results suggest that FOMO was a central factor challenging the participants’ decision-making over the FOV."
    }],
    "title": {
      "page": 4,
      "region": {
        "x1": 317.9549865722656,
        "x2": 506.4532470703125,
        "y1": 423.311279296875,
        "y2": 430.63128662109375
      },
      "text": "4.1 Fear of Missing Out in 360° Video"
    }
  }, {
    "paragraphs": [{
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7216186523438,
        "y1": 394.6429138183594,
        "y2": 433.375
      },
      "text": "4.2.1 Joy of Missing Out Across the Rotation Conditions. To address RQ1b about JOMO in the 360° video viewing experience, we analyzed the diferences in the JOMO scale between the free choice condition (A) and the two timed rotation conditions (B and C)."
    }, {
      "page": 5,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.72021484375,
        "y1": 438.47894287109375,
        "y2": 532.0050048828125
      },
      "text": "There were no statistically signifcant diferences between the free choice condition (A) and the timed rotation conditions (B and C) in the frst (χ2=4.41, p>0.110) viewing session. In the second viewing session there were statistically signifcant diferences (χ2=7.50, p=0.024), such that the participants in the two timed rotation conditions experienced slightly more JOMO than the participants in the free choice condition. However, using a dependent samples sign test, we found no statistically signifcant diferences between Session 1 and Session 2 within any of the conditions, as Table 2 shows."
    }, {
      "page": 5,
      "region": {
        "x1": 317.81201171875,
        "x2": 559.7217407226562,
        "y1": 537.1089477539062,
        "y2": 707.3469848632812
      },
      "text": "Taken together, these results suggest that JOMO can be an evolving, dynamic factor, which may change over several viewing sessions. In the frst viewing session, the similar levels of JOMO across the conditions indicate that the only the awareness and access to parallel events induced JOMO rather than the freedom/need to choose the FOV. However, in the second viewing session, the participants in the two timed rotation conditions experienced more JOMO than in the free choice condition, which indicates that the awareness of the parallel events and access to them may have induced more JOMO (as in the timed rotation conditions), not just the freedom to access the events at will (as in the free choice condition). This change may be because the users in the second viewing round realized that they are seeing the parts they missed out in the frst viewing round and thus could focus more on enjoying the experience, whereas in the free choice condition, the users had to actively make decisions over the FOV."
    }, {
      "page": 6,
      "region": {
        "x1": 53.7979736328125,
        "x2": 295.56011962890625,
        "y1": 87.79393005371094,
        "y2": 192.27899169921875
      },
      "text": "4.2.2 Joy and Excitement as JOMO. In the majority of their openended answers, participants described feelings of joy and excitement stemming from both the freedom to choose the FOV and access to parallel events in the spherical view. In the free choice condition (A), 90% of the responses from both viewing sessions combined mentioned the freedom to choose the FOV and access to parallel events as reasons for feeling excited. In the timed rotation conditions (B and C), 75% of the responses described access to parallel events in the spherical view as a reason for excitement. The other main reasons were immersion (18%) and content (5%)."
    }, {
      "page": 6,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.42364501953125,
        "y1": 197.38291931152344,
        "y2": 290.90899658203125
      },
      "text": "The participants described being aware of the two perspectives but still content with what they could observe during the viewing experience: “I could move wherever I wanted and could switch sides too. I liked that I was free to pay attention to whatever I wanted” (24A). “It made the story feel like it was happening in real time. You could watch one side of the story, but you knew that things continued to happen on the other side of the story that you were missing. It was just like real life in that you can only experience one perspective at a time” (40C)."
    }],
    "title": {
      "page": 5,
      "region": {
        "x1": 317.9549865722656,
        "x2": 501.0750732421875,
        "y1": 379.47998046875,
        "y2": 386.79998779296875
      },
      "text": "4.2 Joy of Missing Out in 360° Video"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.46498107910156,
        "x2": 295.5623779296875,
        "y1": 323.4099426269531,
        "y2": 384.05999755859375
      },
      "text": "To further examine the relationship between FOMO and JOMO, we used Spearman’s rank correlation to analyze the association between FOMO and JOMO. There was a moderate, statistically signifcant negative correlation between FOMO and JOMO (r(s)=−0.37, p<0.001), indicating that as FOMO increased, JOMO decreased, and vice versa."
    }, {
      "page": 6,
      "region": {
        "x1": 52.78499984741211,
        "x2": 295.56256103515625,
        "y1": 389.1639404296875,
        "y2": 537.4840087890625
      },
      "text": "To understand the relationship between FOMO and JOMO better, we analyzed the open-ended survey answers. In 30% of the openended answers, the participants described positive feelings, such as joy and excitement, alongside the fear of missing out: “It created some excitement/anxiety that I was leaving one side, and also some excitement that I was ‘discovering’ the other side each time” (59C). “It was fun to know I was going to enter a new perspective, but at the same time I felt that I was leaving something behind and potentially missing out on a story” (25B). These fndings suggest that fear of missing out did not necessarily always preclude positive feelings. Participants could experience FOMO, becoming distracted by their awareness of parallel events occurring in diferent parts of the spherical view, and also feel excited about their multiple options."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 267.95452880859375,
        "y1": 308.2469787597656,
        "y2": 315.5669860839844
      },
      "text": "4.3 Association between FOMO and JOMO"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.5611572265625,
        "y1": 569.9859619140625,
        "y2": 707.3469848632812
      },
      "text": "To address RQ2 about FOMO, JOMO, and presence, we analyzed the diferences between the conditions for our three presence constructs: spatial presence, social presence, and body ownership. We examined body ownership for both the female and male protagonists. We found no statistically signifcant diferences between the conditions (all p’s>0.25). Whether participants experienced a condition where they had control over the feld of view, one where their FOV was assigned did not signifcantly efect participants’ experience of any category of presence. Furthermore, neither viewing the flm as a 360° experience with two parallel storylines (free choice condition [A] and the timed rotation conditions [B and C]), nor viewing it as a more traditional viewing experience from beginning to end in a 180° view (180° view condition D) afected presence."
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.713134765625,
        "y1": 249.20494079589844,
        "y2": 309.85400390625
      },
      "text": "However, there was a statistically signifcant decrease in participants’ sense of spatial and social presence between viewing sessions across all conditions, as shown in Table 3. While repeated viewings may have positive efects, such as reduced FOMO, there may be a double-edged sword in an immersive storytelling experience, since presence is a key goal in immersive storytelling."
    }, {
      "page": 6,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.7208251953125,
        "y1": 314.9579162597656,
        "y2": 496.1549987792969
      },
      "text": "To further address RQ2 about the association between presence, FOMO, and JOMO, we used Spearman correlations. We found statistically signifcant weak positive correlations as detailed in the following. Of the presence constructs for Session 1, only spatial presence correlated signifcantly with JOMO measures (r(s)=.32, p=0.003), with a marginally signifcant correlation for social presence (r(s)=0.20, p=0.075). For Session 1, there was a statistically signifcant correlation between FOMO and the body ownership measure for the female character (r(s)=0.21, p<0.039) and a marginally signifcant correlation for the body ownership measure for the male character (r(s)=0.18, p=0.077). For Session 2, this pattern difered, such that JOMO correlated statistically signifcantly with spatial presence (r(s)=0.34, p=0.002), social presence, (r(s)=0.34, p=0.002) and body ownership for the female character (r(s)=0.37, p<0.001), but not signifcantly with body ownership for the male character, (r(s)=0.17, p=0.1318). There were no statistically signifcant relationships between presence and FOMO at time 2 (all p’s>0.15)."
    }, {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.7124633789062,
        "y1": 501.2589416503906,
        "y2": 561.9089965820312
      },
      "text": "These results suggest that FOMO may not be a prominent factor compromising presence, since we found no strong negative relationships between FOMO and presence. However, the weak positive correlations found between presence and JOMO suggest that enjoyment may contribute to the sense of presence in the viewing experience."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 53.79800033569336,
        "x2": 215.14358520507812,
        "y1": 554.8219604492188,
        "y2": 562.1419677734375
      },
      "text": "4.4 Presence, FOMO, and JOMO"
    }
  }, {
    "paragraphs": [{
      "page": 6,
      "region": {
        "x1": 317.6409912109375,
        "x2": 559.7193603515625,
        "y1": 591.9029541015625,
        "y2": 707.3469848632812
      },
      "text": "As is often the case in immersive video studies [2, 8, 9, 29, 51, 70, 72, 73], we used a single stimulus in this study. A single stimulus, however, has limitations. Every 360° video has unique qualities, including the narrative, setting, and technical features such as the production quality. All these factors may afect the viewing experience, and, consequently, FOMO, JOMO, and presence. For instance, if the narrative moves slowly, the user may have more time to pan around in the sphere and focus on other FOVs without feeling a strong fear of missing out on the events. The user may experience less JOMO, but a stronger sense of presence. Conversely, if the narrative moves quickly and there are many interesting audiovisual"
    }, {
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 558.20166015625,
        "y1": 87.79393005371094,
        "y2": 301.8680114746094
      },
      "text": "elements to explore, the user may feel more FOMO and JOMO, while retaining JOMO, but actually revisiting content may also reduce the user’s sense of presence over time. but less presence. These qualities can also impact the perceived usability of the viewing experience. We elected to use this specifc video because its novel format provided a unique opportunity to elicit feelings of FOMO and JOMO while controlling for agency in four conditions. Since there were two scenes unfolding on opposite sides of the sphere, users were always sure to be “missing out” on content. However, it was possible to watch the flm as a coherent, more traditional-style narrative in the 180° viewing condition (D). Thus, our manipulations, such as changing the rate at which users were exposed to diferent FOVs (as in the timed rotation conditions [B and C]), could be as efective as possible. Future work should examine other 360° videos to present content on all sides to examine the generalizability of these results. This exploratory study provides only a frst step towards understanding the roles of FOMO and JOMO in 360° video. Future research should extend the line of research presented in this paper by examining FOMO and JOMO in multiple storytelling settings with multiple types of stimuli. We discuss the implications of this study in the Discussion section."
    }],
    "title": {
      "page": 6,
      "region": {
        "x1": 317.9549865722656,
        "x2": 405.5986633300781,
        "y1": 576.739990234375,
        "y2": 584.0599975585938
      },
      "text": "5 LIMITATIONS"
    }
  }, {
    "paragraphs": [],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 134.54714965820312,
        "y1": 316.9639892578125,
        "y2": 324.28399658203125
      },
      "text": "6 DISCUSSION"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 53.46699905395508,
        "x2": 295.5656433105469,
        "y1": 360.7699279785156,
        "y2": 695.3919677734375
      },
      "text": "Our fndings suggest that a 360° video viewing experience can yield concern over missing out on important aspects of the storyline (FOMO), while also generating feelings of excitement about the freedom to choose the FOV and access to parallel events in the spherical view (JOMO). FOMO and JOMO can be seen as two sides of the same coin: both stem from the awareness of multiple options in the 360° sphere, which can prompt both negative and positive feelings. JOMO refers to joy at being able to choose from multiple options, whereas FOMO refers to concern about possibly missing out on important events. Both metrics are associated with the availability of multiple options. FOMO did not compromise presence, indicating that FOMO may not be as distracting a factor in an immersive viewing experience as previously assumed [2, 51, 73]. Furthermore, viewers can experience FOMO while also experiencing feelings of joy and excitement, even when they cannot access all available options at will. FOMO decreased over time in the free choice condition, while JOMO remained constant. This suggests that when users view a 360° video multiple times, they may continue to experience JOMO at similar levels, while FOMO may decrease. Therefore, awareness of the option of multiple viewings could alleviate FOMO, meaning that to a certain extent FOMO could be an artifact of the artifcial constraints of the laboratory in which users are presented with experiences that they know they cannot access again on their own. As 360° videos become more commonly viewed in home settings, where users can view the same content multiple times, FOMO may become a less prominent factor in the user-experience. Future work should examine whether merely instructing participants that they can watch the video again can alleviate FOMO while retaining JOMO. While repeat viewings decreased FOMO, they also decreased presence. The awareness of the ability to revisit virtual content may thus help to reduce FOMO"
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 53.79800033569336,
        "x2": 278.9073181152344,
        "y1": 332.6512756347656,
        "y2": 352.9203796386719
      },
      "text": "6.1 FOMO and JOMO: Two Sides of the Same Coin"
    }
  }, {
    "paragraphs": [{
      "page": 7,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7130126953125,
        "y1": 153.5469207763672,
        "y2": 268.99102783203125
      },
      "text": "FOMO has been approached primarily as a negative factor both in CVR and in other realms. The results of this study suggest, however, that FOMO may not be as negative a distraction as previously thought. Future research should thus examine the potential positive implications of FOMO, both in CVR and other contexts, instead of using only a negative framing to the construct. For example, avoiding the negative feeling of FOMO might drive users to investigate multiple options. Moreover, future research should also interrogate further the relationship between FOMO and JOMO, specifcally looking at the mechanisms by which the two mutually infuence each other"
    }, {
      "page": 7,
      "region": {
        "x1": 316.942138671875,
        "x2": 558.5354614257812,
        "y1": 274.0949401855469,
        "y2": 389.53900146484375
      },
      "text": "Visual and diegetic cues can help the user choose the feld of view in the 360° sphere and mitigate FOMO. However, such cues may also increase anxiety about choosing the FOV. Finding the right balance between guiding the user within the spherical view and letting the user experience both FOMO and JOMO should be the goal. As Sarker [60] proposes, designers of immersive experiences must fnd “the sweet spot between boredom and frustration,” where sufcient cues hint to viewers that they have options, but too many cues may introduce FOMO-anxiety. Moreover, future research should explore how storytelling techniques can be efectively used to hint the viewer of a good time to switch the FOV."
    }, {
      "page": 7,
      "region": {
        "x1": 317.9549560546875,
        "x2": 559.7144775390625,
        "y1": 394.6429138183594,
        "y2": 510.0870056152344
      },
      "text": "Future research should examine the potential of using VR as environments in which people can practice coping with multiple options (FOMO) constructively in their lives and strengthen their ability to experience JOMO. VR has been successfully used as a treatment context and a tool in exposure therapy for anxiety and stress disorders [6, 17, 36, 37] and phobias [23, 58]. FOMO could prove to be another fear for which VR can provide a safe and controllable treatment environment. Research should aim for developing coping mechanisms for FOMO, and particularly mechanisms that could help the user to transition from FOMO to JOMO – enjoying the awareness of multiple options and choice."
    }, {
      "page": 7,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.7163696289062,
        "y1": 515.1909790039062,
        "y2": 630.635009765625
      },
      "text": "However, it is important to bear in mind the fundamental differences in FOMO and JOMO in CVR compared to other contexts, such as social media. In social media, FOMO is often associated with social comparison of oneself to others, whereas in CVR, FOMO is about what is happening elsewhere in the video, i.e., in the FOVs that the user is not watching. However, as social, shared VR experiences are becoming more common [32, 44, 71, 77], this diference may dissipate to a degree. Social VR experiences could make the element of social comparison more salient in VR and thus expose VR users to a type of FOMO similar to that associated with social media."
    }, {
      "page": 7,
      "region": {
        "x1": 317.69500732421875,
        "x2": 559.5863647460938,
        "y1": 635.7389526367188,
        "y2": 707.3469848632812
      },
      "text": "In CVR, the user has access to multiple options in the 360° sphere. Yet, those options are situated entirely within the spherical view and are thus limited by the content and technical afordances of the flm. In addition, the prerecorded nature of 360° flm means that FOMO may dissipate entirely when users have the option to rewatch content at will. In contrast, in social media and in life in general, the number of options is much larger, and it may not be"
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 294.04718017578125,
        "y1": 87.79393005371094,
        "y2": 104.60797119140625
      },
      "text": "possible to reproduce or revisit events. Thus, the causes of FOMO and JOMO vary based on context."
    }, {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 295.55877685546875,
        "y1": 109.71195983886719,
        "y2": 181.32000732421875
      },
      "text": "Moreover, watching a CVR flm is a relatively short time commitment, typically about 10 minutes at most. Consequently, both the negative and positive feelings that emerge during the viewing experience are rather short-term. In contrast, users often use social media continuously and therefore may experience the concern and anxiety of FOMO and happiness of JOMO continuously over long periods of time, leading to greater efects."
    }],
    "title": {
      "page": 7,
      "region": {
        "x1": 317.9549865722656,
        "x2": 541.6351928710938,
        "y1": 125.4320068359375,
        "y2": 145.70111083984375
      },
      "text": "6.2 Implications for Research on FOMO and JOMO"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 69.76499938964844,
        "x2": 294.04327392578125,
        "y1": 211.2686309814453,
        "y2": 228.80902099609375
      },
      "text": "• Storytellers should focus on increasing users’ JOMO instead of only mitigating FOMO."
    }, {
      "page": 8,
      "region": {
        "x1": 69.76065063476562,
        "x2": 295.5637512207031,
        "y1": 233.1846466064453,
        "y2": 437.02801513671875
      },
      "text": "• JOMO could be increased by adding visual stimuli across the spherical view to notify the viewer of available options and foster joy and excitement about their choices. • Audiovisual directional cues may help the user to navigate the 360° sphere and mitigate the difculty of choosing the FOV. However, such cues may also diminish the joy users derive from discovering elements in the spherical view and reduce their sense of presence. Therefore, the use of directional cues should be carefully considered, weighing their potential impact on both FOMO and JOMO. • Because presence may decrease upon repeated viewings, storytellers should consider that as presence dissipates, the viewing experience may evolve and viewers may start to attend to other details in the virtual environment. • Because the users can also experience presence in 180° video, storytellers should consider when a 180° view is sufcient to achieve the storytelling goals, considering the increased investment of time and efort required to produce 360° video vs. 180° videos."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 260.1981506347656,
        "y1": 196.83099365234375,
        "y2": 204.1510009765625
      },
      "text": "6.3 Design and Storytelling Implications"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.5638122558594,
        "y1": 467.70294189453125,
        "y2": 605.06396484375
      },
      "text": "This study examined fear of missing out (FOMO), joy of missing out (JOMO), and presence in a 360° video viewing experience. The fndings show that users experienced FOMO as concern and frustration over awareness of parallel events in the 360° sphere and the need to choose the FOV at any given moment. The users also experienced feelings of joy and excitement (JOMO) about the availability of simultaneous events in the spherical view. FOMO did not compromise users’ sense of presence, a key aspect of an immersive video viewing experience. FOMO also decreased in the second viewing session, indicating that FOMO may not be a fxed feature of a 360° video viewing experience. These results indicate a need for further research examining FOMO, while also considering JOMO as an integral part of immersive experiences."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 141.57261657714844,
        "y1": 452.53900146484375,
        "y2": 459.8590087890625
      },
      "text": "7 CONCLUSION"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.5608825683594,
        "y1": 635.7389526367188,
        "y2": 707.3469848632812
      },
      "text": "The following funding sources have made this work possible: Strategic Research Council at the Academy of Finland, decision 329333; Helsingin Sanomat Foundation; The Finnish Media Federation. This material is also based upon work that is supported by the U.S. Department of Agriculture, through Hatch/McIntire Stennis under 1014384. We also thank Florio Arguillas and Jacob Grippen at the Cornell Institute for Social and Economic Research (CISER) and"
    }, {
      "page": 8,
      "region": {
        "x1": 317.6409912109375,
        "x2": 559.712890625,
        "y1": 87.79393005371094,
        "y2": 148.4429931640625
      },
      "text": "Elena Goloborodko and Jonathan Bohan from the Cornell Restricted Access Data Center (CRADC) for helping to validate our code and archiving our data. We thank Stephen Parry from the Cornell Statistical Consulting Unit for his statistical advice. We thank the CHI reviewers whose feedback helped improve this paper. Finally, we thank our participants for their time and thoughtful responses."
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 53.79800033569336,
        "x2": 171.35446166992188,
        "y1": 620.5750122070312,
        "y2": 627.89501953125
      },
      "text": "ACKNOWLEDGMENTS"
    }
  }, {
    "paragraphs": [{
      "page": 8,
      "region": {
        "x1": 321.197998046875,
        "x2": 558.1997680664062,
        "y1": 176.76611328125,
        "y2": 181.32000732421875
      },
      "text": "[1] Sun Joo-Grace Ahn, Amanda Minh Tran Le, and Jeremy Bailenson. 2013. The"
    }, {
      "page": 8,
      "region": {
        "x1": 317.9510192871094,
        "x2": 559.3811645507812,
        "y1": 184.736083984375,
        "y2": 707.3469848632812
      },
      "text": "Efect of Embodied Experiences on Self-Other Merging, Attitude, and Helping Behavior. Media Psychology 16 (2013), 7–38. https://doi.org/10.1080/15213269. 2012.755877 [2] Tanja Aitamurto, Shuo Zhou, Sukolsak Sakshuwong, Jorge Saldivar, Yasamin Sadeghi, and Amy Tran. 2018. Sense of Presence, Attitude Change, PerspectiveTaking and Usability in First-Person Split-Sphere 360° Video. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/ 3173574.3174119 [3] Dorit Alt. 2015. College students’ academic motivation, media engagement and fear of missing out. Computers in Human Behavior 49 (2015), 111–119. https://doi.org/10.1016/j.chb.2015.02.057 [4] Julie H. Aranda and Safa Baig. 2018. Toward “JOMO”: The Joy of Missing Out and the Freedom of Disconnecting. In Proceedings of the 20th international conference on human-computer interaction with mobile devices and service (Barcelona, Spain) (MobileHCI’18). ACM, New York, Article 19, 8 pages. https://doi.org/10.1145/ 3229434.3229468 [5] Sabrina Barr. 2019. Five signs you’ve swapped FOMO for JOMO. The Independent. Retrieved August 19, 2020 from https://www.independent.co.uk/life-style/jomofomo-fear-joy-of-missing-out-millennials-netfix-spotify-friends-socialisecinema-a8753626.html [6] Gayle J Beck, Sarah A Palyo, Eliot Winer, Brad Schwagler, and Eu Jin Ang. 2007. Virtual Reality Exposure Therapy for PTSD symptoms after a road accident: an uncontrolled case series. Behavior Therapy 38 (2007), 39–48. https://doi.org/10. 1016/j.beth.2006.04.001 [7] Yoav Benjamini and Yosef Hochberg. 1995. Controlling the false discovery rate - a practical and powerful approach to multiple testing. Journal of the Royal Statistical Society. Series B (Methodological) 57 (1995), 289–300. https: //doi.org/10.1111/j.2517-6161.1995.tb02031.x [8] Maximino Bessa, Miguel Melo, David Narciso, Luís Barbosa, and José VasconcelosRaposo. 2016. Does 3D 360 video enhance user’s VR experience?: An Evaluation Study. In Interacción ’16: Proceedings of the XVII International Conference on Human Computer Interaction (Salamanca, Spain) (Interacción ’16). ACM, New York, 1–4. https://doi.org/10.1145/2998626.2998669 [9] Samantha Bindman, Lisa Castaneda, Mike Scanlon, and Anna Cechony. 2018. Am I a Bunny? The Impact of High and Low Immersion Platforms and Viewers’ Perceptions of Role on Presence, Narrative Engagement, and Empathy during an Animated 360° Video. In CHI ’18 Engage with CHI (Montréal, Canada) (CHI ’18). ACM, New York, 1–11. https://doi.org/10.1145/3173574.3174031 [10] Frank Biocca, Chad Harms, and Judee K Burgoon. 2003. Toward a more robust theory and measure of social presence: Review and suggested criteria. Presence: Teleoperators & virtual environments 12, 5 (2003), 456–480. https://doi.org/10. 1162/105474603322761270 [11] David Blackwell, Carrie Leaman, Rose Tramposch, Ciera Osborne, and Miriam Liss. 2017. Extraversion, neuroticism, attachment style and fear of missing out as predictors of social media use and addiction. Personality and Individual Diferences 116 (2017), 69–72. https://doi.org/10.1016/j.paid.2017.04.039 [12] Matthew Botvinick and Jonathan Cohen. 198. Rubber hands ‘feel’ touch that eyes see. Nature 391 (198), 756–756. https://doi.org/10.1038/35784 [13] Nancy A. Cheever, Larry D. Rosen, L. Mark Carrier, and Amber Chavez. 2014. Out of sight is not out of mind: The impact of restricting wireless mobile device use on anxiety levels among low, moderate and high users. Computers in Human Behavior 37 (2014), 290–297. https://doi.org/10.1016/j.chb.2014.05.002 [14] Christina Crook. 2015. The Joy of Missing Out: Finding Balance in a Wired World. New Society Publishers, Gabriola Island, BC, Canada. [15] James J Cummings and Jeremy N Bailenson. 2016. How immersive is enough? A meta-analysis of the efect of immersive technology on user presence. Media Psychology 19, 2 (2016), 272–309. [16] Savino Dambra, Giuseppe Samela, Lucile Sassatelli, Romaric Pighetti, Ramon Aparicio-Pardo, and Anne-Marie Pinna-Déry. 2018. Film editing: new levers to improve VR streaming. In MMSys ’18: Proceedings of the 9th ACM Multimedia Systems Conference (Amsterdam, Netherlands) (MMSys ’18). ACM, New York, 27–39. https://doi.org/10.1145/3204949.3204962 [17] JoAnn Difede, Hunter Hofman, and Nimale Jaysinghe. 2002. Multimedia Reviews: Innovative Use of Virtual Reality Technology in the Treatment of PTSD in the Aftermath of September 11. Behaviour Research and Therapy 53 (2002), 1083–1085."
    }, {
      "page": 9,
      "region": {
        "x1": 53.797996520996094,
        "x2": 294.8137512207031,
        "y1": 89.0982666015625,
        "y2": 101.62322998046875
      },
      "text": "https://doi.org/10.1176/appi.ps.53.9.1083 [18] Jon Elhai, Jason Levine, Robert Dvorak, and Brian Hall. 2016. Fear of missing out,"
    }, {
      "page": 9,
      "region": {
        "x1": 53.794212341308594,
        "x2": 295.22625732421875,
        "y1": 105.03509521484375,
        "y2": 699.3770141601562
      },
      "text": "need for touch, anxiety and depression are related to problematic smartphone use. Computers in Human Behavior 63 (2016), 509–516. https://doi.org/10.1016/j. chb.2016.05.079 [19] Matteo Angelo Fabris, Davide Marengo, Claudio Longobardi, and Michele Settanni. 2020. Investigating the links between fear of missing out, social media addiction, and emotional symptoms in adolescence: The role of stress associated with neglect and negative reactions on social media. Addictive Behaviors 106 (2020), 106364. https://doi.org/10.1016/j.addbeh.2020.106364 [20] Luke Fernandez and Susan J. Matt. 2020. Instead of FOMO, covid-19 demands we embrace JOMO — the joy of missing out. We need to unlearn the corporate-driven culture imparted by the 20th century. The Washington Post. Retrieved August 27, 2020 from https://www.washingtonpost.com/outlook/2020/04/07/instead-fomocovid-19-demands-we-embrace-jomo-joy-missing-out/ [21] Jesse Fox, Jeremy Bailenson, and Joseph Binney. 2009. Virtual experiences, physical behaviors: The efect of presence on imitation of an eating avatar. Presence: Teleoperators and Virtual Environments 18, 4 (2009), 294–303. [22] Kristen Fuller. 2018. JOMO: The Joy of Missing Out. Psychology Today. Retrieved September 20, 2018 from https://www.psychologytoday.com/us/blog/happinessis-state-mind/201807/jomo-the-joy-missing-out [23] Azucena Garcia-Palacios, Hunter Hofman, Albert Carlin, Thomas A. Furness III, and Cristina Botella. 2002. Virtual reality in the treatment of spider phobia: a controlled study. Behaviour Research and Therapy 40 (2002), 983–993. Issue 9. https://doi.org/10.1016/S0005-7967(01)00068-7 [24] Hunter Gehlbach, Geof Marietta, Aaron M. King, Cody Karutz, Jeremy N. Bailenson, and Chris Dede. 2018. Many ways to walk a mile in another’s moccasins: Type of social perspective taking and its efect on negotiation outcomes. Computers in Human Behavior 52 (2018), 523–532. https://doi.org/10.1016/j.chb.2014.12.035 [25] Reza Ghaiumy Anaraky, Guo Freeman, Oriana Rachel Aragón, Bart P. Knijnenburg, and Meghnaa Tallapragada. 2019. The Dark Side of Social Media: What Makes Some Users More Vulnerable Than Others?. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). ACM, New York, NY, USA, 185–189. https://doi.org/10.1145/3311957.3359493 [26] Jan Gugenheimer, Dennis Wolf, Gabriel Haas, Sebastian Krebs, and Enrico Rukzio. 2016. SwiVRChair: A Motorized Swivel Chair to Nudge Users’ Orientation for 360 Degree Storytelling in Virtual Reality. In CHI ’16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California) (CHI ’16). ACM, New York, 1996–2000. https://doi.org/10.1145/2858036.2858040 [27] Béatrice S. Hasler, Bernhard Spanlang, and Mel Slater. 2017. Virtual race transformation reverses racial in-group bias. PLOS ONE 12, 4 (04 2017), 1–20. https://doi.org/10.1371/journal.pone.0174965 [28] Carrie Heeter. 1992. Being there: The subjective experience of presence. Presence: Teleoperators & Virtual Environments 1, 2 (1992), 262–271. https://doi.org/10. 1162/pres.1992.1.2.262 [29] Seok Kang, Erin O’Brien, Arturo Villarreal, Wansoo Lee, and Chad Mahood. 2019. Immersive Journalism and Telepresence Does virtual reality news use afect news credibility? Digital Journalism 7 (2019), 294–313. Issue 2. https: //doi.org/10.1080/21670811.2018.1504624 [30] Maurits Clemens Kaptein, Cliford Nass, and Panos Markopoulos. 2010. Powerful and Consistent Analysis of Likert-type Rating Scales. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI’10). ACM, New York, 2391–2394. https://doi.org/10.1145/1753326.1753686 [31] Elena Kokkinara, Mel Slater, and Joan Lopez-Moliner. 2015. The Efects of Visuomotor Calibration to the Perceived Space and Body, Through Embodiment in Immersive Virtual Reality. ACM Trans. Appl. Percept 13 (2015), 22. Issue 1. https://doi.org/10.1145/2818998 [32] Kaylee Payne Kruzan and Andrea Stevenson Won. 2019. Embodied well-being through two media technologies: Virtual reality and social media. New Media & Society 21, 8 (2019), 1734–1749. [33] Kwan Min Lee. 2004. Presence, explicated. Communication theory 14, 1 (2004), 27–50. https://doi.org/10.1111/j.1468-2885.2004.tb00302.x [34] Li Li, Mark Grifths, Zhimin Niu, and Songli Mei. 2020. The trait-state fear of missing out scale: Validity, reliability, and measurement invariance in a Chinese sample of university students. The Journal of Afective Disorders 274 (2020), 711–718. https://doi.org/10.1016/j.jad.2020.05.103 [35] Yen-Chen Lin, Yung-Ju Chang, Hou-Ning Hu, Hsien-Tzu Cheng, Chi-Wen Huang, and Min Sun. 2017. Tell Me Where to Look: Investigating Ways for Assisting Focus in 360° Video. In CHI ’17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, CO) (CHI ’17). ACM, New York, 2535–2545. https://doi.org/10.1145/3025453.3025757 [36] Philip Lindner, Alexander Milof, Simon Fagernäs, Joel Andersen, Martin Sigeman, Gerhard Andersson, Tomas Furmark, and Per Carlbring. 2019. Therapist-led and self-led one-session virtual reality exposure therapy for public speaking anxiety with consumer hardware and software: A randomized controlled trial. Journal of Anxiety Disorders 61 (2019), 45–54. https://doi.org/10.1016/j.janxdis.2018.07.003"
    }, {
      "page": 9,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.3843383789062,
        "y1": 89.0950927734375,
        "y2": 699.3770141601562
      },
      "text": "[37] Philip Lindner, Alexander Milof, William Hamilton, Lena Reuterskiöld, Gerhard Andersson, Mark Powers, and Per Carlbring. 2017. Creating state of the art, next-generation Virtual Reality exposure therapies for anxiety disorders using consumer hardware platforms: design considerations and future directions. Cognitive Behaviour Therapy 46 (2017), 404–420. Issue 5. https: //doi.org/10.1080/16506073.2017.1280843 [38] Matthew Lombard and Theresa Ditton. 1997. At the Heart of It All: The Concept of Presence. Journal of Computer-Mediated Communication 3 (1997). Issue 2. https://doi.org/10.1111/j.1083-6101.1997.tb00072.x [39] Ulrik Lyngs, Kai Lukof, Petr Slovak, William Seymour, Helena Webb, Marina Jirotka, Jun Zhao, Max Van Kleek, and Nigel Shadbolt. 2020. ‘I Just Want to Hack Myself to Not Get Distracted’: Evaluating Design Interventions for SelfControl on Facebook. In CHI ’20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). ACM, New York, 1–15. https: //doi.org/10.1145/3313831.3376672 [40] Andrew MacQuarrie and Anthony Steed. 2017. Cinematic virtual reality: Evaluating the efect of display type on the viewing experience for panoramic video. In Virtual Reality 2017. IEEE, IEEE Computer Society, New York, 45–54. https://doi.org/10.1109/VR.2017.7892230 [41] Antonella Maselli and Mel Slater. 2013. The building blocks of the full body ownership illusion. Frontiers in Human Neuroscience 7 (2013), 83. https://doi.org/ 10.3389/fnhum.2013.00083 [42] John Mateer. 2017. Directing for Cinematic Virtual Reality : how traditional flm director’s craft applies to immersive environments and notions of presence. Journal of Media Practice 18 (2017), 14–25. Issue 1. https://doi.org/10.1080/ 14682753.2017.1305838 [43] Nathalie Mathe, Ryan Lynch, and Justin Chin. 2017. UTURN – Ep 1: The Tech Startup. NativeVR. Retrieved January 12, 2021 from http://www.uturnvr.com/wpcontent/uploads/2018/03/UTURN-PressKit_v2.pdf [44] Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland) (CHI ’19). ACM, New York, 1–12. https://doi.org/10.1145/3290605.3300794 [45] Miguel Melo, Sofa Sampaio, Luís Barbosa, José Vasconcelos-Raposo, and Maximino Bessa. 2016. The Impact of Diferent Exposure Times to 360° Video Experience on the Sense of Presence. In 2016 23rd Portuguese Meeting on Computer Graphics and Interaction (Covilha, Portugal) (EPCGI). IEEE, New York, 1–5. https://doi.org/10.1109/EPCGI.2016.7851192 [46] Marina Milyavskaya, Mark Safran, Nora Hope, and Richard Koestner. 2018. Fear of missing out: prevalence, dynamics, and consequences of experiencing FOMO. Motivation and Emotion 42 (2018), 725–737. Issue 5. https://doi.org/10.1007/ s11031-018-9683-5 [47] Katy Newton and Karin Soukup. 2016. The Storyteller’s Guide to the Virtual Reality Audience. Stanford d.school. Retrieved August 19, 2020 from https://medium.com/stanford-d-school/the-storyteller-s-guide-tothe-virtual-reality-audience-19e92da57497 [48] Lasse Nielsen, Matias Møller, Sune Hartmeyer, Troels Ljung, Niels Chr. Nilsson, Rolf Nordahl, and Stefania Serafn. 2016. Missing The Point: An Exploration of How to Guide Users’ Attention During Cinematic Virtual Reality. In Proceedings of the 22nd ACM Symposium on Virtual Reality Software and Technology (Munich, Germany). ACM, New York, 229–232. https://doi.org/10.1145/2993369.2993405 [49] Kristine Nowak and Frank Biocca. 2003. The Efect of the Agency and Anthropomorphism on users’ Sense of Telepresence, Copresence, and Social Presence in Virtual Environments. Presence: Teleoperators and Virtual Environments 12 (2003), 481–494. Issue 5. https://doi.org/10.1162/105474603322761289 [50] Soo Youn Oh, Jeremy Bailenson, Erika Weisz, and Jamil Zaki. 2016. Virtually old: Embodied perspective taking and the reduction of ageism under threat. Computers in Human Behavior 60 (2016), 398–410. https://doi.org/10.1016/j.chb.2016.02.007 [51] Peter J. Passmore, Maxine Glancy, Adam Philpot, Amelia Roscoe, Andrew Wood, and Bob Fields. 2016. Efects of viewing condition on user experience of panoramic video. In Proceedings of the International Conference on Artifcial Reality and Telexistence and Eurographics Symposium on Virtual Environments. The Eurographics Association, Little Rock, Arkansas, 9–16. https://doi.org/10.2312/egve.20161428 [52] Tabitha Peck, Sofa Seinfeld, Salvatore Aglioti, and Mel Slater. 2013. Putting yourself in the skin of a black avatar reduces implicit racial bias. Consciousness and Cognition 22 (2013), 779–787. Issue 3. https://doi.org/10.1016/j.concog.2013.04.016 [53] Hayley Phalan. 2018. How to Make This the Summer of Missing Out. The New York Times. Retrieved September 20, 2018 from https://www.nytimes.com/2018/ 07/12/style/joy-of-missing-out-summer.html [54] Robin Pomeroy. 2020. Embrace ‘JOMO’: psychologist Adam Grant shares lockdown tips in this week’s podcast. The World Economic Forum. Retrieved August 27, 2020 from https://www.weforum.org/agenda/2020/04/world-vs-virus-episode05-adam-grant-covid-19-work-lockdown/ [55] Andrew K. Przybylski, Kou Murayama, Cody R. DeHaan, and Valerie Gladwell. 2013. Motivational, emotional, and behavioral correlates of fear of missing out. Computers in Human Behavior 29, 4 (2013), 1841–1848. https://doi.org/10.1016/j. chb.2013.02.014"
    }, {
      "page": 10,
      "region": {
        "x1": 53.798004150390625,
        "x2": 295.23065185546875,
        "y1": 89.0950927734375,
        "y2": 707.3469848632812
      },
      "text": "[56] Giuseppe Riva, Fabrizia Mantovani, Claret Samantha Capideville, Alessandra Preziosa, Francesca Morganti, Daniele Villani, Andrea Gaggioli, Cristina Botella, and Mariano Alcañiz. 2007. Afective Interactions Using Virtual Reality: The Link between Presence and Emotions. CyberPsychology & Behavior 10 (2007), 45–56. Issue 1. https://doi.org/10.1089/cpb.2006.9993 [57] Sarah Ben Romdane. 2020. Why You Need to Embrace JOMO During the Pandemic Want to fx the world? Stop trying to do the most. Mille World. Retrieved August 27, 2020 from https://www.milleworld.com/self-isolation-coronavirus-jomo/ [58] BO Rothbaum, LF Hodges, S Smith, and LE Price. 2000. A controlled study of virtual reality exposure therapy for the fear of fying. Journal of Consulting and Clinical Psychology 68 (2000), 1020–1026. Issue 6. https://doi.org/10.1037//0022006x.68.6.1020 [59] Sylvia Rothe, Heinrich Hußmann, and Mathias Allary. 2017. Diegetic cues for guiding the viewer in cinematic virtual reality. In VRST ’17: Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (Gothenburg, Sweden) (VRST ’17). ACM, New York, 1–2. https://doi.org/10.1145/3139131. 3143421 [60] Biswajit Sarker. 2017. Decoding the User Experience in Mobile Virtual Reality Narratives. In International Conference on Virtual, Augmented and Mixed Reality. Springer, Springer International Publishing, Vancouver, BC, Canada, 437–452. [61] Sofa Seinfeld, Jorge Arroyo-Palacios, Guillermo Iruretagoyena, Ruud Hortensius, Luis E. Zapata, David Borland, Beatrice de Gelder, Mel Slater, and Maria V. Sanchez-Vives. 2018. Ofenders become the victim in virtual reality: impact of changing perspective in domestic violence. Scientifc reports 8, 1 (2018), 2692. https://doi.org/10.1038/s41598-018-19987-7 [62] Howard J. Seltman. 2012. Experimental design and analysis. Carnegie Mellon University, Pittsburgh, Pennsylvania. [63] Alia Sheikh, Andy Brown, Zillah Watson, and Michael Evans. 2016. Directing attention in 360-degree video. In IBC 2016 Conference (Amsterdam, Netherlands). International Broadcasting Convention, Amsterdam, Netherlands. https://doi. org/10.1049/ibc.2016.0029 [64] Mel Slater, Bernhard Spanlang, Maria V. Sanchez-Vives, and Olaf Blanke. 2010. First Person Experience of Body Transfer in Virtual Reality. PLOS ONE 5 (2010), 1–9. Issue 5. https://doi.org/10.1371/journal.pone.0010564 [65] Mel Slater and Sylvia Wilbur. 1997. A framework for immersive virtual environments (FIVE): Speculations on the role of presence in virtual environments. Presence: Teleoperators and Virtual Environments 6, 6 (1997), 603–616. https://doi.org/10.1162/pres.1997.6.6.603 [66] Anthony Steed, Sebastian Friston, Maria Murcia Lopez, Jason Drummond, Ye Pan, and David Swapp. 2016. An ‘In the Wild’ Experiment on Presence and Embodiment using Consumer Virtual Reality Equipment. IEEE Transactions on Visualization and Computer Graphics 22 (2016), 1406–1414. Issue 4. https: //doi.org/10.1109/TVCG.2016.2518135 [67] Jonathan Steuer. 1992. Defning Virtual Reality: Dimensions Determining Telepresence. Journal of Communication 42 (1992), 73–93. Issue 4. https: //doi.org/10.1111/j.1460-2466.1992.tb00812.x [68] Anselm Strauss and Juliet Corbin. 1998. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. SAGE Publications, Thousands Oaks, California. [69] Shyam Sundar, Jin Kang, and Danielle Oprean. 2017. Being There in the Midst of the Story: How Immersive Journalism Afects Our Perceptions and Cognitions. Cyberpsychology, Behavior, and Social Networking 20 (2017), 672–682. Issue 11. https://doi.org/10.1089/cyber.2017.0271 [70] Hannah Syrett, Licia Calvi, and Marnix van Gisbergen. 2017. The Oculus Rift Film Experience: A Case Study on Understanding Films in a Head Mounted Display. In Intelligent Technologies for Interactive Entertainment, Ronald Poppe, JohnJules Meyer, Remco Veltkamp, and Mehdi Dastani (Eds.). Springer International Publishing, Cham, 197–208. [71] Theresa Jean Tanenbaum, Nazely Hartoonian, and Jefrey Bryan. 2020. “How do I make this thing smile?”: An Inventory of Expressive Nonverbal Communication in Commercial Social Virtual Reality Platforms. In CHI ’20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI) (CHI ’20). ACM, New York, 1–13. https://doi.org/10.1145/3313831.3376606 [72] Anthony Tang and Omid Fakourfar. 2017. Watching 360° Videos Together. In CHI ’17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, CO) (CHI ’17). ACM, New York, 4501–4506. https://doi.org/10. 1145/3025453.3025519 [73] Audrey Tse, Charlene Jennett, Joanne Moore, Zillah Watson, Jacob Rigby, and Anna L. Cox. 2017. Was I There?: Impact of Platform and Headphones on 360 Video Immersion. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI EA ’17). ACM, New York, 2967–2974. https://doi.org/10.1145/3027063.3053225 [74] Kristin Van Damme, Anissa All, Lieven De Marez, and Sarah Van Leuven. 2019. 360° Video journalism: experimental study on the efect of immersion on news experience and distant sufering. Journalism Studies 20, 14 (2019), 2053–2076. https://doi.org/10.1080/1461670X.2018.1561208 [75] Marc Van den Broeck, Fahim Kawsar, and Johannes Schöning. 2017. It’s All Around You: Exploring 360° Video Viewing Experiences on Mobile Devices. In"
    }, {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 559.3807983398438,
        "y1": 89.0950927734375,
        "y2": 284.9320068359375
      },
      "text": "Proceedings of the 25th ACM international conference on Multimedia (Mountain View, CA). ACM, New York, 762–768. https://doi.org/10.1145/3123266.3123347 [76] Mäkelä Ville, Tuuli Keskinen, John Mäkelä, Pekka Kallioniemi, Jussi Karhu, Kimmo Ronkainen, Alisa Burova, Jaakko Hakulinen, and Markku Turunen. 2019. What Are Others Looking at? Exploring 360° Videos on HMDs with Visual Cues about Other Viewers. In Proceedings of the 2019 ACM International Conference on Interactive Experiences for TV and Online Video (Salford, Manchester, United Kingdom) (TVX ’19). ACM, New York, 13–24. https://doi.org/10.1145/3317697.3323351 [77] Cheng Yao Wang, Mose Sakashita, Upol Ehsan, Jingjin Li, and Andrea Stevenson Won. 2020. Again, Together: Socially Reliving Virtual Reality Experiences When Separated. In CHI ’20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). ACM, New York, 1–12. https://doi.org/10.1145/ 3313831.3376642 [78] Andrea Stevenson Won, Tanja Aitamurto, Byungdoo Kim, Sukolsak Sakshuwong, Catherine Kircos, and Yasamin Sadeghi. 2019. Motivation to Select Point of View in Cinematic Virtual Reality. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, IEEE, Osaka, Japan, 1233–1234. [79] Ernest Worthman. 2019. JOMO, FOMO. . . What is Your Malady? AGL Media Group. Retrieved August 11, 2020 from https://www.aglmediagroup.com/jomofomo-what-is-your-malady/ [80] Goranka Zoric, Louise Louise Barkhuus, Arvid Engström, and Elin Önnevall. 2013. Panoramic video: design challenges and implications for content interaction. In EuroITV ’13: Proceedings of the 11th European Conference on Interactive TV and Video (Como, Italy) (EuroITV ’13). ACM, New York, 153–162. https://doi.org/10. 1145/2465958.2465959"
    }],
    "title": {
      "page": 8,
      "region": {
        "x1": 317.9549865722656,
        "x2": 387.3695983886719,
        "y1": 163.28997802734375,
        "y2": 170.6099853515625
      },
      "text": "REFERENCES"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 317.6409912109375,
        "x2": 558.2002563476562,
        "y1": 321.7229309082031,
        "y2": 338.5360107421875
      },
      "text": "Anonymized summary data and our analysis code are available here: https://osf.io/3f9vr/"
    }, {
      "page": 10,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.1851806640625,
        "y1": 343.6399230957031,
        "y2": 415.2489929199219
      },
      "text": "Because movement data can provide identifying information, we have provided only the summary measures in our anonymized data set. We link to the raw movement data, which is stored at the Cornell Restricted Access Data Center (CRADC). Interested researchers may request it there; it will be released on submission of IRB approval and agreement to destroy data after use and not to share it publicly."
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 366.6640930175781,
        "y1": 306.5589904785156,
        "y2": 313.8789978027344
      },
      "text": "A DATA"
    }
  }, {
    "paragraphs": [{
      "page": 10,
      "region": {
        "x1": 317.6860046386719,
        "x2": 558.2039184570312,
        "y1": 463.7079162597656,
        "y2": 480.5220031738281
      },
      "text": "These questions were administered in the pre-survey, which each participant took at the beginning of the experiment session."
    }, {
      "page": 10,
      "region": {
        "x1": 328.8606262207031,
        "x2": 559.7207641601562,
        "y1": 491.1561279296875,
        "y2": 705.2289428710938
      },
      "text": "(1) Prior to this study, how many 360° or Cinematic Virtual Reality videos have you watched? • None • 1 • 2-4 • 5-10 • More than 10 (2) Prior to this study, how many times have you used headmounted displays/virtual reality headsets, such as Oculus Rift, Samsung Gear VR, Google Cardboard, Google Daydream, or HTC Vive? • Never • Once • 2-4 times • 5-10 times • 11-15 times • More than 16 times (3) Please answer the following question. (1 - Very difcult 7 - Very easy) • How easy is it for you to learn to use new technologies?"
    }, {
      "page": 11,
      "region": {
        "x1": 64.70282745361328,
        "x2": 295.56195068359375,
        "y1": 87.79393005371094,
        "y2": 192.26885986328125
      },
      "text": "(4) Please answer the question below. (1 - Dislike very much 7 - Like very much) • How much do you like learning new technologies? (5) How often do you play video games? (not including phonebased video games) • Never • Once or twice a year • Monthly • Weekly • Daily"
    }, {
      "page": 11,
      "region": {
        "x1": 53.52899932861328,
        "x2": 294.04266357421875,
        "y1": 209.8380126953125,
        "y2": 241.81500244140625
      },
      "text": "B.2 Demographic Questions The questions were administered in the pre-survey, which each participant took in the beginning of the experiment session."
    }, {
      "page": 11,
      "region": {
        "x1": 64.70359802246094,
        "x2": 295.564697265625,
        "y1": 251.18492126464844,
        "y2": 717.3007202148438
      },
      "text": "(1) What is your age? • 18 - 24 • 25 - 34 • 35 - 44 • 45 - 54 • 55 - 64 • 65 - 74 • 75 - 84 • 85 or older (2) What is your gender? • Female • Male • Other (3) Where were you born? • United States • Somewhere else, where? (4) What is your education? Choose based on your highest completed degree. • Less than high school • High school graduate • Some college • 2 year degree • 4 year degree (Bachelor’s) • Master’s Degree • Professional degree • Doctorate (5) Which of the following categories best describes your employment status? If you are a postdoctoral scholar, choose “Employed full time.” • Employed full time • Employed part time • Unemployed looking for work • Unemployed not looking for work • Retired • Student • Disabled (6) If you are employed, what describes your position the best? If you are not employed, you can skip this question. • An employee at someone else’s organization. • In a managing position at someone else’s company. • Self-employed (freelancer, sole proprietorship). • In a managing position at your own company • Farming or forestry entrepreneur"
    }, {
      "page": 11,
      "region": {
        "x1": 343.69317626953125,
        "x2": 425.3502197265625,
        "y1": 87.78770446777344,
        "y2": 104.5997314453125
      },
      "text": "• Postdoctoral scholar • Other, what?"
    }, {
      "page": 11,
      "region": {
        "x1": 317.9549865722656,
        "x2": 526.6678466796875,
        "y1": 121.5159912109375,
        "y2": 141.78509521484375
      },
      "text": "B.3 Spatial and Social Presence and Body Ownership"
    }, {
      "page": 11,
      "region": {
        "x1": 317.62298583984375,
        "x2": 559.71826171875,
        "y1": 149.63096618652344,
        "y2": 188.36297607421875
      },
      "text": "The following survey questions were administered to measure participants’ sense of spatial presence, social presence, and body ownership after each of their two viewings the 360° video. The questions were identical across the four conditions."
    }, {
      "page": 11,
      "region": {
        "x1": 328.8598327636719,
        "x2": 558.2070922851562,
        "y1": 198.3246307373047,
        "y2": 401.4429931640625
      },
      "text": "(1) Please rate the following statements. (1 - Strongly disagree 7 - Strongly agree) • I felt I was present in the places shown in the video. • I felt surrounded by the actions in the video. • I felt I was sitting in the scene. • I felt I could have reached out and touched the items in the scene. (2) Please rate the following statements. (1 - Strongly disagree 7 - Strongly agree) • I felt I was present with the other people in the video. • I felt like the people in the video could see me. • I felt I was actually interacting with the other people. • I felt that the people were talking to me. (3) Please rate the following statements. “The woman” refers to the female programmer in the video. (1 - Strongly disagree 7 - Strongly agree) • I felt that the woman was an extension of me. • When something happened to the woman in the video, I felt like it happened to me."
    }, {
      "page": 11,
      "region": {
        "x1": 328.86431884765625,
        "x2": 558.2015991210938,
        "y1": 406.54486083984375,
        "y2": 423.3609924316406
      },
      "text": "• I felt the woman’s body was my body. (4) Please rate the following statements. “The man” refers to the"
    }, {
      "page": 11,
      "region": {
        "x1": 342.364013671875,
        "x2": 558.4312133789062,
        "y1": 428.4649353027344,
        "y2": 489.1119384765625
      },
      "text": "male CTO in the video. (1 - Strongly disagree 7 - Strongly agree) • I felt that the man was an extension of me. • When something happened to the man in the video, I felt like it happened to me. • I felt the man’s body was my body."
    }, {
      "page": 11,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.71533203125,
        "y1": 506.02203369140625,
        "y2": 548.958984375
      },
      "text": "B.4 Fear of Missing Out The following survey questions were administered to measure participants’ fear of missing out (FOMO) after each of the two viewing sessions of the 360° video."
    }, {
      "page": 11,
      "region": {
        "x1": 328.8670959472656,
        "x2": 558.5866088867188,
        "y1": 558.9207153320312,
        "y2": 597.655029296875
      },
      "text": "(1) How much do you agree with the following statements? (1 - Strongly disagree 7 - Strongly agree) • The fear of missing out on parts of the story distracted me when watching the video."
    }, {
      "page": 11,
      "region": {
        "x1": 343.70001220703125,
        "x2": 559.5626831054688,
        "y1": 602.7568969726562,
        "y2": 707.2440185546875
      },
      "text": "• I felt frustrated because I couldn’t see the both sides of the story in full. • I was concerned that while I was watching one side, there were more important events happening on the other side. • I would prefer watching one side of the flm in full at a time. – If [ I would prefer watching one side of the flm in full at a time. ] < 4 * Why wouldn’t you prefer watching one side of the flm in full at a time?"
    }, {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 241.74191284179688,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "From FOMO to JOMO: Fear and Joy of Missing Out in 360° Video"
    }, {
      "page": 12,
      "region": {
        "x1": 53.52899932861328,
        "x2": 295.558349609375,
        "y1": 243.07098388671875,
        "y2": 296.96600341796875
      },
      "text": "B.5 Joy of Missing Out The following survey questions were administered to measure participants’ joy of missing out (JOMO) after each of the two viewing sessions of the 360° video in the three switching conditions A, B and C."
    }, {
      "page": 12,
      "region": {
        "x1": 64.71011352539062,
        "x2": 294.4296875,
        "y1": 303.9866943359375,
        "y2": 342.7200012207031
      },
      "text": "(1) How much do you agree with the following statements? (1 - Strongly disagree 7 - Strongly agree) • It was exciting that the story proceeded on two sides at the same time."
    }, {
      "page": 12,
      "region": {
        "x1": 79.54671478271484,
        "x2": 294.04779052734375,
        "y1": 347.8218688964844,
        "y2": 430.3909912109375
      },
      "text": "• It was fun to switch the sides while watching the flm. • I enjoyed switching between the two perspectives. • It was exciting that the story proceeded on two sides at the same time. – If [It was exciting that the story proceeded on two sides simultaneously.] > 4 * Why was it exciting that the story proceeded on two sides simultaneously?"
    }, {
      "page": 12,
      "region": {
        "x1": 86.24308013916016,
        "x2": 294.04779052734375,
        "y1": 435.49285888671875,
        "y2": 474.22698974609375
      },
      "text": "– If [ It was exciting that the story proceeded on two sides simultaneously. ] < 4 * Why wasn’t it exciting that the story proceeded on two sides simultaneously?"
    }, {
      "page": 12,
      "region": {
        "x1": 53.79800033569336,
        "x2": 292.1618347167969,
        "y1": 489.9949951171875,
        "y2": 510.26409912109375
      },
      "text": "B.6 Open-ended Questions about FOMO, JOMO and User-experience"
    }, {
      "page": 12,
      "region": {
        "x1": 53.52899932861328,
        "x2": 294.2149658203125,
        "y1": 518.1099243164062,
        "y2": 534.9240112304688
      },
      "text": "The following open-ended questions were administered to further understand participants’ FOMO, JOMO, and User-experience."
    }, {
      "page": 12,
      "region": {
        "x1": 64.71011352539062,
        "x2": 294.0455322265625,
        "y1": 541.9447021484375,
        "y2": 558.759033203125
      },
      "text": "(1) Please describe how it felt to feel distracted. (2) Why wouldn’t you prefer watching one side of the flm in"
    }, {
      "page": 12,
      "region": {
        "x1": 64.70359802246094,
        "x2": 294.0447998046875,
        "y1": 563.8629760742188,
        "y2": 580.677001953125
      },
      "text": "full at a time? (3) Why would you prefer watching one side of the flm in full"
    }, {
      "page": 12,
      "region": {
        "x1": 64.70359802246094,
        "x2": 267.34429931640625,
        "y1": 585.7809448242188,
        "y2": 602.5929565429688
      },
      "text": "at a time? (4) Why was it difcult to choose which side to watch?"
    }, {
      "page": 12,
      "region": {
        "x1": 435.3702087402344,
        "x2": 558.1996459960938,
        "y1": 63.2986946105957,
        "y2": 67.34698486328125
      },
      "text": "CHI ’21, May 8–13, 2021, Yokohama, Japan"
    }],
    "title": {
      "page": 10,
      "region": {
        "x1": 317.9549865722656,
        "x2": 485.04974365234375,
        "y1": 432.85400390625,
        "y2": 455.8612976074219
      },
      "text": "B SURVEY QUESTIONS B.1 Experience with Technology"
    }
  }, {
    "paragraphs": [{
      "page": 12,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.189453125,
        "y1": 297.76092529296875,
        "y2": 391.2879943847656
      },
      "text": "In the frst viewing session in the free choice (A) condition, the number of times the participants switched sides varied from 3 to 84 (median 17, mean 27, SD 25). The majority of the participants (55%, n=17). made 3-20 switches. In the second viewing session in the free choice condition, the average number of side switches decreased to (median 10, mean 16, SD 19), as shown in Table 4. We also observed a pattern in which the participants would watch parts of the flm in the second session that they had missed in the frst, as shown in Figure 2."
    }, {
      "page": 12,
      "region": {
        "x1": 317.6860046386719,
        "x2": 559.189208984375,
        "y1": 405.13800048828125,
        "y2": 502.8689880371094
      },
      "text": "C.2 Side Ratios. The (female) side ratio is the ratio of the total time spent on the female side compared to the total time spent on any side of the video. For example, if the user spent 7 minutes of the 10 minute video on the female’s side and 3 minutes on the male’s side, the side ratio is 0.7. In the frst viewing session of the free choice condition, 71% of the participants spent more time on the female side. In the second viewing session of the free choice condition, the percentage dropped slightly to 68%."
    }, {
      "page": 12,
      "region": {
        "x1": 317.6860046386719,
        "x2": 558.5357666015625,
        "y1": 516.7200317382812,
        "y2": 604.8370361328125
      },
      "text": "C.3 Rotational Speed. The rotational speed in a HMD shows how fast the user moves their head in the HMD when watching the video. The units are degrees per second. Given the user’s initial yaw and pitch λ1, ϕ1, fnal yaw and pitch λ2, ϕ2, and the time it takes to move from the initial angle to the fnal angle ∆t , the rotational speed is calculated by dividing the central angle by time, that is, arccos(sin ϕ1 · sin ϕ2 + cos ϕ1 · cos ϕ2 · cos(λ1 − λ2))/∆t . The data is shown in Table 5."
    }],
    "title": {
      "page": 12,
      "region": {
        "x1": 317.9549865722656,
        "x2": 440.22412109375,
        "y1": 266.906005859375,
        "y2": 289.9132995605469
      },
      "text": "C ROTATIONAL DATA C.1 Side Switches."
    }
  }]
}